{
  "stories": [
    {
      "id": "45138",
      "author": "JAN HARRISON",
      "title": "Open Door Opportunity",
      "url": "http://fiftywordstories.com/2021/02/18/jan-harrison-open-door-opportunity/",
      "storyHTML": "<p>She said she would leave the door open for me and she would be upstairs, waiting, dressed appropriately. As I approached the door, my heart began to beat faster. It was dark downstairs but I knew my way around. I’d been in this jewellers’ shop many times before, just browsing…</p>",
      "storyText": "She said she would leave the door open for me and she would be upstairs, waiting, dressed appropriately. As I approached the door, my heart began to beat faster. It was dark downstairs but I knew my way around. I'd been in this jewellers' shop many times before, just browsing…",
      "bio": "Jan Harrison likes to write ditties, poetry and short stories and has had one children’s short story published. A Graphologist by profession she enjoys most aspects of creative writing.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45136",
      "author": "KURT VAN RISTELL",
      "title": "Climber",
      "url": "http://fiftywordstories.com/2021/02/18/kurt-van-ristell-climber/",
      "storyHTML": "<p>The quality of the light is different at this altitude. Faint as the air. The face of his watch has frozen over, and to wipe it, he would need to un-pocket his warm right hand.</p><p>It might be noon or twilight.</p><p>He crunches onward, past another huddled pair of bodies.</p>",
      "storyText": "The quality of the light is different at this altitude. Faint as the air. The face of his watch has frozen over, and to wipe it, he would need to un-pocket his warm right hand. It might be noon or twilight. He crunches onward, past another huddled pair of bodies.",
      "bio": "Kurt Van Ristell is an author from London, England, who writes because travel is simply too expensive.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45130",
      "author": "MICHAEL ANTHONY FAGAN",
      "title": "Juniper",
      "url": "http://fiftywordstories.com/2021/02/16/michael-anthony-fagan-juniper/",
      "storyHTML": "<p>By daylight, they told her how she was born: her birth mother fled, abandoned like a burning oil rig.</p><p>She was wildfire: unplanned, unwanted.</p><p>When the world was at its darkest, she carved a hole in the sky and crawled inside.</p><p>The stars look different when you are behind them.</p>",
      "storyText": "By daylight, they told her how she was born: her birth mother fled, abandoned like a burning oil rig. She was wildfire: unplanned, unwanted. When the world was at its darkest, she carved a hole in the sky and crawled inside. The stars look different when you are behind them.",
      "bio": "Michael Anthony Fagan is a Scottish fiction writer from just outside Glasgow. He is a high school English and Media teacher who has a passion for horror, science fiction, and making documentaries. He is currently working on his debut novel and finding places to publish his short stories.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45128",
      "author": "STEPHEN GOODLAD",
      "title": "Clean Break",
      "url": "http://fiftywordstories.com/2021/02/16/stephen-goodlad-clean-break/",
      "storyHTML": "<p>You stood small, despite borrowed heels, all grown up in a too-long evening gown that showed off your delicate collarbone. When you tripped and fell, it broke cleanly, requiring two pins to repair.</p><p>I kissed the line of stitches as you lay in bed, and you only cried out once.</p>",
      "storyText": "You stood small, despite borrowed heels, all grown up in a too-long evening gown that showed off your delicate collarbone. When you tripped and fell, it broke cleanly, requiring two pins to repair. I kissed the line of stitches as you lay in bed, and you only cried out once.",
      "bio": "Stephen is a retired Social Worker using writing as an antidote to lockdown.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45120",
      "author": "HELEN CHAMBERS",
      "title": "Old Bird",
      "url": "http://fiftywordstories.com/2021/02/15/helen-chambers-old-bird/",
      "storyHTML": "<p>Snarling traffic overloads the melting roads, depositing bickering families to scuttle across the beach and leave behind their litter. She picks over their detritus at dawn, venturing out alone. As she paddles on the rising tide, she is gilded by the sun which breathes its infected warmth over the sand.</p>",
      "storyText": "Snarling traffic overloads the melting roads, depositing bickering families to scuttle across the beach and leave behind their litter. She picks over their detritus at dawn, venturing out alone. As she paddles on the rising tide, she is gilded by the sun which breathes its infected warmth over the sand.",
      "bio": "Helen Chambers wrote this story.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45118",
      "author": "JOSEF LEMOINE",
      "title": "Learning to Love",
      "url": "http://fiftywordstories.com/2021/02/15/josef-lemoine-learning-to-love/",
      "storyHTML": "<p>The lovebot learned to love by watching her creator, studying his responses to his wife’s tearful pleas.</p><p>When the creator finally commanded the lovebot to adore him, she mirrored his demonstrations by cocking back her steel-boned fist. One strike was all it took to reveal the depths of her love.</p>",
      "storyText": "The lovebot learned to love by watching her creator, studying his responses to his wife's tearful pleas. When the creator finally commanded the lovebot to adore him, she mirrored his demonstrations by cocking back her steel-boned fist. One strike was all it took to reveal the depths of her love.",
      "bio": "Josef Lemoine is a Filipino-American writer living in Southern California with his wife, son, and daughter. In a past life, his work could be found in Word Riot, RipRap, The Legendary, and Boston Literary Magazine. His writing can still be found in Dogzplot, Bending Genres, and Medium. A poem of his will soon be published in **** Men Say to Me: A Poetry Anthology in Response to Toxic Masculinity from Moon Tide Press. Follow him at <a href=\"https://www.instagram.com/joseflemoine\" target=\"_blank\" rel=\"noopener noreferrer\">instagram.com/joseflemoine</a>",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45106",
      "author": "EILEEN MARDRES",
      "title": "Valentine’s Day Revisited",
      "url": "http://fiftywordstories.com/2021/02/14/eileen-mardres-valentines-day-revisited/",
      "storyHTML": "<p>I loved him, you know. He didn’t deserve it, but it still ripped my heart to shreds when he left me. Oh, I moved on, had a wonderful life, almost forgot, even came to understand and wish him happiness. But forgiveness? Ha! February 14th: time to again torture his effigy.</p>",
      "storyText": "I loved him, you know. He didn't deserve it, but it still ripped my heart to shreds when he left me. Oh, I moved on, had a wonderful life, almost forgot, even came to understand and wish him happiness. But forgiveness? Ha! February 14th: time to again torture his effigy.",
      "bio": "Eileen enjoys turning life into bite-size stories.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "44883",
      "author": "CAROLYN MARTIN",
      "title": "Let’s Talk About Love – with thanks to Cole Porter",
      "url": "http://fiftywordstories.com/2021/02/14/carolyn-martin-lets-talk-about-love-with-thanks-to-cole-porter/",
      "storyHTML": "<p><em>C’est magnifique</em>, this thing called love.<br>Since we met, you do something to me<br>and anything goes. You’re easy to love so<br>let’s misbehave night and day.<br>Blow, Gabriel, blow! It’s just one<br>of those things: we shall never be younger.<br>Come along with me. How could we be wrong?</p>",
      "storyText": "C'est magnifique , this thing called love. Since we met, you do something to me and anything goes. You're easy to love so let's misbehave night and day. Blow, Gabriel, blow! It's just one of those things: we shall never be younger. Come along with me. How could we be wrong?",
      "bio": "From associate professor of English to management trainer to retiree, Carolyn Martin is a lover of gardening and snorkeling, writing and photography. Her poems have been published in more than 125 journals throughout North America, Australia, and the UK. She is currently the poetry editor of <em>Kosmos Quarterly: journal for global transformation</em>. Find out more at <a href=\"http://carolynmartinpoet.com\" rel=\"noopener\" target=\"_blank\">carolynmartinpoet.com</a>.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45110",
      "author": "JENNIFER FREED",
      "title": "I Call My Mother",
      "url": "http://fiftywordstories.com/2021/02/11/jennifer-freed-i-call-my-mother/",
      "storyHTML": "<p>Her talk floats, changes course<br>like blown soap bubbles. Then—</p><p>gone. Someone else’s<br>laughter comes near, draws hers.</p><p>She drifts<br>toward whoever is taking</p><p>her pulse, lifting her spoon,<br>doesn’t hear me</p><p>calling<br>into the receiver.</p><p>I stand in my kitchen, phone to ear,<br>listening</p><p>to the room she’s in</p>",
      "storyText": "Her talk floats, changes course like blown soap bubbles. Then -  gone. Someone else's laughter comes near, draws hers. She drifts toward whoever is taking her pulse, lifting her spoon, doesn't hear me calling into the receiver. I stand in my kitchen, phone to ear, listening to the room she's in",
      "bio": "Jennifer Freed writes mostly poems. Her mother survived a cerebral hemorrhage two years ago. Learn more at <a href=\"http://jfreed.weebly.com\" target=\"_blank\" rel=\"noopener\">jfreed.weebly.com</a>.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45108",
      "author": "MICHELLE WILSON",
      "title": "Pills",
      "url": "http://fiftywordstories.com/2021/02/11/michelle-wilson-pills/",
      "storyHTML": "<p>Coffee to wake up. A pill to focus. More pills to slim down, be happy, relax, fall asleep. Botox for lips, implants for curves, chemical peels for skin, filters for photos. Joy highlighted, gratitude expressed, sadness made palatable (never a dull moment).</p><p>Post, tag, comment—repeat.</p><p>Still not good enough.</p>",
      "storyText": "Coffee to wake up. A pill to focus. More pills to slim down, be happy, relax, fall asleep. Botox for lips, implants for curves, chemical peels for skin, filters for photos. Joy highlighted, gratitude expressed, sadness made palatable (never a dull moment). Post, tag, comment - repeat. Still not good enough.",
      "bio": "Michelle Wilson’s words have appeared or are forthcoming in&nbsp;<i>Potato Soup Journal, Litro Magazine, The Drabble, Entropy Squared</i>,&nbsp;<i>50-Word Stories</i>,&nbsp;<i>101 Words</i>,&nbsp;<i>Literally Stories</i>,&nbsp;<i>Flash Fiction Magazine</i>, and&nbsp;<i>Mr. Beller’s Neighborhood</i>, among others. She lives in Miami Beach, Florida. Sometimes she can be found at&nbsp;<a href=\"https://medium.com/@wilsmk\" target=\"_blank\" rel=\"noopener noreferrer\">https://medium.com/@wilsmk</a>.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45102",
      "author": "BILL DIAMOND",
      "title": "Faith in Progress",
      "url": "http://fiftywordstories.com/2021/02/10/bill-diamond-faith-in-progress/",
      "storyHTML": "<p>Whenever things looked grim, grandfather was upbeat. “It’s the best of times. Medicine conquers disease. Education brings opportunity. Hard work rewards.”</p><p>Then, the pandemic struck. Everything turned dark. Jobs disappeared. Schools closed. Disease prevailed.</p><p>Even as the virus took his breath, grandfather reassured, “It will get better. Work at it.”</p>",
      "storyText": "Whenever things looked grim, grandfather was upbeat. \"It's the best of times. Medicine conquers disease. Education brings opportunity. Hard work rewards.\" Then, the pandemic struck. Everything turned dark. Jobs disappeared. Schools closed. Disease prevailed. Even as the virus took his breath, grandfather reassured, \"It will get better. Work at it.\"",
      "bio": "Bill Diamond finds pleasure in translating thoughts into words and polishing their rough edges. It helps him to better grasp the world and its quirks.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45100",
      "author": "MAGGIE",
      "title": "When there seems to be a cloud around every silver lining",
      "url": "http://fiftywordstories.com/2021/02/10/maggie-when-there-seems-to-be-a-cloud-around-every-silver-lining/",
      "storyHTML": "<p>An exotic burst of neon green at my feeder. Birds from paradise in my grey garden. Raising spirits along with urban myths.</p><p><em>Released by Hendrix in the swinging 60s.</em></p><p><em>Escaped from the set of The African Queen.</em></p><p>But this is not fake news: Conservationists Call for Cull of Invasive Parakeets.</p>",
      "storyText": "An exotic burst of neon green at my feeder. Birds from paradise in my grey garden. Raising spirits along with urban myths.  Released by Hendrix in the swinging 60s.   Escaped from the set of The African Queen.  But this is not fake news: Conservationists Call for Cull of Invasive Parakeets.",
      "bio": "Maggie, who has only recently started writing flash fiction, teaches in the West Midlands but her heart resides in a coastal village in West Wales. When not writing, she enjoys walking her two chocolate labs on windswept beaches.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45092",
      "author": "E.L. BLIZZARD",
      "title": "Mama",
      "url": "http://fiftywordstories.com/2021/02/09/e-l-blizzard-mama/",
      "storyHTML": "<p>Sucking, searching for air, she’s like a hooked fish dying bit by bit on a riverbank. Wringing rag, wiping forehead, singing lullabies, pushing ginger ale.</p><p>Like she taught me.</p><p>Really, I listen through phone to coughs and love words between coughs.</p><p>boots pacing<br>river’s peaceful trail<br>no pole this time</p>",
      "storyText": "Sucking, searching for air, she's like a hooked fish dying bit by bit on a riverbank. Wringing rag, wiping forehead, singing lullabies, pushing ginger ale. Like she taught me. Really, I listen through phone to coughs and love words between coughs. boots pacing river's peaceful trail no pole this time",
      "bio": "E. L. Blizzard lives in the US South with work in&nbsp;<i>The</i>&nbsp;<i>Drabble</i>,&nbsp;<i>The Other Bunny</i>,&nbsp;<i>Drifting Sands</i>,&nbsp;<i>Bones</i>,&nbsp;<i>Ekphrastic Review</i>,&nbsp;<i>The New Verse News</i>,&nbsp;<i>FemkuMag</i>,&nbsp;<i>Friday Flash Fiction</i>,&nbsp;<i>Flash Fiction Magazine</i>,<i>&nbsp;Failed Haiku</i>,<i>&nbsp;</i>and several others. Over years she’s worked in advocacy, allying with immigrants/refugees, cis/LGBTQ+ survivors of intimate partner violence, and those experiencing homelessness.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45090",
      "author": "JONATHAN KOSIK",
      "title": "A Minor Comfort",
      "url": "http://fiftywordstories.com/2021/02/09/jonathan-kosik-a-minor-comfort/",
      "storyHTML": "<p>Before the last shovelful. Before the words spoken in the rain by the mound. Before the whispering ventilator. Before the cough that stole the taste of food from his tongue. Before the state of everything changed.</p><p>Long before. My father hugged me after a scraped knee. A minor comfort… everlasting.</p>",
      "storyText": "Before the last shovelful. Before the words spoken in the rain by the mound. Before the whispering ventilator. Before the cough that stole the taste of food from his tongue. Before the state of everything changed. Long before. My father hugged me after a scraped knee. A minor comfort… everlasting.",
      "bio": "Jonathan enjoys playing out of tune solos on his daughter’s ukulele while she demands he stop. He enjoys writing very short fiction and very long fiction. At this point in his life, he is beginning to suspect a thief is at work stealing his hair while he sleeps.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45081",
      "author": "BOB McWILLIAMS",
      "title": "The Morning Commute",
      "url": "http://fiftywordstories.com/2021/02/08/bob-mcwilliams-the-morning-commute/",
      "storyHTML": "<p>I enter the packed subway car, locate a seat and sit. Another day, another dollar. I open my newspaper, taking out my new prescription glasses. Ready to read, I look around. Panic engulfs me.</p><p>I am surrounded by faceless, shuffling bots! I remove the glasses. Reading the paper can wait.</p>",
      "storyText": "I enter the packed subway car, locate a seat and sit. Another day, another dollar. I open my newspaper, taking out my new prescription glasses. Ready to read, I look around. Panic engulfs me. I am surrounded by faceless, shuffling bots! I remove the glasses. Reading the paper can wait.",
      "bio": "Bob McWilliams retired and seeking a brighter 2021, Bob enjoys writing short fiction and poetry. When not writing, Bob enjoys reading, his dogs and the outdoors.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45079",
      "author": "JIM LATHAM",
      "title": "The Frog in the Pot",
      "url": "http://fiftywordstories.com/2021/02/08/jim-latham-the-frog-in-the-pot/",
      "storyHTML": "<p>The border guard shakes his head. He won’t take my money or my passport.</p><p>The setting sun shines on the suitcase in my right hand. Behind me: broken promises and empty malls. Injustice, greed, and magical thinking.</p><p>I’m the frog in the pot.</p><p>I waited too long to get out.</p>",
      "storyText": "The border guard shakes his head. He won't take my money or my passport. The setting sun shines on the suitcase in my right hand. Behind me: broken promises and empty malls. Injustice, greed, and magical thinking. I'm the frog in the pot. I waited too long to get out.",
      "bio": "Jim Latham is a writer, hiker, and traveler. More of his writing can be found at <a href=\"https://jimlatham.substack.com\" rel=\"noopener\" target=\"_blank\">jimlatham.substack.com</a>",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45067",
      "author": "MARC LITTMAN",
      "title": "First Laugh",
      "url": "http://fiftywordstories.com/2021/02/05/marc-littman-first-laugh/",
      "storyHTML": "<p>The Navajo celebrate a baby’s first laugh. It’s considered one of life’s special moments like when a newborn cries. They pass around salt, once prized for its scarcity.</p><p>My baby never cried or laughed, but I still taste salt in the tears I shed for him after all these years.</p>",
      "storyText": "The Navajo celebrate a baby's first laugh. It's considered one of life's special moments like when a newborn cries. They pass around salt, once prized for its scarcity. My baby never cried or laughed, but I still taste salt in the tears I shed for him after all these years.",
      "bio": "Marc Littman is a short story writer, novelist, and playwright inspired by everyday life.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45065",
      "author": "JOHN H DROMEY",
      "title": "Gloomy Job Evaluation",
      "url": "http://fiftywordstories.com/2021/02/05/john-h-dromey-gloomy-job-evaluation/",
      "storyHTML": "<p>“I have misgivings about our new meteorologist,” an anchorman told his station manager. “In my estimation, she’s not at all well-suited to the job.”</p><p>“What’s her problem?”</p><p>“She consistently disregards National Weather Service forecasts for foggy, overcast, or rainy days. Instead, Annie invariably predicts the sun will come out tomorrow.”</p>",
      "storyText": "\"I have misgivings about our new meteorologist,\" an anchorman told his station manager. \"In my estimation, she's not at all well-suited to the job.\" \"What's her problem?\" \"She consistently disregards National Weather Service forecasts for foggy, overcast, or rainy days. Instead, Annie invariably predicts the sun will come out tomorrow.\"",
      "bio": "John H. Dromey’s short fiction’s been published in&nbsp;<i>Mystery Weekly Magazine</i>&nbsp;and over 175 other venues.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45058",
      "author": "DARA NARAGHI",
      "title": "Agree to Disagree",
      "url": "http://fiftywordstories.com/2021/02/04/dara-naghari-agree-to-disagree/",
      "storyHTML": "<p>With the weighty tome agape in my clutches, I strode across the antechamber, cantillating synonyms with imperturbable tenacity.</p><p>“What are you doing?” she inquired quizzically.</p><p>“Memorizing the thesaurus to become a better writer,” I expounded.</p><p>“I don’t think that’s how it works,” she propounded equivocally.</p><p>“Concede to nonconcur,” I retorted.</p>",
      "storyText": "With the weighty tome agape in my clutches, I strode across the antechamber, cantillating synonyms with imperturbable tenacity. \"What are you doing?\" she inquired quizzically. \"Memorizing the thesaurus to become a better writer,\" I expounded. \"I don't think that's how it works,\" she propounded equivocally. \"Concede to nonconcur,\" I retorted.",
      "bio": "Dara Naraghi has written comics and graphic novels of all types, from self-published zines to New York Times best sellers.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    },
    {
      "id": "45055",
      "author": "BOB THURBER",
      "title": "Impressing an Old Flame at our 25th High School reunion",
      "url": "http://fiftywordstories.com/2021/02/04/bob-thurber-impressing-an-old-flame-at-our-25th-high-school-reunion/",
      "storyHTML": "<p>She said, So what do you do?</p><p>I said, I’m a pickpocket.</p><p>Seriously, she said.</p><p>I handed back her phone and wristwatch.</p><p>That’s amazing, she said.</p><p>I produced her wedding band.</p><p>She studied it a moment.</p><p>Actually, I’m recently divorced, she said.</p><p>So I returned her credit cards and cash.</p>",
      "storyText": "She said, So what do you do? I said, I'm a pickpocket. Seriously, she said. I handed back her phone and wristwatch. That's amazing, she said. I produced her wedding band. She studied it a moment. Actually, I'm recently divorced, she said. So I returned her credit cards and cash.",
      "bio": "Bob Thurber is the author of six books. Regarded as a master of Flash and Micro Fiction, his work has appeared in Esquire and other magazines, been anthologized 60 times, received a long list of awards, and been utilized in schools and colleges throughout the world. He resides in Massachusetts. Visit his website at&nbsp;<a href=\"http://bobthurber.net/\" target=\"_blank\" rel=\"noopener noreferrer\">BobThurber.net</a>.",
      "dateScraped": "Fri, 19 Feb 2021 09:21:03 GMT"
    }
  ],
  "storiesToEdit": []
}