{
  "stories": [
    {
      "id": "45090",
      "author": "JONATHAN KOSIK",
      "title": "A Minor Comfort",
      "url": "http://fiftywordstories.com/2021/02/09/jonathan-kosik-a-minor-comfort/",
      "storyHTML": "<p>Before the last shovelful. Before the words spoken in the rain by the mound. Before the whispering ventilator. Before the cough that stole the taste of food from his tongue. Before the state of everything changed.</p><p>Long before. My father hugged me after a scraped knee. A minor comfort… everlasting.</p>",
      "storyText": "Before the last shovelful. Before the words spoken in the rain by the mound. Before the whispering ventilator. Before the cough that stole the taste of food from his tongue. Before the state of everything changed. Long before. My father hugged me after a scraped knee. A minor comfort… everlasting.",
      "bio": "Jonathan enjoys playing out of tune solos on his daughter’s ukulele while she demands he stop. He enjoys writing very short fiction and very long fiction. At this point in his life, he is beginning to suspect a thief is at work stealing his hair while he sleeps.",
      "dateScraped": 1612877041103
    },
    {
      "id": "45081",
      "author": "BOB McWILLIAMS",
      "title": "The Morning Commute",
      "url": "http://fiftywordstories.com/2021/02/08/bob-mcwilliams-the-morning-commute/",
      "storyHTML": "<p>I enter the packed subway car, locate a seat and sit. Another day, another dollar. I open my newspaper, taking out my new prescription glasses. Ready to read, I look around. Panic engulfs me.</p><p>I am surrounded by faceless, shuffling bots! I remove the glasses. Reading the paper can wait.</p>",
      "storyText": "I enter the packed subway car, locate a seat and sit. Another day, another dollar. I open my newspaper, taking out my new prescription glasses. Ready to read, I look around. Panic engulfs me. I am surrounded by faceless, shuffling bots! I remove the glasses. Reading the paper can wait.",
      "bio": "Bob McWilliams retired and seeking a brighter 2021, Bob enjoys writing short fiction and poetry. When not writing, Bob enjoys reading, his dogs and the outdoors.",
      "dateScraped": 1612877041107
    },
    {
      "id": "45079",
      "author": "JIM LATHAM",
      "title": "The Frog in the Pot",
      "url": "http://fiftywordstories.com/2021/02/08/jim-latham-the-frog-in-the-pot/",
      "storyHTML": "<p>The border guard shakes his head. He won’t take my money or my passport.</p><p>The setting sun shines on the suitcase in my right hand. Behind me: broken promises and empty malls. Injustice, greed, and magical thinking.</p><p>I’m the frog in the pot.</p><p>I waited too long to get out.</p>",
      "storyText": "The border guard shakes his head. He won't take my money or my passport. The setting sun shines on the suitcase in my right hand. Behind me: broken promises and empty malls. Injustice, greed, and magical thinking. I'm the frog in the pot. I waited too long to get out.",
      "bio": "Jim Latham is a writer, hiker, and traveler. More of his writing can be found at <a href=\"https://jimlatham.substack.com\" rel=\"noopener\" target=\"_blank\">jimlatham.substack.com</a>",
      "dateScraped": 1612877041109
    },
    {
      "id": "45067",
      "author": "MARC LITTMAN",
      "title": "First Laugh",
      "url": "http://fiftywordstories.com/2021/02/05/marc-littman-first-laugh/",
      "storyHTML": "<p>The Navajo celebrate a baby’s first laugh. It’s considered one of life’s special moments like when a newborn cries. They pass around salt, once prized for its scarcity.</p><p>My baby never cried or laughed, but I still taste salt in the tears I shed for him after all these years.</p>",
      "storyText": "The Navajo celebrate a baby's first laugh. It's considered one of life's special moments like when a newborn cries. They pass around salt, once prized for its scarcity. My baby never cried or laughed, but I still taste salt in the tears I shed for him after all these years.",
      "bio": "Marc Littman is a short story writer, novelist, and playwright inspired by everyday life.",
      "dateScraped": 1612877041112
    },
    {
      "id": "45065",
      "author": "JOHN H DROMEY",
      "title": "Gloomy Job Evaluation",
      "url": "http://fiftywordstories.com/2021/02/05/john-h-dromey-gloomy-job-evaluation/",
      "storyHTML": "<p>“I have misgivings about our new meteorologist,” an anchorman told his station manager. “In my estimation, she’s not at all well-suited to the job.”</p><p>“What’s her problem?”</p><p>“She consistently disregards National Weather Service forecasts for foggy, overcast, or rainy days. Instead, Annie invariably predicts the sun will come out tomorrow.”</p>",
      "storyText": "\"I have misgivings about our new meteorologist,\" an anchorman told his station manager. \"In my estimation, she's not at all well-suited to the job.\" \"What's her problem?\" \"She consistently disregards National Weather Service forecasts for foggy, overcast, or rainy days. Instead, Annie invariably predicts the sun will come out tomorrow.\"",
      "bio": "John H. Dromey’s short fiction’s been published in&nbsp;<i>Mystery Weekly Magazine</i>&nbsp;and over 175 other venues.",
      "dateScraped": 1612877041115
    },
    {
      "id": "45058",
      "author": "DARA NARAGHI",
      "title": "Agree to Disagree",
      "url": "http://fiftywordstories.com/2021/02/04/dara-naghari-agree-to-disagree/",
      "storyHTML": "<p>With the weighty tome agape in my clutches, I strode across the antechamber, cantillating synonyms with imperturbable tenacity.</p><p>“What are you doing?” she inquired quizzically.</p><p>“Memorizing the thesaurus to become a better writer,” I expounded.</p><p>“I don’t think that’s how it works,” she propounded equivocally.</p><p>“Concede to nonconcur,” I retorted.</p>",
      "storyText": "With the weighty tome agape in my clutches, I strode across the antechamber, cantillating synonyms with imperturbable tenacity. \"What are you doing?\" she inquired quizzically. \"Memorizing the thesaurus to become a better writer,\" I expounded. \"I don't think that's how it works,\" she propounded equivocally. \"Concede to nonconcur,\" I retorted.",
      "bio": "Dara Naraghi has written comics and graphic novels of all types, from self-published zines to New York Times best sellers.",
      "dateScraped": 1612877041118
    },
    {
      "id": "45055",
      "author": "BOB THURBER",
      "title": "Impressing an Old Flame at our 25th High School reunion",
      "url": "http://fiftywordstories.com/2021/02/04/bob-thurber-impressing-an-old-flame-at-our-25th-high-school-reunion/",
      "storyHTML": "<p>She said, So what do you do?</p><p>I said, I’m a pickpocket.</p><p>Seriously, she said.</p><p>I handed back her phone and wristwatch.</p><p>That’s amazing, she said.</p><p>I produced her wedding band.</p><p>She studied it a moment.</p><p>Actually, I’m recently divorced, she said.</p><p>So I returned her credit cards and cash.</p>",
      "storyText": "She said, So what do you do? I said, I'm a pickpocket. Seriously, she said. I handed back her phone and wristwatch. That's amazing, she said. I produced her wedding band. She studied it a moment. Actually, I'm recently divorced, she said. So I returned her credit cards and cash.",
      "bio": "Bob Thurber is the author of six books. Regarded as a master of Flash and Micro Fiction, his work has appeared in Esquire and other magazines, been anthologized 60 times, received a long list of awards, and been utilized in schools and colleges throughout the world. He resides in Massachusetts. Visit his website at&nbsp;<a href=\"http://bobthurber.net/\" target=\"_blank\" rel=\"noopener noreferrer\">BobThurber.net</a>.",
      "dateScraped": 1612877041121
    },
    {
      "id": "45047",
      "author": "JOREE NOVOTNY",
      "title": "Warm to the touch and waiting",
      "url": "http://fiftywordstories.com/2021/02/03/joree-novotny-warm-to-the-touch-and-waiting/",
      "storyHTML": "<p>One day after revealing the lump beneath your gown, you’ll know to say<br>“Heavy,<br>thickened,<br>redness.”<br>One week after, waiting for results, you’ll know your<br>life insurance benefit<br>and the colors of purgatory.<br>Well-versed in specialists and staging,<br>you’ll plead<br>for strength,<br>more time,<br>a timely call,<br>easier sleep.<br>Grace.</p>",
      "storyText": "One day after revealing the lump beneath your gown, you'll know to say \"Heavy, thickened, redness.\" One week after, waiting for results, you'll know your life insurance benefit and the colors of purgatory. Well-versed in specialists and staging, you'll plead for strength, more time, a timely call, easier sleep. Grace.",
      "bio": "Joree writes what she knows, which isn’t much, but enough for her.",
      "dateScraped": 1612877041124
    },
    {
      "id": "45040",
      "author": "AS CZUK",
      "title": "Sunset in Pandemic Winter",
      "url": "http://fiftywordstories.com/2021/02/02/as-czuk-sunset-in-pandemic-winter/",
      "storyHTML": "<p>As the orchestra exhales its final fuschia note, the ink of night slides silently over hills. Twisting through the vines. Settling into the earth.</p><p>The stillness</p><p>weighs upon his back, too heavy to carry now. Face into the dirt, the world breaks into riotous silence. He is overwhelmed with loneliness.</p>",
      "storyText": "As the orchestra exhales its final fuschia note, the ink of night slides silently over hills. Twisting through the vines. Settling into the earth. The stillness weighs upon his back, too heavy to carry now. Face into the dirt, the world breaks into riotous silence. He is overwhelmed with loneliness.",
      "bio": "A.S. Czuk writes in solitude, in the middle of the night, when sleep’s evasiveness prevails. Writing is personal. Intimate. Private. Exposure is a harsh light that stings the eyes, but A.S. Czuk realizes now that life is much too brief to carry on in the dark.",
      "dateScraped": 1612877041127
    }
  ]
}