{
  "stories": [
    {
      "id": "45164",
      "author": "Pauline Rendall",
      "title": "Danse Macabre",
      "url": "http://fiftywordstories.com/2021/02/25/pauline-randall-danse-macabre/",
      "storyHTML": "<p>“Dance with me,” she said, holding out a skinny hand.</p><p>Mark felt the bones under her skin, saw the hollow eye sockets, heard the music floating through the night air.</p><p>With her arm around his waist, she led him into the throng of slow-moving dancers. “Come,” she said. “It’s time.”</p>",
      "storyText": "\"Dance with me,\" she said, holding out a skinny hand. Mark felt the bones under her skin, saw the hollow eye sockets, heard the music floating through the night air. With her arm around his waist, she led him into the throng of slow-moving dancers. \"Come,\" she said. \"It's time.\"",
      "bio": "Pauline Rendall writes crime as Pala K. Randall, and has self-published a novel under that name. She has a story in the collection In a Word: Murder. Pauline lives in Essex and loves opera and cats.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45162",
      "author": "LAURA BESLEY",
      "title": "Silent Cries Echo",
      "url": "http://fiftywordstories.com/2021/02/25/laura-besley-silent-cries-echo/",
      "storyHTML": "<p>On the eve of each full moon, the Elders meet.</p><p>“Betty and Jim,” the Chief says, her long earrings jangling, “are struggling. She’s too pale. He’s drinking too much. Someone needs to take them under their wing.”</p><p>I remember the pain of an empty cradle. “I’ll do it,” I say.</p>",
      "storyText": "On the eve of each full moon, the Elders meet. \"Betty and Jim,\" the Chief says, her long earrings jangling, \"are struggling. She's too pale. He's drinking too much. Someone needs to take them under their wing.\" I remember the pain of an empty cradle. \"I'll do it,\" I say.",
      "bio": "Laura Besley writes short fiction and squeezes her writing into the bookends of her day. She has lived in Holland, Germany, and Hong Kong, but now lives in land-locked central England and misses the sea. Her flash fiction collection, The Almost Mothers, was published in March 2020. She tweets at&nbsp;<a href=\"http://laurabesley/\" target=\"_blank\" rel=\"noopener noreferrer\">@laurabesley</a>.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45160",
      "author": "CASEY LAINE",
      "title": "Brief Meeting at Dawn",
      "url": "http://fiftywordstories.com/2021/02/24/casey-laine-brief-meeting-at-dawn/",
      "storyHTML": "<p>Night gushes:<br>“Oh, the glimmering beauty<br>Of the moon!<br>A gentle goddess<br>Draping her cool, white veils<br>across the land.”</p><p>Day smiles and nods.<br>Already the rising sun<br>Burns heavy on weary shoulders.<br>But eyes long blinded<br>Do not want for beauty,<br>Nor count up the cost<br>Of bearing Life.</p>",
      "storyText": "Night gushes: \"Oh, the glimmering beauty Of the moon! A gentle goddess Draping her cool, white veils across the land.\" Day smiles and nods. Already the rising sun Burns heavy on weary shoulders. But eyes long blinded Do not want for beauty, Nor count up the cost Of bearing Life.",
      "bio": "Casey Laine comes from a long line of talkative women. She works as Fantasy Editor at Cosmic Roots and Eldritch Shores, and publishes an annual anthology of fiction and poetry for her writing group, Writers Assembled. In her spare time, she chases butterflies with her camera. Find her <a href=\"https://www.facebook.com/profile.php?id=100011106735638\" rel=\"noopener\" target=\"_blank\">on Facebook</a>.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45158",
      "author": "DAVID DEREY",
      "title": "Unsinkable",
      "url": "http://fiftywordstories.com/2021/02/24/david-derey-unsinkable/",
      "storyHTML": "<p>I put my worry on a boat.<br>Left it in the Atlantic<br>Night after<br>as I sat crying on the pier<br>it came floating back</p><p>Drilled a hole in it<br>shoved it into the stream.<br>Haven’t seen it since.<br>I know it’s still out there</p><p>A ton of my worry.</p>",
      "storyText": "I put my worry on a boat. Left it in the Atlantic Night after as I sat crying on the pier it came floating back Drilled a hole in it shoved it into the stream. Haven't seen it since. I know it's still out there A ton of my worry.",
      "bio": "David Derey wrote this poem.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45156",
      "author": "DAVE ZACKER",
      "title": "Monsters on Alpha Centauri IV",
      "url": "http://fiftywordstories.com/2021/02/23/dave-zacker-monsters-on-alpha-centauri-iv/",
      "storyHTML": "<p>Escaped through the hatch!<br>No time for my suit.<br>No time for my helmet;<br>No time for my boots.</p><p>I’ll chance it outside,<br>It’s Earth-like enough;<br>Four light-years’ travel<br>Is making me tough.</p><p>I <em>must</em> save this mission.<br>Plain to see:<br>They’re changing into Centaurians,<br>The whole crew except me.</p>",
      "storyText": "Escaped through the hatch! No time for my suit. No time for my helmet; No time for my boots. I'll chance it outside, It's Earth-like enough; Four light-years' travel Is making me tough. I  must  save this mission. Plain to see: They're changing into Centaurians, The whole crew except me.",
      "bio": "Dave and his wife Kate live in rural Pennsylvania with their two hungry rescue cats. His work has appeared in Fifty Word Stories. He’ll always be thrilled remembering seeing Space Shuttle Columbia land at Edwards in 1983.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45154",
      "author": "BEN MIMMACK",
      "title": "Table For One",
      "url": "http://fiftywordstories.com/2021/02/23/ben-mimmack-table-for-one/",
      "storyHTML": "<p>“Can I borrow your paper?”</p><p>I looked up and knew she was the one. The universe had thrown us together. Forever. We would tell our children about this moment.</p><p>“Please do.”</p><p>She finished reading and left without another word.</p><p>The universe and I haven’t been seeing eye to eye lately.</p>",
      "storyText": "\"Can I borrow your paper?\" I looked up and knew she was the one. The universe had thrown us together. Forever. We would tell our children about this moment. \"Please do.\" She finished reading and left without another word. The universe and I haven't been seeing eye to eye lately.",
      "bio": "Ben has been trying to write happier stories. He’s not sure this is one of them.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45146",
      "author": "KARALYN WAYNE",
      "title": "Elena",
      "url": "http://fiftywordstories.com/2021/02/22/karalyn-wayne-elena/",
      "storyHTML": "<p>City council on Tuesdays, marathon practice on Wednesdays, volunteering on Thursdays, and late shift on Fridays. No friends; doesn’t have the time. Energy drinks fill her bag, and concealer to disguise tired eyes.</p><p>A bright smile hides the fact that she doubts she’ll ever live up to the world’s expectations.</p>",
      "storyText": "City council on Tuesdays, marathon practice on Wednesdays, volunteering on Thursdays, and late shift on Fridays. No friends; doesn't have the time. Energy drinks fill her bag, and concealer to disguise tired eyes. A bright smile hides the fact that she doubts she'll ever live up to the world's expectations.",
      "bio": "Karalyn Wayne enjoys reading poetry in her armchair with a warm drink close by. She takes inspiration from long walks with her dog and the conversations of noisy neighbors. When she isn’t procrastinating, she writes. This is her second published story.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45144",
      "author": "PAULA MacDONALD",
      "title": "Dinnertime",
      "url": "http://fiftywordstories.com/2021/02/22/paula-macdonald-dinnertime/",
      "storyHTML": "<p>The clink of ice cubes being dropped into a crystal glass. The pop of the decanter’s stopper, then the glugging sound of scotch being poured. Noises more familiar to my ten-year-old self than laughter or conversation. The shouting will start soon.</p><p>I escape to the silent sanctuary of my bedroom.</p>",
      "storyText": "The clink of ice cubes being dropped into a crystal glass. The pop of the decanter's stopper, then the glugging sound of scotch being poured. Noises more familiar to my ten-year-old self than laughter or conversation. The shouting will start soon. I escape to the silent sanctuary of my bedroom.",
      "bio": "Paula MacDonald is pursuing her life-long love of writing fiction, after a cancer diagnosis put things in perspective. Do what you love.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45142",
      "author": "JON FAIN",
      "title": "Split Check",
      "url": "http://fiftywordstories.com/2021/02/19/jon-fain-split-check/",
      "storyHTML": "<p>In a restaurant, after the entrees were cleared, her mother would take out her compact. For Grace, it’s the phone. The device whispers sweet gossip, swaps intimacies, but in the family tradition, the reflected image is never flattering enough. Like Mom, when cracked by disappointment, she doubles down on dessert.</p>",
      "storyText": "In a restaurant, after the entrees were cleared, her mother would take out her compact. For Grace, it's the phone. The device whispers sweet gossip, swaps intimacies, but in the family tradition, the reflected image is never flattering enough. Like Mom, when cracked by disappointment, she doubles down on dessert.",
      "bio": "Jon Fain’s most recent publications are a short story in Fiction on the Web, a humor piece in Riot Act, flash fiction in Back Patio Press, and a personal essay in Kaleidoscope: Exploring the Experience of Disability Through Literature and the Fine Arts. Twitter-wise, he’s <a href=\"https://twitter.com/jonsfain\" rel=\"noopener\" target=\"_blank\">@jonsfain</a>, where you can find links to his published work in 2020.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45140",
      "author": "ROBB LANUM",
      "title": "Cheated",
      "url": "http://fiftywordstories.com/2021/02/19/robb-lanum-cheated/",
      "storyHTML": "<p>Paul was enraged. He’d done everything right.</p><p>He’d aced the CPA exam at 22, slaved to buy the house with the backyard, skipped family vacations when busy season hit, put the twins through college. He’d held up his end of the bargain.</p><p>But his wife got old and died anyway.</p>",
      "storyText": "Paul was enraged. He'd done everything right. He'd aced the CPA exam at 22, slaved to buy the house with the backyard, skipped family vacations when busy season hit, put the twins through college. He'd held up his end of the bargain. But his wife got old and died anyway.",
      "bio": "Robb Lanum is a failed screenwriter in Los Angeles. His longer, epic works have appeared on 101words.org [link: 101words.org], and he was a winner of the <a href=\"https://lapl.org/short-stories\" rel=\"noopener\" target=\"_blank\">Summer 2020 Los Angeles Public Library Short Story Contest</a>.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45138",
      "author": "JAN HARRISON",
      "title": "Open Door Opportunity",
      "url": "http://fiftywordstories.com/2021/02/18/jan-harrison-open-door-opportunity/",
      "storyHTML": "<p>She said she would leave the door open for me and she would be upstairs, waiting, dressed appropriately. As I approached the door, my heart began to beat faster. It was dark downstairs but I knew my way around. I’d been in this jewellers’ shop many times before, just browsing…</p>",
      "storyText": "She said she would leave the door open for me and she would be upstairs, waiting, dressed appropriately. As I approached the door, my heart began to beat faster. It was dark downstairs but I knew my way around. I'd been in this jewellers' shop many times before, just browsing…",
      "bio": "Jan Harrison likes to write ditties, poetry and short stories and has had one children’s short story published. A Graphologist by profession she enjoys most aspects of creative writing.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45136",
      "author": "KURT VAN RISTELL",
      "title": "Climber",
      "url": "http://fiftywordstories.com/2021/02/18/kurt-van-ristell-climber/",
      "storyHTML": "<p>The quality of the light is different at this altitude. Faint as the air. The face of his watch has frozen over, and to wipe it, he would need to un-pocket his warm right hand.</p><p>It might be noon or twilight.</p><p>He crunches onward, past another huddled pair of bodies.</p>",
      "storyText": "The quality of the light is different at this altitude. Faint as the air. The face of his watch has frozen over, and to wipe it, he would need to un-pocket his warm right hand. It might be noon or twilight. He crunches onward, past another huddled pair of bodies.",
      "bio": "Kurt Van Ristell is an author from London, England, who writes because travel is simply too expensive.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45130",
      "author": "MICHAEL ANTHONY FAGAN",
      "title": "Juniper",
      "url": "http://fiftywordstories.com/2021/02/16/michael-anthony-fagan-juniper/",
      "storyHTML": "<p>By daylight, they told her how she was born: her birth mother fled, abandoned like a burning oil rig.</p><p>She was wildfire: unplanned, unwanted.</p><p>When the world was at its darkest, she carved a hole in the sky and crawled inside.</p><p>The stars look different when you are behind them.</p>",
      "storyText": "By daylight, they told her how she was born: her birth mother fled, abandoned like a burning oil rig. She was wildfire: unplanned, unwanted. When the world was at its darkest, she carved a hole in the sky and crawled inside. The stars look different when you are behind them.",
      "bio": "Michael Anthony Fagan is a Scottish fiction writer from just outside Glasgow. He is a high school English and Media teacher who has a passion for horror, science fiction, and making documentaries. He is currently working on his debut novel and finding places to publish his short stories.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45128",
      "author": "STEPHEN GOODLAD",
      "title": "Clean Break",
      "url": "http://fiftywordstories.com/2021/02/16/stephen-goodlad-clean-break/",
      "storyHTML": "<p>You stood small, despite borrowed heels, all grown up in a too-long evening gown that showed off your delicate collarbone. When you tripped and fell, it broke cleanly, requiring two pins to repair.</p><p>I kissed the line of stitches as you lay in bed, and you only cried out once.</p>",
      "storyText": "You stood small, despite borrowed heels, all grown up in a too-long evening gown that showed off your delicate collarbone. When you tripped and fell, it broke cleanly, requiring two pins to repair. I kissed the line of stitches as you lay in bed, and you only cried out once.",
      "bio": "Stephen is a retired Social Worker using writing as an antidote to lockdown.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45120",
      "author": "HELEN CHAMBERS",
      "title": "Old Bird",
      "url": "http://fiftywordstories.com/2021/02/15/helen-chambers-old-bird/",
      "storyHTML": "<p>Snarling traffic overloads the melting roads, depositing bickering families to scuttle across the beach and leave behind their litter. She picks over their detritus at dawn, venturing out alone. As she paddles on the rising tide, she is gilded by the sun which breathes its infected warmth over the sand.</p>",
      "storyText": "Snarling traffic overloads the melting roads, depositing bickering families to scuttle across the beach and leave behind their litter. She picks over their detritus at dawn, venturing out alone. As she paddles on the rising tide, she is gilded by the sun which breathes its infected warmth over the sand.",
      "bio": "Helen Chambers wrote this story.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45118",
      "author": "JOSEF LEMOINE",
      "title": "Learning to Love",
      "url": "http://fiftywordstories.com/2021/02/15/josef-lemoine-learning-to-love/",
      "storyHTML": "<p>The lovebot learned to love by watching her creator, studying his responses to his wife’s tearful pleas.</p><p>When the creator finally commanded the lovebot to adore him, she mirrored his demonstrations by cocking back her steel-boned fist. One strike was all it took to reveal the depths of her love.</p>",
      "storyText": "The lovebot learned to love by watching her creator, studying his responses to his wife's tearful pleas. When the creator finally commanded the lovebot to adore him, she mirrored his demonstrations by cocking back her steel-boned fist. One strike was all it took to reveal the depths of her love.",
      "bio": "Josef Lemoine is a Filipino-American writer living in Southern California with his wife, son, and daughter. In a past life, his work could be found in Word Riot, RipRap, The Legendary, and Boston Literary Magazine. His writing can still be found in Dogzplot, Bending Genres, and Medium. A poem of his will soon be published in **** Men Say to Me: A Poetry Anthology in Response to Toxic Masculinity from Moon Tide Press. Follow him at <a href=\"https://www.instagram.com/joseflemoine\" target=\"_blank\" rel=\"noopener noreferrer\">instagram.com/joseflemoine</a>",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45106",
      "author": "EILEEN MARDRES",
      "title": "Valentine’s Day Revisited",
      "url": "http://fiftywordstories.com/2021/02/14/eileen-mardres-valentines-day-revisited/",
      "storyHTML": "<p>I loved him, you know. He didn’t deserve it, but it still ripped my heart to shreds when he left me. Oh, I moved on, had a wonderful life, almost forgot, even came to understand and wish him happiness. But forgiveness? Ha! February 14th: time to again torture his effigy.</p>",
      "storyText": "I loved him, you know. He didn't deserve it, but it still ripped my heart to shreds when he left me. Oh, I moved on, had a wonderful life, almost forgot, even came to understand and wish him happiness. But forgiveness? Ha! February 14th: time to again torture his effigy.",
      "bio": "Eileen enjoys turning life into bite-size stories.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "44883",
      "author": "CAROLYN MARTIN",
      "title": "Let’s Talk About Love – with thanks to Cole Porter",
      "url": "http://fiftywordstories.com/2021/02/14/carolyn-martin-lets-talk-about-love-with-thanks-to-cole-porter/",
      "storyHTML": "<p><em>C’est magnifique</em>, this thing called love.<br>Since we met, you do something to me<br>and anything goes. You’re easy to love so<br>let’s misbehave night and day.<br>Blow, Gabriel, blow! It’s just one<br>of those things: we shall never be younger.<br>Come along with me. How could we be wrong?</p>",
      "storyText": "C'est magnifique , this thing called love. Since we met, you do something to me and anything goes. You're easy to love so let's misbehave night and day. Blow, Gabriel, blow! It's just one of those things: we shall never be younger. Come along with me. How could we be wrong?",
      "bio": "From associate professor of English to management trainer to retiree, Carolyn Martin is a lover of gardening and snorkeling, writing and photography. Her poems have been published in more than 125 journals throughout North America, Australia, and the UK. She is currently the poetry editor of <em>Kosmos Quarterly: journal for global transformation</em>. Find out more at <a href=\"http://carolynmartinpoet.com\" rel=\"noopener\" target=\"_blank\">carolynmartinpoet.com</a>.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45110",
      "author": "JENNIFER FREED",
      "title": "I Call My Mother",
      "url": "http://fiftywordstories.com/2021/02/11/jennifer-freed-i-call-my-mother/",
      "storyHTML": "<p>Her talk floats, changes course<br>like blown soap bubbles. Then—</p><p>gone. Someone else’s<br>laughter comes near, draws hers.</p><p>She drifts<br>toward whoever is taking</p><p>her pulse, lifting her spoon,<br>doesn’t hear me</p><p>calling<br>into the receiver.</p><p>I stand in my kitchen, phone to ear,<br>listening</p><p>to the room she’s in</p>",
      "storyText": "Her talk floats, changes course like blown soap bubbles. Then -  gone. Someone else's laughter comes near, draws hers. She drifts toward whoever is taking her pulse, lifting her spoon, doesn't hear me calling into the receiver. I stand in my kitchen, phone to ear, listening to the room she's in",
      "bio": "Jennifer Freed writes mostly poems. Her mother survived a cerebral hemorrhage two years ago. Learn more at <a href=\"http://jfreed.weebly.com\" target=\"_blank\" rel=\"noopener\">jfreed.weebly.com</a>.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    },
    {
      "id": "45108",
      "author": "MICHELLE WILSON",
      "title": "Pills",
      "url": "http://fiftywordstories.com/2021/02/11/michelle-wilson-pills/",
      "storyHTML": "<p>Coffee to wake up. A pill to focus. More pills to slim down, be happy, relax, fall asleep. Botox for lips, implants for curves, chemical peels for skin, filters for photos. Joy highlighted, gratitude expressed, sadness made palatable (never a dull moment).</p><p>Post, tag, comment—repeat.</p><p>Still not good enough.</p>",
      "storyText": "Coffee to wake up. A pill to focus. More pills to slim down, be happy, relax, fall asleep. Botox for lips, implants for curves, chemical peels for skin, filters for photos. Joy highlighted, gratitude expressed, sadness made palatable (never a dull moment). Post, tag, comment - repeat. Still not good enough.",
      "bio": "Michelle Wilson’s words have appeared or are forthcoming in&nbsp;<i>Potato Soup Journal, Litro Magazine, The Drabble, Entropy Squared</i>,&nbsp;<i>50-Word Stories</i>,&nbsp;<i>101 Words</i>,&nbsp;<i>Literally Stories</i>,&nbsp;<i>Flash Fiction Magazine</i>, and&nbsp;<i>Mr. Beller’s Neighborhood</i>, among others. She lives in Miami Beach, Florida. Sometimes she can be found at&nbsp;<a href=\"https://medium.com/@wilsmk\" target=\"_blank\" rel=\"noopener noreferrer\">https://medium.com/@wilsmk</a>.",
      "dateScraped": "Fri, 26 Feb 2021 05:48:10 GMT"
    }
  ],
  "storiesToEdit": []
}