{
  "stories": [
    {
      "id": "45166",
      "author": "SL BOWEN",
      "title": "No Secrets",
      "url": "http://fiftywordstories.com/2021/02/26/sl-bowen-no-secrets/",
      "storyHTML": "<p>The widow and her husband’s erstwhile friend met to plan the memorial service, discussing arrangements over cocktails in the courtyard of a lovely inn.</p><p>Did he ever suspect? the friend asked. A sudden gust of wind tore rose petals loose. They landed on the lovers like bloody tears.</p>",
      "storyText": "The widow and her husband's erstwhile friend met to plan the memorial service, discussing arrangements over cocktails in the courtyard of a lovely inn. Did he ever suspect? the friend asked. A sudden gust of wind tore rose petals loose. They landed on the lovers like bloody tears.",
      "bio": "S.L. Bowen has had work published in The George Mason Review, Writer’s Work, and 50-Word Stories.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45164",
      "author": "Pauline Rendall",
      "title": "Danse Macabre",
      "url": "http://fiftywordstories.com/2021/02/25/pauline-randall-danse-macabre/",
      "storyHTML": "<p>“Dance with me,” she said, holding out a skinny hand.</p><p>Mark felt the bones under her skin, saw the hollow eye sockets, heard the music floating through the night air.</p><p>With her arm around his waist, she led him into the throng of slow-moving dancers. “Come,” she said. “It’s time.”</p>",
      "storyText": "\"Dance with me,\" she said, holding out a skinny hand. Mark felt the bones under her skin, saw the hollow eye sockets, heard the music floating through the night air. With her arm around his waist, she led him into the throng of slow-moving dancers. \"Come,\" she said. \"It's time.\"",
      "bio": "Pauline Rendall writes crime as Pala K. Randall, and has self-published a novel under that name. She has a story in the collection In a Word: Murder. Pauline lives in Essex and loves opera and cats.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45162",
      "author": "LAURA BESLEY",
      "title": "Silent Cries Echo",
      "url": "http://fiftywordstories.com/2021/02/25/laura-besley-silent-cries-echo/",
      "storyHTML": "<p>On the eve of each full moon, the Elders meet.</p><p>“Betty and Jim,” the Chief says, her long earrings jangling, “are struggling. She’s too pale. He’s drinking too much. Someone needs to take them under their wing.”</p><p>I remember the pain of an empty cradle. “I’ll do it,” I say.</p>",
      "storyText": "On the eve of each full moon, the Elders meet. \"Betty and Jim,\" the Chief says, her long earrings jangling, \"are struggling. She's too pale. He's drinking too much. Someone needs to take them under their wing.\" I remember the pain of an empty cradle. \"I'll do it,\" I say.",
      "bio": "Laura Besley writes short fiction and squeezes her writing into the bookends of her day. She has lived in Holland, Germany, and Hong Kong, but now lives in land-locked central England and misses the sea. Her flash fiction collection, The Almost Mothers, was published in March 2020. She tweets at&nbsp;<a href=\"http://laurabesley/\" target=\"_blank\" rel=\"noopener noreferrer\">@laurabesley</a>.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45160",
      "author": "CASEY LAINE",
      "title": "Brief Meeting at Dawn",
      "url": "http://fiftywordstories.com/2021/02/24/casey-laine-brief-meeting-at-dawn/",
      "storyHTML": "<p>Night gushes:<br>“Oh, the glimmering beauty<br>Of the moon!<br>A gentle goddess<br>Draping her cool, white veils<br>across the land.”</p><p>Day smiles and nods.<br>Already the rising sun<br>Burns heavy on weary shoulders.<br>But eyes long blinded<br>Do not want for beauty,<br>Nor count up the cost<br>Of bearing Life.</p>",
      "storyText": "Night gushes: \"Oh, the glimmering beauty Of the moon! A gentle goddess Draping her cool, white veils across the land.\" Day smiles and nods. Already the rising sun Burns heavy on weary shoulders. But eyes long blinded Do not want for beauty, Nor count up the cost Of bearing Life.",
      "bio": "Casey Laine comes from a long line of talkative women. She works as Fantasy Editor at Cosmic Roots and Eldritch Shores, and publishes an annual anthology of fiction and poetry for her writing group, Writers Assembled. In her spare time, she chases butterflies with her camera. Find her <a href=\"https://www.facebook.com/profile.php?id=100011106735638\" rel=\"noopener\" target=\"_blank\">on Facebook</a>.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45158",
      "author": "DAVID DEREY",
      "title": "Unsinkable",
      "url": "http://fiftywordstories.com/2021/02/24/david-derey-unsinkable/",
      "storyHTML": "<p>I put my worry on a boat.<br>Left it in the Atlantic<br>Night after<br>as I sat crying on the pier<br>it came floating back</p><p>Drilled a hole in it<br>shoved it into the stream.<br>Haven’t seen it since.<br>I know it’s still out there</p><p>A ton of my worry.</p>",
      "storyText": "I put my worry on a boat. Left it in the Atlantic Night after as I sat crying on the pier it came floating back Drilled a hole in it shoved it into the stream. Haven't seen it since. I know it's still out there A ton of my worry.",
      "bio": "David Derey wrote this poem.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45156",
      "author": "DAVE ZACKER",
      "title": "Monsters on Alpha Centauri IV",
      "url": "http://fiftywordstories.com/2021/02/23/dave-zacker-monsters-on-alpha-centauri-iv/",
      "storyHTML": "<p>Escaped through the hatch!<br>No time for my suit.<br>No time for my helmet;<br>No time for my boots.</p><p>I’ll chance it outside,<br>It’s Earth-like enough;<br>Four light-years’ travel<br>Is making me tough.</p><p>I <em>must</em> save this mission.<br>Plain to see:<br>They’re changing into Centaurians,<br>The whole crew except me.</p>",
      "storyText": "Escaped through the hatch! No time for my suit. No time for my helmet; No time for my boots. I'll chance it outside, It's Earth-like enough; Four light-years' travel Is making me tough. I must save this mission. Plain to see: They're changing into Centaurians, The whole crew except me.",
      "bio": "Dave and his wife Kate live in rural Pennsylvania with their two hungry rescue cats. His work has appeared in Fifty Word Stories. He’ll always be thrilled remembering seeing Space Shuttle Columbia land at Edwards in 1983.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45154",
      "author": "BEN MIMMACK",
      "title": "Table For One",
      "url": "http://fiftywordstories.com/2021/02/23/ben-mimmack-table-for-one/",
      "storyHTML": "<p>“Can I borrow your paper?”</p><p>I looked up and knew she was the one. The universe had thrown us together. Forever. We would tell our children about this moment.</p><p>“Please do.”</p><p>She finished reading and left without another word.</p><p>The universe and I haven’t been seeing eye to eye lately.</p>",
      "storyText": "\"Can I borrow your paper?\" I looked up and knew she was the one. The universe had thrown us together. Forever. We would tell our children about this moment. \"Please do.\" She finished reading and left without another word. The universe and I haven't been seeing eye to eye lately.",
      "bio": "Ben has been trying to write happier stories. He’s not sure this is one of them.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45146",
      "author": "KARALYN WAYNE",
      "title": "Elena",
      "url": "http://fiftywordstories.com/2021/02/22/karalyn-wayne-elena/",
      "storyHTML": "<p>City council on Tuesdays, marathon practice on Wednesdays, volunteering on Thursdays, and late shift on Fridays. No friends; doesn’t have the time. Energy drinks fill her bag, and concealer to disguise tired eyes.</p><p>A bright smile hides the fact that she doubts she’ll ever live up to the world’s expectations.</p>",
      "storyText": "City council on Tuesdays, marathon practice on Wednesdays, volunteering on Thursdays, and late shift on Fridays. No friends; doesn't have the time. Energy drinks fill her bag, and concealer to disguise tired eyes. A bright smile hides the fact that she doubts she'll ever live up to the world's expectations.",
      "bio": "Karalyn Wayne enjoys reading poetry in her armchair with a warm drink close by. She takes inspiration from long walks with her dog and the conversations of noisy neighbors. When she isn’t procrastinating, she writes. This is her second published story.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45144",
      "author": "PAULA MacDONALD",
      "title": "Dinnertime",
      "url": "http://fiftywordstories.com/2021/02/22/paula-macdonald-dinnertime/",
      "storyHTML": "<p>The clink of ice cubes being dropped into a crystal glass. The pop of the decanter’s stopper, then the glugging sound of scotch being poured. Noises more familiar to my ten-year-old self than laughter or conversation. The shouting will start soon.</p><p>I escape to the silent sanctuary of my bedroom.</p>",
      "storyText": "The clink of ice cubes being dropped into a crystal glass. The pop of the decanter's stopper, then the glugging sound of scotch being poured. Noises more familiar to my ten-year-old self than laughter or conversation. The shouting will start soon. I escape to the silent sanctuary of my bedroom.",
      "bio": "Paula MacDonald is pursuing her life-long love of writing fiction, after a cancer diagnosis put things in perspective. Do what you love.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    },
    {
      "id": "45142",
      "author": "JON FAIN",
      "title": "Split Check",
      "url": "http://fiftywordstories.com/2021/02/19/jon-fain-split-check/",
      "storyHTML": "<p>In a restaurant, after the entrees were cleared, her mother would take out her compact. For Grace, it’s the phone. The device whispers sweet gossip, swaps intimacies, but in the family tradition, the reflected image is never flattering enough. Like Mom, when cracked by disappointment, she doubles down on dessert.</p>",
      "storyText": "In a restaurant, after the entrees were cleared, her mother would take out her compact. For Grace, it's the phone. The device whispers sweet gossip, swaps intimacies, but in the family tradition, the reflected image is never flattering enough. Like Mom, when cracked by disappointment, she doubles down on dessert.",
      "bio": "Jon Fain’s most recent publications are a short story in Fiction on the Web, a humor piece in Riot Act, flash fiction in Back Patio Press, and a personal essay in Kaleidoscope: Exploring the Experience of Disability Through Literature and the Fine Arts. Twitter-wise, he’s <a href=\"https://twitter.com/jonsfain\" rel=\"noopener\" target=\"_blank\">@jonsfain</a>, where you can find links to his published work in 2020.",
      "dateScraped": "Fri, 26 Feb 2021 11:10:04 GMT"
    }
  ],
  "storiesToEdit": []
}