[
  {
    "_id": "604622d2617d9c0fb836ca9c",
    "id": "44678",
    "author": "BOB THURBER",
    "title": "Grandparent Alienation is a Dirty Business, Especially During the Holidays",
    "url": "http://fiftywordstories.com/2020/12/24/bob-thurber-grandparent-alienation-is-a-dirty-business-especially-during-the-holidays/",
    "storyHTML": "<p>Dear babies,</p><p>Listen. I know it hurts. I’m sorry it hurts.<br>But don’t stop stretching those muscles.<br>You’re doing great. You’re growing stronger.<br>Don’t ever believe you’re grasping at nothing.<br>The distance hasn’t widened between us. I’m still right here.<br>Some days I can almost feel your fingertips.</p><p>Keep reaching.</p>",
    "storyText": "Dear babies, Listen. I know it hurts. I'm sorry it hurts. But don't stop stretching those muscles. You're doing great. You're growing stronger. Don't ever believe you're grasping at nothing. The distance hasn't widened between us. I'm still right here. Some days I can almost feel your fingertips. Keep reaching.",
    "bio": "Bob Thurber is the author of six books. Regarded as a master of Flash and Micro Fiction, his work has appeared in Esquire and other magazines, been anthologized 60 times, received a long list of awards, and been utilized in schools and colleges throughout the world. He resides in Massachusetts. Visit his website at&nbsp;<a href=\"http://bobthurber.net/\" target=\"_blank\" rel=\"noopener noreferrer\">BobThurber.net</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca9b",
    "id": "44773",
    "author": "LISA MARIE LOPEZ",
    "title": "Christmas Memory",
    "url": "http://fiftywordstories.com/2020/12/24/lisa-marie-lopez-christmas-memory/",
    "storyHTML": "<p>Christmas dinner at Aunt Ruthie’s. The old man beside me looks familiar. He asks, “Ben, have you been good?”</p><p>His chuckle fills the entire room, and I remember—fluffy white beard, velvety red suit—Christmas at Grandma’s.</p><p>I grin, six again; and from somewhere, beyond icicled houses, sleigh bells jingle.</p>",
    "storyText": "Christmas dinner at Aunt Ruthie's. The old man beside me looks familiar. He asks, \"Ben, have you been good?\" His chuckle fills the entire room, and I remember - fluffy white beard, velvety red suit - Christmas at Grandma's. I grin, six again; and from somewhere, beyond icicled houses, sleigh bells jingle.",
    "bio": "Lisa Marie Lopez resides in northern California where she enjoys quiet walks and writing fiction. She’s had short stories published in many different literary journals and anthologies, including Train River anthology and From the Depths literary journal. Say hello at <a href=\"http://facebook.com/authorlisamariefiction\" rel=\"noopener noreferrer\" target=\"_blank\">facebook.com/authorlisamariefiction</a>",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca9a",
    "id": "44826",
    "author": "CHARIS NEGLEY",
    "title": "On Deaf Ears",
    "url": "http://fiftywordstories.com/2020/12/23/charis-negley-on-deaf-ears/",
    "storyHTML": "<p>The siren watched sailors drown every day.</p><p>The cabin boy remained alone on his ship, tears streaming.</p><p>His crew had worn such enamoured expressions, dreamily drawn overboard into the rolling waters below.</p><p>Terrified, heartbroken, he watched the siren as she sang, her spellbinding song never reaching his unhearing, soundless world.</p>",
    "storyText": "The siren watched sailors drown every day. The cabin boy remained alone on his ship, tears streaming. His crew had worn such enamoured expressions, dreamily drawn overboard into the rolling waters below. Terrified, heartbroken, he watched the siren as she sang, her spellbinding song never reaching his unhearing, soundless world.",
    "bio": "Charis Negley is a Delawarian getting her BS in professional writing at Taylor University. She is currently working on her novel and evaluating manuscripts for IlluminateYA. See more <a href=\"https://charisnegley.wixsite.com/mysite\" rel=\"noopener\" target=\"_blank\">on her blog</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca99",
    "id": "44824",
    "author": "KELLI SIMPSON",
    "title": "Spare Parts",
    "url": "http://fiftywordstories.com/2020/12/23/kelli-simpson-spare-parts/",
    "storyHTML": "<p>The judge addressed the defendant with palpable disgust.</p><p>“You, sir, have been found guilty of heinous crimes against humanity. Do you have anything to say before I pronounce your sentence?”</p><p>The defendant shrugged.</p><p>“The commercial on tv asked me to donate organs. Never said they had to be <em>my</em> organs!”</p>",
    "storyText": "The judge addressed the defendant with palpable disgust. \"You, sir, have been found guilty of heinous crimes against humanity. Do you have anything to say before I pronounce your sentence?\" The defendant shrugged. \"The commercial on tv asked me to donate organs. Never said they had to be my organs!\"",
    "bio": "Kelli Simpson is a mother and writer living in Norman, Oklahoma. She has published work in Lamplit Underground, Rabid Oak, The Avenue, Ghost City Review, and The River.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca98",
    "id": "44822",
    "author": "LAURA BESLEY",
    "title": "In the Flesh",
    "url": "http://fiftywordstories.com/2020/12/22/laura-besley-in-the-flesh/",
    "storyHTML": "<p>I frown, glimpsing you through the café window. Easily ten years older than your profile picture, what does that make you? Vain? Sentimental? Insecure?</p><p>Smiling wide, you wave me over.</p><p>Snippets of our countless conversations swirl around my head, reminding me of what’s important, and I push open the door.</p>",
    "storyText": "I frown, glimpsing you through the café window. Easily ten years older than your profile picture, what does that make you? Vain? Sentimental? Insecure? Smiling wide, you wave me over. Snippets of our countless conversations swirl around my head, reminding me of what's important, and I push open the door.",
    "bio": "Laura Besley writes short fiction and squeezes her writing into the bookends of her day. She has lived in Holland, Germany, and Hong Kong, but now lives in land-locked central England and misses the sea. Her flash fiction collection, The Almost Mothers, was published in March 2020. She tweets at&nbsp;<a href=\"http://laurabesley/\" target=\"_blank\" rel=\"noopener noreferrer\">@laurabesley</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca97",
    "id": "44820",
    "author": "KEITH HOERNER",
    "title": "You Never Come; You Go",
    "url": "http://fiftywordstories.com/2020/12/22/keith-hoerner-you-never-come-you-go/",
    "storyHTML": "<p>I watch you walk out the back door, or the door to the basement, or the door to the bathroom. The house is a sideways maze of doors and shirt tails and weakening hands trailing around corners. You never come—you go.</p><p>And then I remember: you passed last night.</p>",
    "storyText": "I watch you walk out the back door, or the door to the basement, or the door to the bathroom. The house is a sideways maze of doors and shirt tails and weakening hands trailing around corners. You never come - you go. And then I remember: you passed last night.",
    "bio": "Keith Hoerner (BS, MFA) pushes words around in Southern Illinois. His debut memoir is scheduled for publication by Adelaide Books in Spring 2021.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca96",
    "id": "44817",
    "author": "ABIGAIL WILKIN",
    "title": "The Afterlife",
    "url": "http://fiftywordstories.com/2020/12/21/abigail-wilkin-the-afterlife/",
    "storyHTML": "<p>I float on the open ocean. Sunlight bores down, fracturing me into pieces. Toxins seep into my translucent skin. Sea animals nibble me, eager to begin feasting.</p><p>This agony has only just begun. I’ll live for centuries.</p><p>Nostalgia hits me. A happier time, when all I did was carry groceries.</p>",
    "storyText": "I float on the open ocean. Sunlight bores down, fracturing me into pieces. Toxins seep into my translucent skin. Sea animals nibble me, eager to begin feasting. This agony has only just begun. I'll live for centuries. Nostalgia hits me. A happier time, when all I did was carry groceries.",
    "bio": "Abigail is a student who loves creative writing in all forms and genres. She writes around her busy uni schedule and enters competitions with the aim of one day getting published!",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca95",
    "id": "44815",
    "author": "ASH K GRAY",
    "title": "Blind Proposal",
    "url": "http://fiftywordstories.com/2020/12/21/ash-k-gray-blind-proposal/",
    "storyHTML": "<p>My eyes widened in shock as I saw him kneeling before me. A handsome gentleman was right there on his knees with a ring in his hand. I didn’t know who he was, but I was ready to accept anyways. “Will you marry me, Joanne?” he said.</p><p>My name’s Brandon.</p>",
    "storyText": "My eyes widened in shock as I saw him kneeling before me. A handsome gentleman was right there on his knees with a ring in his hand. I didn't know who he was, but I was ready to accept anyways. \"Will you marry me, Joanne?\" he said. My name's Brandon.",
    "bio": "Ash K. Gray is an amateur young writer. They’ve written several short stories and a few articles, mainly for fun. They mostly write comedy, parody or psychological thrillers, but may occasionally try a different genre.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca94",
    "id": "44811",
    "author": "JOSIE CELLONE",
    "title": "Consumed",
    "url": "http://fiftywordstories.com/2020/12/18/josie-cellone-consumed/",
    "storyHTML": "<p>The tip of the pregnancy test looks like coconut pulp.</p><p>Instinctively, Collette wants to run her fingers through it, like the silicone bristles of a basting brush.</p><p>She imagines amniotic fluid flooded with Pisco Sours, raw egg whites whisked into an embryo.</p><p>A two-week bender reduced to two pink lines.</p>",
    "storyText": "The tip of the pregnancy test looks like coconut pulp. Instinctively, Collette wants to run her fingers through it, like the silicone bristles of a basting brush. She imagines amniotic fluid flooded with Pisco Sours, raw egg whites whisked into an embryo. A two-week bender reduced to two pink lines.",
    "bio": "Josie Cellone is a recovering journalist and aspiring fiction writer who lives in Pittsburgh, Pennsylvania and daydreams about waterfront property.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca93",
    "id": "44809",
    "author": "LISA CHAMBERS",
    "title": "Homecoming",
    "url": "http://fiftywordstories.com/2020/12/18/lisa-chambers-homecoming/",
    "storyHTML": "<p>I had been away too long.</p><p>Back to the comforts of home. Familiar places, friendly faces, birds singing into the air that once sent my dreams aloft. Some long forgotten, others I could never let go.</p><p>Home is forgiving, though, patiently waiting its turn to claim “I knew her when.”</p>",
    "storyText": "I had been away too long. Back to the comforts of home. Familiar places, friendly faces, birds singing into the air that once sent my dreams aloft. Some long forgotten, others I could never let go. Home is forgiving, though, patiently waiting its turn to claim \"I knew her when.\"",
    "bio": "Lisa Chambers is a Texas girl who wishes all of you a happy holiday season.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca92",
    "id": "44806",
    "author": "EMILY ROTH",
    "title": "Flight",
    "url": "http://fiftywordstories.com/2020/12/17/emily-roth-flight/",
    "storyHTML": "<p>“Do you remember this?” I trace grooves in the plaque. An engraved spaceship glints, perpetually airborne.</p><p>Dad’s eyes remain closed, lips parted.</p><p>“We went to Cape Canaveral. You shook the president’s hand.”</p><p>Nurses appear and vanish.</p><p>I wonder if Dad feels like he’s floating. Preparing to sail into the unknown.</p>",
    "storyText": "\"Do you remember this?\" I trace grooves in the plaque. An engraved spaceship glints, perpetually airborne. Dad's eyes remain closed, lips parted. \"We went to Cape Canaveral. You shook the president's hand.\" Nurses appear and vanish. I wonder if Dad feels like he's floating. Preparing to sail into the unknown.",
    "bio": "Emily Roth is a librarian and writer based in Chicago. Her writing has recently been published by Exposition Review, Brilliant Flash Fiction, and TL;DR Press, and she was shortlisted for the 2020 SmokeLong Quarterly Award for Flash Fiction.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca91",
    "id": "44804",
    "author": "JEROME NEWSOME",
    "title": "Fairies",
    "url": "http://fiftywordstories.com/2020/12/17/jerome-newsome-fairies/",
    "storyHTML": "<p>Lightbulbs shattered and sparked. Free at last!</p><p>Spheres of light drifted outside. They floated over buildings, resembling moving stars. These stars huddled together in a small forest. Giggles came from them as leaves brushed against their faces.</p><p>An abandoned temple impeded their earthy merriment. Its disheveled state made them cry.</p>",
    "storyText": "Lightbulbs shattered and sparked. Free at last! Spheres of light drifted outside. They floated over buildings, resembling moving stars. These stars huddled together in a small forest. Giggles came from them as leaves brushed against their faces. An abandoned temple impeded their earthy merriment. Its disheveled state made them cry.",
    "bio": "Jerome Newsome is an upcoming writer who has been published in Aftermath Magazine and soon to be published in Fiction Southeast. When not writing, he likes to play video games.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca90",
    "id": "44802",
    "author": "BEN MIMMACK",
    "title": "A Chip Off the Old Block",
    "url": "http://fiftywordstories.com/2020/12/16/ben-mimmack-a-chip-off-the-old-block/",
    "storyHTML": "<p>The relentless sun beat down on the old man in the stern. Ahead, his son pulled in the net, easy movements belying the backbreaking effort. The man looked at the few, undersized fish in the boat and wondered whether he had been right to teach his son everything he knew.</p>",
    "storyText": "The relentless sun beat down on the old man in the stern. Ahead, his son pulled in the net, easy movements belying the backbreaking effort. The man looked at the few, undersized fish in the boat and wondered whether he had been right to teach his son everything he knew.",
    "bio": "Ben lives in Dallas where he is viewed with tolerant amusement by his wife and two small boys. He occasionally writes screenplays, which are primarily treated with indifference, but he lives in hope.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca8f",
    "id": "44800",
    "author": "GARY THOMSON",
    "title": "Riches",
    "url": "http://fiftywordstories.com/2020/12/16/gary-thomson-riches/",
    "storyHTML": "<p>On his ninth Christmas, Adam presses inquisitive eyes to his new telescope. Magis’ candles, he marvels, christening fiery stars with childhood’s fancy, forging a closeness against their remoteness.</p><p>Aged eighty, he discovers a new star, eternalizes his name. He shuns ensuing fame, only savors his lifelong glimpse into heaven’s mystery.</p>",
    "storyText": "On his ninth Christmas, Adam presses inquisitive eyes to his new telescope. Magis' candles, he marvels, christening fiery stars with childhood's fancy, forging a closeness against their remoteness. Aged eighty, he discovers a new star, eternalizes his name. He shuns ensuing fame, only savors his lifelong glimpse into heaven's mystery.",
    "bio": "Gary Thomson is old enough to know better, but he still wishes on falling stars.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca8e",
    "id": "44797",
    "author": "AERYN RUDEL",
    "title": "Futility Defined",
    "url": "http://fiftywordstories.com/2020/12/15/aeryn-rudel-futility-defined/",
    "storyHTML": "<p>My brain knows you are gone. It spends long, fruitless hours explaining this to the rest of me. There are graphs and spreadsheets, detailed PowerPoint presentations, and endless lectures that lay bare the facts for all to see. My heart takes it all in, nods politely, and continues to bleed.</p>",
    "storyText": "My brain knows you are gone. It spends long, fruitless hours explaining this to the rest of me. There are graphs and spreadsheets, detailed PowerPoint presentations, and endless lectures that lay bare the facts for all to see. My heart takes it all in, nods politely, and continues to bleed.",
    "bio": "Aeryn Rudel wrote this story.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca8d",
    "id": "44795",
    "author": "RJ KINNARNEY",
    "title": "Decorating the Tree",
    "url": "http://fiftywordstories.com/2020/12/15/rj-kinnarney-decorating-the-tree/",
    "storyHTML": "<p>Dad stood on the doorstep. “Come in, love. You’ll catch your death.”</p><p>“You know I always decorate the linden outside at Christmas. It cheers up the whole street.” Ma bound the trunk with tinsel.</p><p>They cut down the tree the year after Ma died.</p><p>Dad said the roots had gone.</p>",
    "storyText": "Dad stood on the doorstep. \"Come in, love. You'll catch your death.\" \"You know I always decorate the linden outside at Christmas. It cheers up the whole street.\" Ma bound the trunk with tinsel. They cut down the tree the year after Ma died. Dad said the roots had gone.",
    "bio": "R. J. Kinnarney is a tutor and author of children’s novel, Abigail Aces Acting. R. J.’s short story, The Blue Bowl, was runner-up in the Daunt Books short story competition. She won the Southam Book Festival 100 word story competition and has been published in 100 Words of Solitude, The Write In, Funny Pearls. She is currently working on a novel, which looks at attitudes to war, together with changing methods and speed of communication. See more at <a href=\"http://rjkinnarney.com\" rel=\"noopener noreferrer\" target=\"_blank\">rjkinnarney.com</a> and follow R.J. on Twitter at <a href=\"https://twitter.com/rjkinnarney\" rel=\"noopener noreferrer\" target=\"_blank\">@rjkinnarney</a>",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca8c",
    "id": "44786",
    "author": "ALYSON TAIT",
    "title": "Birth",
    "url": "http://fiftywordstories.com/2020/12/14/alyson-tait-birth/",
    "storyHTML": "<p>My first memory? Darkness. Devoid of all senses.</p><p>One question consumed my thoughts: Why must I be alone?</p><p>For millennia I floated, exploring the void and, eventually, my powers.</p><p>My favorite memory? The day I birthed the universe. I made light, warmth, humans.</p><p>Powers consumed; I was no longer alone.</p>",
    "storyText": "My first memory? Darkness. Devoid of all senses. One question consumed my thoughts: Why must I be alone? For millennia I floated, exploring the void and, eventually, my powers. My favorite memory? The day I birthed the universe. I made light, warmth, humans. Powers consumed; I was no longer alone.",
    "bio": "Alyson grew up in Arizona, and moved to Maryland where she got married, had her only daughter, and began writing. She has appeared in Altered Reality Magazine and has a piece coming soon at (mac)ro(mic).",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca8b",
    "id": "44784",
    "author": "CAROLYN R RUSSELL",
    "title": "Reception",
    "url": "http://fiftywordstories.com/2020/12/14/carolyn-r-russell-reception/",
    "storyHTML": "<p>She found them at the bar, two men in their mid-thirties knocking back whiskey at her best friend’s memorial. She looked from one to the other. “Are you the good brother or the bad brother?” she asked.</p><p>The panic on their faces was gratifying.</p><p>They’d both been <em>very</em> bad brothers.</p>",
    "storyText": "She found them at the bar, two men in their mid-thirties knocking back whiskey at her best friend's memorial. She looked from one to the other. \"Are you the good brother or the bad brother?\" she asked. The panic on their faces was gratifying. They'd both been very bad brothers.",
    "bio": "Carolyn R. Russell is the author of The Films of Joel and Ethan Coen, published by McFarland &amp; Company in 2001. Her humorous YA mystery, Same As It Never Was, was released in 2018 by Big Table. Carolyn’s new YA dystopian thriller, In the Fullness of Time, was published by Vine Leaves Press in March of 2020. Her essays and short stories have appeared in a variety of publications, including The Boston Globe, Flash Fiction Magazine, and Bridge Eight Press. She holds an M.A. in Film Studies from Chapman University, and has taught on the college, high school, and middle school levels. Carolyn lives north of Boston with her husband and two children.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca8a",
    "id": "44777",
    "author": "PAT SWEENEY",
    "title": "Homestead Avenue",
    "url": "http://fiftywordstories.com/2020/12/11/pat-sweeney-homestead-avenue/",
    "storyHTML": "<p>When Pam Sweeney began going on and on every time any of us ran into her, it was understandable: her husband, nice Phil, had died just two months before. But we also agreed it was time to start getting things back to normal, to start subtly avoiding her as usual.</p>",
    "storyText": "When Pam Sweeney began going on and on every time any of us ran into her, it was understandable: her husband, nice Phil, had died just two months before. But we also agreed it was time to start getting things back to normal, to start subtly avoiding her as usual.",
    "bio": "Paul Lamar wrote this story.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca89",
    "id": "44775",
    "author": "DICK NARVETT",
    "title": "A Temporary Interruption",
    "url": "http://fiftywordstories.com/2020/12/11/dick-narvett-a-temporary-interruption/",
    "storyHTML": "<p>He studied his frail body’s reflection in the dairy case door. What was it he had come for?</p><p>His flushed face pressed against the cool glass. A voice came to him as if from another place or time.</p><p>“You alright, sir? Sit here, you’ll feel better.”</p><p>Butter! That was it!</p>",
    "storyText": "He studied his frail body's reflection in the dairy case door. What was it he had come for? His flushed face pressed against the cool glass. A voice came to him as if from another place or time. \"You alright, sir? Sit here, you'll feel better.\" Butter! That was it!",
    "bio": "Dick Narvett is a retiree from a prior life in international business and independent film acting. He currently resides in Pennsylvania where he writes flash fiction and poetry.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca88",
    "id": "44766",
    "author": "JAMES SCHELL",
    "title": "A Skull’s Prayer",
    "url": "http://fiftywordstories.com/2020/12/10/james-schell-a-skulls-prayer/",
    "storyHTML": "<p>Hello?<br>Can you hear me?<br>I’ve been calling out<br>For years now<br>To anyone<br>Ever since I went missing.</p><p>Are you still looking for me?<br>I’m right here.<br>I haven’t moved<br>Not since<br>He buried me for all those years.</p><p>Please don’t give up on me.<br>I haven’t on you.</p>",
    "storyText": "Hello? Can you hear me? I've been calling out For years now To anyone Ever since I went missing. Are you still looking for me? I'm right here. I haven't moved Not since He buried me for all those years. Please don't give up on me. I haven't on you.",
    "bio": "James Schell has a BFA and typically works in photographic film and ceramics. He has been writing for years but has just started trying to get his work published and is excited to see where it takes him.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca87",
    "id": "44764",
    "author": "BOB McWILLIAMS",
    "title": "You Bleed a Little Christmas",
    "url": "http://fiftywordstories.com/2020/12/10/bob-mcwilliams-you-bleed-a-little-christmas/",
    "storyHTML": "<p>The elf sat on the shelf. Waiting. Observing. Dad was oblivious while Mom ignored the stupid decoration. The children uneasily crept past him in the living and dining rooms, even their bedrooms!</p><p>Good, bad. Whatever. Sitting among the gifts, the elf clutched the cold scalpel.</p><p>Christmas, so naughty and nice!</p>",
    "storyText": "The elf sat on the shelf. Waiting. Observing. Dad was oblivious while Mom ignored the stupid decoration. The children uneasily crept past him in the living and dining rooms, even their bedrooms! Good, bad. Whatever. Sitting among the gifts, the elf clutched the cold scalpel. Christmas, so naughty and nice!",
    "bio": "Retired and writing when not busy with retirement, Bob enjoys creating short fiction and poetry. Bob loves the spirit of the holidays but finds a particular decoration just too creepy.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca86",
    "id": "44753",
    "author": "JON FAIN",
    "title": "Regatta",
    "url": "http://fiftywordstories.com/2020/12/09/jon-fain-regatta/",
    "storyHTML": "<p>Some men have sculled from troubled boys, and are still sunken in their sorrow, trapped in turmoil. Immaturity laps up against the gunwales of machismo, as oars clack rippled distress toward distant shores. <em>It’s not their fault!</em> Women accept or reject them, by math and manner mysterious, to different ends.</p>",
    "storyText": "Some men have sculled from troubled boys, and are still sunken in their sorrow, trapped in turmoil. Immaturity laps up against the gunwales of machismo, as oars clack rippled distress toward distant shores. It's not their fault! Women accept or reject them, by math and manner mysterious, to different ends.",
    "bio": "Jon Fain lies low in Massachusetts. Besides 50 Word Stories, his stories have appeared this year in Blue Lake Review, Molecule, (mac)ro(mic), Potato Soup Journal, The Daily Drunk, and elsewhere. You can find him on Twitter at <a href=\"http://twitter.com/jonsfain\" rel=\"noopener noreferrer\" target=\"_blank\">@jonsfain</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca85",
    "id": "44751",
    "author": "JOHN H. DROMEY",
    "title": "Protecting Life and Limb",
    "url": "http://fiftywordstories.com/2020/12/09/john-h-dromey-protecting-life-and-limb/",
    "storyHTML": "<p>The witch hired to protect villagers from a predatory shapeshifter reported.</p><p>“The werewolf’s no longer a threat. My non-lethal spell minimizes his means of aggression whenever the moon is full. Right now, for instance, he’s all bark and no bite.”</p><p>“What did you do?”</p><p>“I turned him into a tree.”</p>",
    "storyText": "The witch hired to protect villagers from a predatory shapeshifter reported. \"The werewolf's no longer a threat. My non-lethal spell minimizes his means of aggression whenever the moon is full. Right now, for instance, he's all bark and no bite.\" \"What did you do?\" \"I turned him into a tree.\"",
    "bio": "John H. Dromey’s short fiction’s been published in Mystery Weekly Magazine and over 150 other venues.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca84",
    "id": "44744",
    "author": "SL BOWEN",
    "title": "Leftovers",
    "url": "http://fiftywordstories.com/2020/12/08/sl-bowen-leftovers/",
    "storyHTML": "<p>Most of the pumpkin pie is still in the pan, but I’ve little taste for it. We’ll be eating the turkey Dad shot for days. No oyster dressing this year, another disappointment, something else to miss.</p><p>I’m lucky not to be alone. The plague has spared so few.</p>",
    "storyText": "Most of the pumpkin pie is still in the pan, but I've little taste for it. We'll be eating the turkey Dad shot for days. No oyster dressing this year, another disappointment, something else to miss. I'm lucky not to be alone. The plague has spared so few.",
    "bio": "S.L. Bowen is a fiction writer who lives in Virginia with her husband and lots of books.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca83",
    "id": "44742",
    "author": "STEPHEN GOODLAD",
    "title": "No Son of Mine",
    "url": "http://fiftywordstories.com/2020/12/08/stephen-goodlad-no-son-of-mine/",
    "storyHTML": "<p>It was only beach cricket. I bowled and he batted. The ball lingered an eternity in the patch of blue sky before plummeting towards earth. I was standing with outstretched arms when the full force of our relationship hit me in the mouth. “You’re no son of mine,” he said.</p>",
    "storyText": "It was only beach cricket. I bowled and he batted. The ball lingered an eternity in the patch of blue sky before plummeting towards earth. I was standing with outstretched arms when the full force of our relationship hit me in the mouth. \"You're no son of mine,\" he said.",
    "bio": "Stephen Goodlad started writing during the first lockdown in England having retired from work only a few months before, full of different ambitions. Writing has helped shape new ambitions and new challenges ahead.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca82",
    "id": "44725",
    "author": "HELEN BOWIE",
    "title": "Epona",
    "url": "http://fiftywordstories.com/2020/12/07/helen-bowie-epona/",
    "storyHTML": "<p>The loss of innocence struck me most profoundly when the sound of distant hooves approaching no longer invoked fairy tales but funeral processions and riots.</p><p>I stroked your nose and apologised for what we had done to you.</p><p>I bit into a sugar lump, and all I found was salt.</p>",
    "storyText": "The loss of innocence struck me most profoundly when the sound of distant hooves approaching no longer invoked fairy tales but funeral processions and riots. I stroked your nose and apologised for what we had done to you. I bit into a sugar lump, and all I found was salt.",
    "bio": "Helen Bowie is a writer, performer and podcaster based in London. Her writing has featured in Queerlings, Eater London, and Versification, among others. Helen has a day job at a charity, one cat, and several bafflingly strong opinions on highly trivial matters.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca81",
    "id": "44723",
    "author": "SK CHYNOWETH",
    "title": "Nosfertini",
    "url": "http://fiftywordstories.com/2020/12/07/sk-chynoweth-nosfertini/",
    "storyHTML": "<p>“Ouch!” I yelp, snatching back my hand from the water.</p><p>Blood beads, oozing from two dainty wounds.</p><p>“Maybe there really <em>was</em> a mix-up,” wonders my wife, picking up the baby soap.</p><p>We never did call the hospital back.</p><p>Licking her lips, our daughter smiles sweetly up from the bath tub.</p>",
    "storyText": "\"Ouch!\" I yelp, snatching back my hand from the water. Blood beads, oozing from two dainty wounds. \"Maybe there really was a mix-up,\" wonders my wife, picking up the baby soap. We never did call the hospital back. Licking her lips, our daughter smiles sweetly up from the bath tub.",
    "bio": "Dr. SK Chynoweth is a humanitarian aid worker and pracademic living in Kuala Lumpur, Malaysia. She writes micro-sagas and other stuff in her spare time. See more at <a href=\"http://sarahchynoweth.com\" rel=\"noopener noreferrer\" target=\"_blank\">sarahchynoweth.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca80",
    "id": "44721",
    "author": "YASH SEYEDBAGHERI",
    "title": "Captured Love",
    "url": "http://fiftywordstories.com/2020/12/04/yash-seyedbagheri-captured-love/",
    "storyHTML": "<p>Mom never lets me visit.<br>Space is too tight. Writing deadlines.<br>No mention of a bedroom after a year.</p><p>If I question, she says love transcends space. I’m too domestic in attitude. Like Dad.</p><p>I spend weekends with movie moms.<br>At least it’s easy to capture and recapture a hug.</p>",
    "storyText": "Mom never lets me visit. Space is too tight. Writing deadlines. No mention of a bedroom after a year. If I question, she says love transcends space. I'm too domestic in attitude. Like Dad. I spend weekends with movie moms. At least it's easy to capture and recapture a hug.",
    "bio": "Yash Seyedbagheri is a graduate of Colorado State University’s MFA program. His stories, “Soon,” “How To Be A Good Episcopalian,” and “Tales From A Communion Line,” were nominated for Pushcarts. Yash’s work has been published in The Journal of Compressed Creative Arts, Write City Magazine, and Ariel Chart, among others.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca7f",
    "id": "44719",
    "author": "DON NIGRONI",
    "title": "Falling in Love",
    "url": "http://fiftywordstories.com/2020/12/04/don-nigroni-falling-in-love/",
    "storyHTML": "<p>Robb and I had eluded the Yeti in Tibet, Nessie in Scotland, and Bigfoot in the Pacific Northwest. But while on a Caribbean cruise seeking mermaids, I saw a green-haired female in a wheelchair stand up. Then she and Robb embraced, whereupon both leapt over the railing into the sea.</p>",
    "storyText": "Robb and I had eluded the Yeti in Tibet, Nessie in Scotland, and Bigfoot in the Pacific Northwest. But while on a Caribbean cruise seeking mermaids, I saw a green-haired female in a wheelchair stand up. Then she and Robb embraced, whereupon both leapt over the railing into the sea.",
    "bio": "Don Nigroni has a Bachelor’s Degree in Economics from Saint Joseph’s University and a Master’s Degree in Philosophy from Notre Dame and worked as an economist for the US Bureau of Labor Statistics.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca7e",
    "id": "44715",
    "author": "CLAIRE NATALE",
    "title": "Playground",
    "url": "http://fiftywordstories.com/2020/12/03/claire-natale-playground/",
    "storyHTML": "<p>She pushed me off the swings<br>and kicked mulch in my face<br>I didn’t push back<br>just laid there<br>eyes stinging<br>blush forming<br>from the pain in my knees<br>from the shame of my position<br>from the flutter in my heart I got<br>watching her<br>pink<br>lace-up<br>shoes<br>skip away</p>",
    "storyText": "She pushed me off the swings and kicked mulch in my face I didn't push back just laid there eyes stinging blush forming from the pain in my knees from the shame of my position from the flutter in my heart I got watching her pink lace-up shoes skip away",
    "bio": "Claire Natale wrote this story.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca7d",
    "id": "44702",
    "author": "CMF WRIGHT",
    "title": "Delicate Blossoms",
    "url": "http://fiftywordstories.com/2020/12/02/cmf-wright-delicate-blossoms/",
    "storyHTML": "<p>A delicate blossom, the king had called her. His lily.</p><p>“Do you know what lilies and foxglove have in common?” she asked over lunch, and he laughed—<i>Only women care for flowers.</i></p><p>She watched him lift the petal-tainted bite to his lips, and she contemplated the resizing of his crown.</p>",
    "storyText": "A delicate blossom, the king had called her. His lily. \"Do you know what lilies and foxglove have in common?\" she asked over lunch, and he laughed -  Only women care for flowers. She watched him lift the petal-tainted bite to his lips, and she contemplated the resizing of his crown.",
    "bio": "<a href=\"http://twitter.com/cmf_wright\" rel=\"noopener noreferrer\" target=\"_blank\">C.M.F. Wright</a> is an avid reader and sentence wrangler. Her short stories have appeared in <em>Fifty Word Stories</em>, <em>Microfiction Monday</em>, <em>Syntax &amp; Salt Magazine</em> and the <em>VSS365 Anthology</em>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca7c",
    "id": "44700",
    "author": "HELEN MERRICK",
    "title": "Lockdown",
    "url": "http://fiftywordstories.com/2020/12/02/helen-merrick-lockdown/",
    "storyHTML": "<p>Lockdown. Again.</p><p>I’ve disinfected everything, painted the whole house, and the garden looks stunning. I’ve watched Game of Thrones in its entirety, read a novel a week, and taken long walks. I’ve been schoolwork monitor and playmate for my kids. Working from home’s actually been fun.</p><p>Lockdown again… It’s great.</p>",
    "storyText": "Lockdown. Again. I've disinfected everything, painted the whole house, and the garden looks stunning. I've watched Game of Thrones in its entirety, read a novel a week, and taken long walks. I've been schoolwork monitor and playmate for my kids. Working from home's actually been fun. Lockdown again… It's great.",
    "bio": "Helen Merrick lives in the UK Midlands with her family. When she’s not teaching, she likes to scribble short stories and dream about writing a novel. She might, one day. See more at <a href=\"http://authorhelenmerrick.wordpress.com\" rel=\"noopener noreferrer\" target=\"_blank\">authorhelenmerrick.wordpress.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca7b",
    "id": "44694",
    "author": "JOY RAYNER",
    "title": "Bounty",
    "url": "http://fiftywordstories.com/2020/12/01/joy-rayner-bounty/",
    "storyHTML": "<p>The contents of the cupboard are as follows:</p><ul><li>KD, thirteen months expired</li><li>sriracha, red crusting around the edges of the cap</li><li>a broken candy-cane</li><li>stale crackers</li></ul><p>I grab it all, collapse on the floor beside the table blocking the door, and feast while something awful moves beyond the boarded windows.</p>",
    "storyText": "The contents of the cupboard are as follows: KD, thirteen months expired sriracha, red crusting around the edges of the cap a broken candy-cane stale crackers I grab it all, collapse on the floor beside the table blocking the door, and feast while something awful moves beyond the boarded windows.",
    "bio": "Joy Rayner writes at the peak of Lake Erie. In January she will be migrating north to study floral design.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca7a",
    "id": "44692",
    "author": "DAVE ZACKER",
    "title": "Space Elevator",
    "url": "http://fiftywordstories.com/2020/12/01/dave-zacker-space-elevator/",
    "storyHTML": "<p>“Eight, please,” I said politely to the old man standing next to the control panel as I entered the elevator. He pushed the top button, instead. Suddenly, I was scrunched flat to my knees from an immense upward acceleration.</p><p>“We’re way past the moon, now,” the old man said, calmly.</p>",
    "storyText": "\"Eight, please,\" I said politely to the old man standing next to the control panel as I entered the elevator. He pushed the top button, instead. Suddenly, I was scrunched flat to my knees from an immense upward acceleration. \"We're way past the moon, now,\" the old man said, calmly.",
    "bio": "Dave and his lovely wife, Kate, and their two hungry rescue cats live in the Pennsylvania countryside, where he enjoys working on his novel about distant planets and flying saucers.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca79",
    "id": "44687",
    "author": "MARIA CARGILLE",
    "title": "Loss",
    "url": "http://fiftywordstories.com/2020/11/30/maria-cargille-loss/",
    "storyHTML": "<p>Twin trees grow side by side, sap pulsing to the same rhythm, roots entwined; they are more one than two.</p><p>Then the wind… Furious storm engulfs them, ripping, tearing, rending-</p><p>CRASH.</p><p>Endless silence.</p><p>The survivor slowly gathers up shredded roots and cradles them as the dregs of life drain away.</p>",
    "storyText": "Twin trees grow side by side, sap pulsing to the same rhythm, roots entwined; they are more one than two. Then the wind… Furious storm engulfs them, ripping, tearing, rending- CRASH. Endless silence. The survivor slowly gathers up shredded roots and cradles them as the dregs of life drain away.",
    "bio": "Maria wrote this in remembrance of all the trees that were destroyed in this year’s derecho. These two trees are real, and the one that made it still looks lonely.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca78",
    "id": "44685",
    "author": "LAURA BESLEY",
    "title": "So Long",
    "url": "http://fiftywordstories.com/2020/11/30/laura-besley-so-long/",
    "storyHTML": "<p>Today’s DM on Instagram starts the same as so many others. ‘Hello, beautiful,’ it says.</p><p>Except this message is from my father.</p><p>I wonder if he even knows it’s me. Twenty years can change a person.</p><p>I don’t hesitate to end it the same as the others: delete, block, forget.</p>",
    "storyText": "Today's DM on Instagram starts the same as so many others. 'Hello, beautiful,' it says. Except this message is from my father. I wonder if he even knows it's me. Twenty years can change a person. I don't hesitate to end it the same as the others: delete, block, forget.",
    "bio": "Laura Besley writes short fiction and squeezes her writing into the bookends of her day. She has lived in Holland, Germany, and Hong Kong, but now lives in land-locked central England and misses the sea. Her flash fiction collection, The Almost Mothers, was published in March 2020. She tweets at <a href=\"http://laurabesley/\" target=\"_blank\" rel=\"noopener noreferrer\">@laurabesley</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca77",
    "id": "44682",
    "author": "MANDIRA PATTNAIK",
    "title": "Infinitude",
    "url": "http://fiftywordstories.com/2020/11/27/mandira-pattnaik-infinitude/",
    "storyHTML": "<p>Packing his case, your son gives you a cursory look, and “Delhi” by way of alms.</p><p>You hurry to the kitchen, pack a lunchbox with heart-shaped cookies.</p><p>Afterwards, you picture him munching,  smiling, thinking of you.</p><p>When he doesn’t answer your calls you’re sad, but sure he’s just busy working.</p>",
    "storyText": "Packing his case, your son gives you a cursory look, and \"Delhi\" by way of alms. You hurry to the kitchen, pack a lunchbox with heart-shaped cookies. Afterwards, you picture him munching, smiling, thinking of you. When he doesn't answer your calls you're sad, but sure he's just busy working.",
    "bio": "Mandira Pattnaik writes flash and poetry and has been published in Passages North, Amsterdam Quarterly, and 50WS, among other places. Follow <a href=\"https://twitter.com/MandiraPattnaik\" rel=\"noopener noreferrer\" target=\"_blank\">@MandiraPattnaik</a>",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca76",
    "id": "44680",
    "author": "THOMAS MALLOCH",
    "title": "Autobiography",
    "url": "http://fiftywordstories.com/2020/11/27/thomas-malloch-autobiography/",
    "storyHTML": "<p>The librarian hands him a slip of paper with a number on it and directs him to the far end of the reading room.</p><p>An empty shelf, save for one slim volume. ‘My Life.’</p><p>He stares at the author’s name. Picks it up. Opens.</p><p>Every page he turns is blank.</p>",
    "storyText": "The librarian hands him a slip of paper with a number on it and directs him to the far end of the reading room. An empty shelf, save for one slim volume. 'My Life.' He stares at the author's name. Picks it up. Opens. Every page he turns is blank.",
    "bio": "Thomas Malloch lives in the south-west of Scotland. After retirement, he thought he’d try his hand at writing and some of his work has even made it into print in Reflex Fiction, Bath Flash Fiction, Gutter, and the Barcelona Review.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca75",
    "id": "44676",
    "author": "JOHN H. DROMEY",
    "title": "Sonic Signals",
    "url": "http://fiftywordstories.com/2020/11/26/john-h-dromey-sonic-signals/",
    "storyHTML": "<p>Without X-ray vision, I cannot say with certainty what goes on in the apartment above. I can only speculate.</p><p>The tenant’s noise-making cannot be eliminated entirely, of course, but confiscating his pogo stick, restricting lessons for cloggers to midday only, and impounding his pet elephant might be a good start.</p>",
    "storyText": "Without X-ray vision, I cannot say with certainty what goes on in the apartment above. I can only speculate. The tenant's noise-making cannot be eliminated entirely, of course, but confiscating his pogo stick, restricting lessons for cloggers to midday only, and impounding his pet elephant might be a good start.",
    "bio": "John H. Dromey’s short fiction’s been published in Mystery Weekly Magazine and over 150 other venues.",
    "dateScraped": "Mon, 08 Mar 2021 12:01:55 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca74",
    "id": "44674",
    "author": "GREG SCHWARTZ",
    "title": "Time Travel",
    "url": "http://fiftywordstories.com/2020/11/26/greg-schwartz-time-travel/",
    "storyHTML": "<p>Arthur discovered time travel quite by accident.</p><p>It was surprisingly simple. He reached into his cupboard for a snack, and suddenly, with a WHOOSH, he was across the room, fifteen seconds ago.</p><p>“Whoa!” Arthur exclaimed. But he was still hungry, so he went over to the cupboard for a snack.</p>",
    "storyText": "Arthur discovered time travel quite by accident. It was surprisingly simple. He reached into his cupboard for a snack, and suddenly, with a WHOOSH, he was across the room, fifteen seconds ago. \"Whoa!\" Arthur exclaimed. But he was still hungry, so he went over to the cupboard for a snack.",
    "bio": "<!-- LikeBtn.com BEGIN --><span class=\"likebtn-wrapper\" data-identifier=\"post_44674\" data-site_id=\"54c694bb3866e1003eb3cd09\" data-theme=\"padded\" data-bg_c_v=\"\" data-dislike_enabled=\"false\" data-icon_dislike_show=\"false\" data-share_enabled=\"false\" data-loader_show=\"true\" data-popup_content_order=\"popup_share,popup_html\" data-popup_disabled=\"true\" data-style=\"\" data-unlike_allowed=\"\" data-show_copyright=\"\" data-item_url=\"http://fiftywordstories.com/2020/11/26/greg-schwartz-time-travel/\" data-item_title=\"GREG SCHWARTZ: Time Travel\" data-item_date=\"2020-11-26T03:00:08-08:00\" data-engine=\"WordPress\" data-plugin_v=\"2.6.36\" data-prx=\"http://fiftywordstories.com/wp-admin/admin-ajax.php?action=likebtn_prx\" data-event_handler=\"likebtn_eh\"></span><!-- LikeBtn.com END -->",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca73",
    "id": "44672",
    "author": "SAGE TYRTLE",
    "title": "Fortune Teller",
    "url": "http://fiftywordstories.com/2020/11/25/sage-tyrtle-fortune-teller/",
    "storyHTML": "<p>Madame Zolinska is leaning into the crystal ball.</p><p>“…and two mortgages. You and your daughter will be estranged. Sometimes you’ll wonder whatever happened to your dream of being a pediatrician.”</p><p>On the other side of the purple tablecloth, the teenager begins to cry.</p><p>“You wanted to know,” says Madame Zolinska.</p>",
    "storyText": "Madame Zolinska is leaning into the crystal ball. \"…and two mortgages. You and your daughter will be estranged. Sometimes you'll wonder whatever happened to your dream of being a pediatrician.\" On the other side of the purple tablecloth, the teenager begins to cry. \"You wanted to know,\" says Madame Zolinska.",
    "bio": "Sage Tyrtle is a professional storyteller. Her stories have been featured on NPR, CBC, and PBS. She is a Moth StorySLAM and GrandSLAM winner. She’s also one of those Americans who swanned around saying, “If this gets any worse, I’M moving to CANADA,” but then she really did. See more at <a href=\"http://tyrtle.com\" rel=\"noopener noreferrer\" target=\"_blank\">tyrtle.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca72",
    "id": "44670",
    "author": "JAMES GALLANT",
    "title": "Divine Intervention",
    "url": "http://fiftywordstories.com/2020/11/25/james-gallant-divine-intervention/",
    "storyHTML": "<p>The hemp rope used to hang Joseph Samuel, found guilty of murder in Australia, failed three times. The Almighty had obviously intervened. Samuel’s sentence was commuted to life imprisonment, and it was during his daring prison escape by boat on a stormy night the Almighty saw fit to drown him.</p>",
    "storyText": "The hemp rope used to hang Joseph Samuel, found guilty of murder in Australia, failed three times. The Almighty had obviously intervened. Samuel's sentence was commuted to life imprisonment, and it was during his daring prison escape by boat on a stormy night the Almighty saw fit to drown him.",
    "bio": "James Gallant’s story collection, <em>La Leona, and Other Guitar stories</em>, winner of the 2019 Schaffner Press prize for music-in-literature, is available from Barnes and Noble and Amazon. Learn more at <a href=\"http://jamesgallantwriter.com\" rel=\"noopener noreferrer\" target=\"_blank\">jamesgallantwriter.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca71",
    "id": "44667",
    "author": "LARISSA THOMSON",
    "title": "Let’s Pretend",
    "url": "http://fiftywordstories.com/2020/11/24/larissa-thomson-lets-pretend/",
    "storyHTML": "<p>She was always immaculately put together—linen suits, manicured nails, hair colour every six weeks—but a heart attack has you in her apartment discovering her unwashed undergarments and a cache of diet pills in a bathroom cabinet.</p><p>You can’t just shut that cabinet and walk away now, my friend.</p>",
    "storyText": "She was always immaculately put together - linen suits, manicured nails, hair colour every six weeks - but a heart attack has you in her apartment discovering her unwashed undergarments and a cache of diet pills in a bathroom cabinet. You can't just shut that cabinet and walk away now, my friend.",
    "bio": "Larissa Thomson is from British Columbia, Canada. She loves to write flash fiction and short stories, but this is her first foray into micro fiction. She is raising two humans and hopefully teaching them the importance of looking beyond the superficial.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca70",
    "id": "44665",
    "author": "MARY KUNA",
    "title": "Another Ugly Duckling",
    "url": "http://fiftywordstories.com/2020/11/24/mary-kuna-another-ugly-duckling/",
    "storyHTML": "<p>Wistful, she sketched long-limbed, elegant ballerinas. Twelve was too old to start dancing.</p><p>She learned otherwise at thirty, hand on the barre, feet turned out. Age thirty-two, peachy-pink satin pointe shoes, bloody blisters, bruised toenails, no talent. Rare moments of effortless double pirouettes or soaring leaps were worth the wait.</p>",
    "storyText": "Wistful, she sketched long-limbed, elegant ballerinas. Twelve was too old to start dancing. She learned otherwise at thirty, hand on the barre, feet turned out. Age thirty-two, peachy-pink satin pointe shoes, bloody blisters, bruised toenails, no talent. Rare moments of effortless double pirouettes or soaring leaps were worth the wait.",
    "bio": "Mary Kuna lives in Saint John, New Brunswick. Her flash fiction has received second prize in Brilliant Flash Fiction’s Librarians’ Choice Writing Contest and an honorable mention in Queer Sci Fi’s Innovation contest and anthology. She tweets sporadically at <a href=\"https://twitter.com/MaryKuna\" rel=\"noopener noreferrer\" target=\"_blank\">@MaryKuna</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca6f",
    "id": "44659",
    "author": "ROSALEEN LYNCH",
    "title": "The Succulent",
    "url": "http://fiftywordstories.com/2020/11/23/rosaleen-lynch-the-succulent/",
    "storyHTML": "<p>She was,<br>He said,<br>Most tender,<br>Juicy at the core,<br>And delicious.<br>Thick fleshy limbs,<br>Like he liked,<br>Engorged organs,<br>Full of liquid life,<br>Until the cut,<br>When he watched it sap away.<br>Sticky in the gathering earth,<br>Surrounding her return to roots,<br>In death buried to be born again.</p>",
    "storyText": "She was, He said, Most tender, Juicy at the core, And delicious. Thick fleshy limbs, Like he liked, Engorged organs, Full of liquid life, Until the cut, When he watched it sap away. Sticky in the gathering earth, Surrounding her return to roots, In death buried to be born again.",
    "bio": "Rosaleen Lynch, an Irish community worker and writer in the East End of London, pursues stories conversational, literary and performed. Words in Jellyfish Review, EllipsisZine, Fish, Mslexia, The London Reader and other lovely places and can be found on Twitter at <a href=\"https://twitter.com/quotes_52\" rel=\"noopener noreferrer\" target=\"_blank\">@quotes_52</a> and <a href=\"http://52Quotes.blogspot.com\" rel=\"noopener noreferrer\" target=\"_blank\">52Quotes.blogspot.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca6e",
    "id": "44657",
    "author": "HAYDEN KAMIDE",
    "title": "It’s a girl!",
    "url": "http://fiftywordstories.com/2020/11/23/hayden-kamide-its-a-girl/",
    "storyHTML": "<p>It’s celebratory and devoid of any guidance on how hard it’s going to be. Life anew. They beam, hand you a baby. Everyone back slaps you. Hugs. Gifts. They never tell you how it will feel to find her on the bedroom floor with a needle jammed in her arm.</p>",
    "storyText": "It's celebratory and devoid of any guidance on how hard it's going to be. Life anew. They beam, hand you a baby. Everyone back slaps you. Hugs. Gifts. They never tell you how it will feel to find her on the bedroom floor with a needle jammed in her arm.",
    "bio": "Hayden Kamide lives in New York. Probably not the hip part you’re thinking about, but the other part. He believes in the importance of kindness, yet recognizes his own hypocrisy, especially when he sometimes swears at people who cut him off in traffic. But, when it happens, he does feel bad about it… later. Much, much later.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca6d",
    "id": "44655",
    "author": "LINDA McMULLEN",
    "title": "The Gallant Ship",
    "url": "http://fiftywordstories.com/2020/11/20/linda-mcmullen-the-gallant-ship/",
    "storyHTML": "<p>The water’s rising; it’s washed away the righteous and the sinners. I’m still here. I’ve bailed, prayed, bailed again. Ahead, there’s a girl huddled on a rooftop. I navigate toward her, lift her into the hissing raft.</p><p>It sighs, loudly.</p><p>I wave goodbye, clambering onto the slates.</p><p>The water’s rising—</p>",
    "storyText": "The water's rising; it's washed away the righteous and the sinners. I'm still here. I've bailed, prayed, bailed again. Ahead, there's a girl huddled on a rooftop. I navigate toward her, lift her into the hissing raft. It sighs, loudly. I wave goodbye, clambering onto the slates. The water's rising - ",
    "bio": "Linda McMullen is a wife, mother, diplomat, and homesick Wisconsinite. Her short stories and the occasional poem have appeared in over seventy literary magazines.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca6c",
    "id": "44653",
    "author": "SHARON GERGER",
    "title": "Happy Days Ahead",
    "url": "http://fiftywordstories.com/2020/11/20/sharon-gerger-happy-days-ahead/",
    "storyHTML": "<p>He forced her retirement.</p><p>She used to love writing. He mocked her stories, told her he paid her to edit, not write drivel.</p><p>His words ate her confidence and she stopped writing.</p><p>For a while.</p><p>Bookkeeping will soon discover a theft. She’s left plenty of writing behind to implicate him.</p>",
    "storyText": "He forced her retirement. She used to love writing. He mocked her stories, told her he paid her to edit, not write drivel. His words ate her confidence and she stopped writing. For a while. Bookkeeping will soon discover a theft. She's left plenty of writing behind to implicate him.",
    "bio": "Sharon Gerger is about to retire. She will not be committing any crimes on her way out the door. Her writing appears here and there, in print and on the internet.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca6b",
    "id": "44650",
    "author": "DAVID HOLLOWAY",
    "title": "Extra Time",
    "url": "http://fiftywordstories.com/2020/11/19/david-holloway-extra-time/",
    "storyHTML": "<p>I cleaned out the kitchen junk drawer, and along with toothpicks, ballpoint pens, and dead batteries, I found three hours I’d lost in 2006. Should I mow the lawn, get extra sleep, fix my life?</p><p>Caught in traffic, I pulled them out. No good: they were deader than the batteries.</p>",
    "storyText": "I cleaned out the kitchen junk drawer, and along with toothpicks, ballpoint pens, and dead batteries, I found three hours I'd lost in 2006. Should I mow the lawn, get extra sleep, fix my life? Caught in traffic, I pulled them out. No good: they were deader than the batteries.",
    "bio": "David Holloway lives and writes in Northern Virginia. He has had work published in Gargoyle, Kayak, and The Mad River Review.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:03 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca6a",
    "id": "44648",
    "author": "BRIAN MAYCOCK",
    "title": "The Museum of the Lost",
    "url": "http://fiftywordstories.com/2020/11/19/brian-maycock-the-museum-of-the-lost/",
    "storyHTML": "<p>It looks at the Blue Whale suspended overhead and sadness clouds its thoughts. It is a robot but not unfeeling.</p><p>Programmed to preserve, it has overseen the installation of thousands of extinct species.</p><p>It watches the latest display being lowered into place. A male and a female. Designation: Homo sapiens.</p>",
    "storyText": "It looks at the Blue Whale suspended overhead and sadness clouds its thoughts. It is a robot but not unfeeling. Programmed to preserve, it has overseen the installation of thousands of extinct species. It watches the latest display being lowered into place. A male and a female. Designation: Homo sapiens.",
    "bio": "Brian Maycock recently won the Scottish Book Trust’s monthly 50-word story competition and lives in Glasgow.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca69",
    "id": "44646",
    "author": "CHERYL SOMERS AUBIN",
    "title": "Sleeping",
    "url": "http://fiftywordstories.com/2020/11/18/cheryl-somers-aubin-sleeping/",
    "storyHTML": "<p>A baby boy sleeps, tummy side up, arms and legs open in vulnerability and confidence. A mother puts a hand to his chest, feeling the rise and fall, listens to his ragged breathing. On the floor beside the crib, she lays on her side, curled inward, fear coiling around her.</p>",
    "storyText": "A baby boy sleeps, tummy side up, arms and legs open in vulnerability and confidence. A mother puts a hand to his chest, feeling the rise and fall, listens to his ragged breathing. On the floor beside the crib, she lays on her side, curled inward, fear coiling around her.",
    "bio": "Cheryl Somers Aubin’s work has appeared in newspapers, magazines, and online journals. She has an MA/Writing from Johns Hopkins University and is the author of <em>The Survivor Tree: Inspired by a True Story</em>. Cheryl teaches memoir writing and is featured speaker at book festivals and writing conferences.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca68",
    "id": "44644",
    "author": "LISA CHAMBERS",
    "title": "From Longing to Belonging",
    "url": "http://fiftywordstories.com/2020/11/18/lisa-chambers-from-longing-to-belonging/",
    "storyHTML": "<p>Homeless, he roamed the streets aimlessly, each day a looming uncertainty.</p><p>Kindness sought from strangers was elusive until a chance meeting outside a laundromat. Finally: someone who saw beyond his very rough edges.</p><p>These days, “Ben” lives cozily, his tail beating a joyous rhythm whenever his new Dad is near.</p>",
    "storyText": "Homeless, he roamed the streets aimlessly, each day a looming uncertainty. Kindness sought from strangers was elusive until a chance meeting outside a laundromat. Finally: someone who saw beyond his very rough edges. These days, \"Ben\" lives cozily, his tail beating a joyous rhythm whenever his new Dad is near.",
    "bio": "Lisa Chambers is a Texas girl and writer who loves happy endings.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca67",
    "id": "44640",
    "author": "NORIKO JAYASEKERA",
    "title": "Songs for the Light",
    "url": "http://fiftywordstories.com/2020/11/17/noriko-jayasekera-songs-for-the-light/",
    "storyHTML": "<p>The songs we sang in the evenings without electricity, seated at the doorstep, four of us and father: warm evenings with warm hearts.</p><p>The songs are old now.</p><p>I play my old songs on piano, singing them to my daughter with a new light, but I’m not sure she sees.</p>",
    "storyText": "The songs we sang in the evenings without electricity, seated at the doorstep, four of us and father: warm evenings with warm hearts. The songs are old now. I play my old songs on piano, singing them to my daughter with a new light, but I'm not sure she sees.",
    "bio": "Noriko Jayasekera is a university lecturer.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca66",
    "id": "44642",
    "author": "ANGELA CARLTON",
    "title": "King Edward",
    "url": "http://fiftywordstories.com/2020/11/17/angela-carlton-king-edward/",
    "storyHTML": "<p>They called you King Edward.</p><p>There were colors spilling from your guitar, swirling into sounds that shook us, the eruption we didn’t expect.</p><p>You molded our tiny, fragile worlds until we found our own strengths, and cancer found yours.</p><p>Goodnight, King. There’s still a glow from the fire on stage.</p>",
    "storyText": "They called you King Edward. There were colors spilling from your guitar, swirling into sounds that shook us, the eruption we didn't expect. You molded our tiny, fragile worlds until we found our own strengths, and cancer found yours. Goodnight, King. There's still a glow from the fire on stage.",
    "bio": "Angela Carlton wrote this tribute to Eddie Van Halen.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca65",
    "id": "44634",
    "author": "MARIA S NITSOLAS",
    "title": "My Muse",
    "url": "http://fiftywordstories.com/2020/11/16/maria-s-nitsolas-my-muse/",
    "storyHTML": "<p>It starts out as a vague outline, but a warm feeling of familiarity envelops me as my pencil glides across the stretched canvas and a body begins to take shape. Smooth strokes fill in the curves of her hips and her eyes take on a life that no longer exists.</p>",
    "storyText": "It starts out as a vague outline, but a warm feeling of familiarity envelops me as my pencil glides across the stretched canvas and a body begins to take shape. Smooth strokes fill in the curves of her hips and her eyes take on a life that no longer exists.",
    "bio": "Maria S. Nitsolas is an emerging writer from Sydney, Australia. To follow her writing journey, visit <a href=\"http://mariasnitsolas.com\" rel=\"noopener noreferrer\" target=\"_blank\">mariasnitsolas.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca64",
    "id": "44632",
    "author": "STEVE LEGOMSKY",
    "title": "A Modest Gratuity",
    "url": "http://fiftywordstories.com/2020/11/16/steve-legomsky-a-modest-gratuity/",
    "storyHTML": "<p>Ironic that they named me “Mercy.” Am I supposed to show mercy or ask for it? They never told me.</p><p>Tomorrow I will sentence Slade for grand theft. I’ve accepted his modest gratuity.</p><p>Thing is, I’d already decided to go easy on him anyway. No harm, no foul, I figure.</p>",
    "storyText": "Ironic that they named me \"Mercy.\" Am I supposed to show mercy or ask for it? They never told me. Tomorrow I will sentence Slade for grand theft. I've accepted his modest gratuity. Thing is, I'd already decided to go easy on him anyway. No harm, no foul, I figure.",
    "bio": "Steve Legomsky is a former mathematician; Washington University law professor specializing in immigration, refugees, and human rights; and Chief Counsel of the immigration services agency in the Obama Administration. He has had visiting research or teaching appointments in twelve countries and has published three scholarly books (Oxford University Press and West Academic); numerous academic journal articles; one novel, “The Picobe Dilemma” (Booklocker.com, 2017); and short stories in The Ravens Perch, Fewer than 500, the Broadkill Review (forthcoming January 2021), Idle Ink (forthcoming Nov. 7, 2020), and Offcourse. Steve lives in St. Louis and loves his family, children, animals, and the Red Sox.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca63",
    "id": "44621",
    "author": "BS ROBERTS",
    "title": "Blowing Off the Dust",
    "url": "http://fiftywordstories.com/2020/11/13/bs-roberts-blowing-off-the-dust/",
    "storyHTML": "<p>With a swipe of my hand, the pentagram completes. Cold air ignites into neon light. I wave, pushing the star away—curtailing physics, defying rationality. Choking on my tears, my naivety of a moment ago astounds me.</p><p>As the glow fades, I close the ancient tome. Magic becomes fantasy again.</p>",
    "storyText": "With a swipe of my hand, the pentagram completes. Cold air ignites into neon light. I wave, pushing the star away - curtailing physics, defying rationality. Choking on my tears, my naivety of a moment ago astounds me. As the glow fades, I close the ancient tome. Magic becomes fantasy again.",
    "bio": "When not indulging himself by reading or writing poetry and prose, B.S. Roberts makes a living as a museum curator and an administrative assistant at the University of Maine at Augusta. He lives in Maine with his fiancée, daughter, silver pheasants, turtle, and four cats. See more at <a href=\"http://bsroberts.com\" target=\"_blank\" rel=\"noopener noreferrer\">bsroberts.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca62",
    "id": "44619",
    "author": "JAMES ROSS",
    "title": "Falling",
    "url": "http://fiftywordstories.com/2020/11/13/james-ross-falling/",
    "storyHTML": "<p>She slept now, chest rising and falling, even and slow, eyes flickering beneath their lids, dreaming. He whispered her name, but she didn’t stir. Brushing strands of hair from her eyes, he kissed her soft cheek and then rose quietly from their bed. Silently, he closed the door behind him.</p>",
    "storyText": "She slept now, chest rising and falling, even and slow, eyes flickering beneath their lids, dreaming. He whispered her name, but she didn't stir. Brushing strands of hair from her eyes, he kissed her soft cheek and then rose quietly from their bed. Silently, he closed the door behind him.",
    "bio": "James Ross wrote this story.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca61",
    "id": "44613",
    "author": "KEELY O’SHAUGHNESSY",
    "title": "Running Water",
    "url": "http://fiftywordstories.com/2020/11/12/keely-oshaughnessy-running-water/",
    "storyHTML": "<p>The dime-sized hole in my bathroom ceiling has grown.</p><p>Eyes closed, I lather my hair.</p><p>At night, my neighbor’s unlatched gate bangs; roof joists creak. Childlike fear creeps in.</p><p>The water runs hot. Pipes wail.</p><p>I smile at the truth now.</p><p>Above me, pushed tight against the gap, something blinks.</p>",
    "storyText": "The dime-sized hole in my bathroom ceiling has grown. Eyes closed, I lather my hair. At night, my neighbor's unlatched gate bangs; roof joists creak. Childlike fear creeps in. The water runs hot. Pipes wail. I smile at the truth now. Above me, pushed tight against the gap, something blinks.",
    "bio": "Keely O’Shaughnessy is a fiction writer with Cerebral Palsy, which she sometimes writes about. She is Managing Editor at Flash Fiction Magazine. Her short fiction has appeared in both, anthologies and literary magazines, and her most recent publications include, Pretty Owl Poetry’s Spring 2020 issue and NFFD’s Flash Flood. Her story “When Naked Plants Renew” will be featured in this years Solstice Shorts Festival 2020, Tymes goe by Turnes.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca60",
    "id": "44611",
    "author": "ROBB LANUM",
    "title": "Almost 4 haikus about growing up",
    "url": "http://fiftywordstories.com/2020/11/12/robb-lanum-almost-4-haikus-about-growing-up/",
    "storyHTML": "<p>“The easiest thing<br>In the world to be is young.”<br>That’s what Grandpa said.</p><p>When my sons treat me<br>Like I treated my father,<br>It will break my heart.</p><p>Twelve-year-olds close doors<br>And lock themselves in for good.</p><p>Baby pictures, walls,<br>A dream you don’t remember.<br>You’re just passing through.</p>",
    "storyText": "\"The easiest thing In the world to be is young.\" That's what Grandpa said. When my sons treat me Like I treated my father, It will break my heart. Twelve-year-olds close doors And lock themselves in for good. Baby pictures, walls, A dream you don't remember. You're just passing through.",
    "bio": "Robb Lanum is a failed screenwriter in Los Angeles. His longer, epic works have appeared on 101words.org, and he was a winner of the <a href=\"https://lapl.org/short-stories\" rel=\"noopener noreferrer\" target=\"_blank\">Summer 2020 Los Angeles Public Library Short Story Contest</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca5f",
    "id": "44609",
    "author": "LE ANNE WELDER",
    "title": "A Hand, a Life",
    "url": "http://fiftywordstories.com/2020/11/11/le-anne-welder-a-hand-a-life/",
    "storyHTML": "<p>Is that my hand? Lightly spotted, thin?</p><p>Yes.</p><p>Not the hand of my youth, no, but a learned hand.</p><p>It knows much; it is very wise.</p><p>It knows where to go—and not.</p><p>It serves, it loves, it works, it plays.</p><p>It leads, it trails, it grasps… it lets go.</p>",
    "storyText": "Is that my hand? Lightly spotted, thin? Yes. Not the hand of my youth, no, but a learned hand. It knows much; it is very wise. It knows where to go - and not. It serves, it loves, it works, it plays. It leads, it trails, it grasps… it lets go.",
    "bio": "Le Anne, a recent transplant to small town North Carolina, enjoys book clubs, writing short and flash fiction, and time spent Zooming with her creative writing group.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca5e",
    "id": "44605",
    "author": "MICHELLE WILSON",
    "title": "A Perfect Beach Day",
    "url": "http://fiftywordstories.com/2020/11/11/michelle-wilson-a-perfect-beach-day/",
    "storyHTML": "<p>Through sliding glass doors, we marvel at the magnificent, royal-blue sky. The wind-rippled ocean beckons, inspiring dreams of lounge chairs and exotic cocktails beside the water’s edge.</p><p>One almost forgets the cities drowned beneath it, and that if we stepped outside, the sun would cook us in under a minute.</p>",
    "storyText": "Through sliding glass doors, we marvel at the magnificent, royal-blue sky. The wind-rippled ocean beckons, inspiring dreams of lounge chairs and exotic cocktails beside the water's edge. One almost forgets the cities drowned beneath it, and that if we stepped outside, the sun would cook us in under a minute.",
    "bio": "Michelle Wilson graduated from Bennington College with a degree in literature and creative writing. Her words have appeared in <em>Friday Flash Fiction, Entropy Squared, 50-Word Stories, 101 Words, Literally Stories, Flash Fiction Magazine, Mr. Beller’s Neighborhood, Healthcare in America, The Miami Herald</em>, and elsewhere. She lives in Miami Beach, Florida.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca5d",
    "id": "44603",
    "author": "RAYMOND SLOAN",
    "title": "The Nine to Lifer",
    "url": "http://fiftywordstories.com/2020/11/10/raymond-sloan-the-nine-to-lifer/",
    "storyHTML": "<p>The day I retired my doctor broke the news. I bolted from his office, drove to my wife’s grave.</p><p>“Nearly there, sweetheart,” I sobbed.</p><p>Six months later, breathless, braced for the inevitable, I pleaded with my workaholic son, urging him to take the same advice my father once gave me.</p>",
    "storyText": "The day I retired my doctor broke the news. I bolted from his office, drove to my wife's grave. \"Nearly there, sweetheart,\" I sobbed. Six months later, breathless, braced for the inevitable, I pleaded with my workaholic son, urging him to take the same advice my father once gave me.",
    "bio": "Raymond Sloan lives and writes in County Down, Ireland.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca5c",
    "id": "44601",
    "author": "TODD MERCER",
    "title": "Blossom Technician, Gone Rogue in the Field",
    "url": "http://fiftywordstories.com/2020/11/10/todd-mercer-blossom-technician-gone-rogue-in-the-field/",
    "storyHTML": "<p>We’ll call our guy “B.” to protect his identity.</p><p>B.’s manager can’t make heads or tails of his convoluted delivery route. Not one straight line between stops. He doesn’t confess to dusting his ankles at Daisy’s and Violet’s, at Dahlia’s. Gathering pollen.</p><p>B. loves his job, every meander, each back-track.</p>",
    "storyText": "We'll call our guy \"B.\" to protect his identity. B.'s manager can't make heads or tails of his convoluted delivery route. Not one straight line between stops. He doesn't confess to dusting his ankles at Daisy's and Violet's, at Dahlia's. Gathering pollen. B. loves his job, every meander, each back-track.",
    "bio": "Todd Mercer was nominated for Fiction and Poetry Pushcarts last year. His collection <em>Ingenue</em> was published Autumn of 2020 by Celery City Press.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca5b",
    "id": "44592",
    "author": "YASH SEYEDBAGHERI",
    "title": "Rich on Five Dollars",
    "url": "http://fiftywordstories.com/2020/11/09/yash-seyedbagheri-rich-on-five-dollars/",
    "storyHTML": "<p>We count pennies, dollar bills gone.<br>With each clink of pennies, we imagine the weight of wealth.<br>But after rent, utilities, closed credit cards, and expensive Merlots we needed but didn’t, we have five dollars.<br>That’ll buy a McChicken. A Coke. Bags of chips.<br>At least it’s not two dollars.</p>",
    "storyText": "We count pennies, dollar bills gone. With each clink of pennies, we imagine the weight of wealth. But after rent, utilities, closed credit cards, and expensive Merlots we needed but didn't, we have five dollars. That'll buy a McChicken. A Coke. Bags of chips. At least it's not two dollars.",
    "bio": "Yash Seyedbagheri is a graduate of Colorado State University’s MFA program in fiction. A native of Idaho, Yash’s work is forthcoming or has been published in The Journal of Compressed Creative Arts, Write City Magazine, and Ariel Chart, among others.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca5a",
    "id": "44590",
    "author": "LISA MARIE LOPEZ",
    "title": "Bruised",
    "url": "http://fiftywordstories.com/2020/11/09/lisa-marie-lopez-bruised/",
    "storyHTML": "<p>When he spotted his ex-girlfriend on the subway with another man, he turned and faced the window. Their goofy grins shone in the reflection. Next stop, he bustled hastily through the doors and found himself miles away from home, far away from anything he knew, and yet, not far enough.</p>",
    "storyText": "When he spotted his ex-girlfriend on the subway with another man, he turned and faced the window. Their goofy grins shone in the reflection. Next stop, he bustled hastily through the doors and found himself miles away from home, far away from anything he knew, and yet, not far enough.",
    "bio": "Lisa Marie Lopez has had stories recently published in Blink-Ink and The Ocotillo Review. She loves baseball, turtles, and writing in cozy little cafes. Visit her on Facebook at&nbsp;<a class=\"v1enhancr_card_5032581418\" href=\"http://www.facebook.com/authorlisamariefiction\" target=\"_blank\" rel=\"noopener noreferrer\">Author Lisa Marie Lopez</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca59",
    "id": "44583",
    "author": "MICHAEL B KEANE",
    "title": "The Day After It Bit Me",
    "url": "http://fiftywordstories.com/2020/11/06/michael-b-keane-the-day-after-it-bit-me/",
    "storyHTML": "<p>I was asleep, darkly dreaming. There was suddenly a scream from my little sister, whom I could hear tearing down the hallway, and next thing I knew, I was scurrying on all fours into the nearest corner, bristling with fear.</p><p>“Mom,” she sobbed, “there’s a huge rat in his room!”</p>",
    "storyText": "I was asleep, darkly dreaming. There was suddenly a scream from my little sister, whom I could hear tearing down the hallway, and next thing I knew, I was scurrying on all fours into the nearest corner, bristling with fear. \"Mom,\" she sobbed, \"there's a huge rat in his room!\"",
    "bio": "Michael B. Keane is a London-based writer of dark fiction.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca58",
    "id": "44581",
    "author": "TAWNIA COURAGE",
    "title": "The Battle Within",
    "url": "http://fiftywordstories.com/2020/11/06/tawnia-courage-the-battle-within/",
    "storyHTML": "<p>Doubt pulls me into a chasm of dread. Spiraling in darkness. Out of control.</p><p><em>Stop!</em></p><p>Hope glimmers briefly—but the bonds of anxiety choke it.</p><p><em>No!</em></p><em></em><p><em>Let go. Breathe deep.</em></p><p>Resilience sparks… grows. I grasp a flicker, encourage and feed it.</p><p>The glow swells… black shadows recede.</p><p><em>I’ve got this.</em></p>",
    "storyText": "Doubt pulls me into a chasm of dread. Spiraling in darkness. Out of control. Stop! Hope glimmers briefly - but the bonds of anxiety choke it. No! Let go. Breathe deep. Resilience sparks… grows. I grasp a flicker, encourage and feed it. The glow swells… black shadows recede. I've got this.",
    "bio": "Tawnia is an elementary teacher in Ontario who started writing a few years ago. You can find her on Twitter <a href=\"http://twitter.com/TawniaCourage\" rel=\"noopener noreferrer\" target=\"_blank\">@TawniaCourage</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca57",
    "id": "44574",
    "author": "TRAVIS D ROBERSON",
    "title": "The Vagrant",
    "url": "http://fiftywordstories.com/2020/11/05/travis-d-roberson-the-vagrant/",
    "storyHTML": "<p>The vagrant discovered the lake house at the end of a gravel road. A fridge inside a shed gifted him a single beer, and an untethered canoe took him into the lake, where he opened the beer and drank—living the life of another and waiting for something to end.</p>",
    "storyText": "The vagrant discovered the lake house at the end of a gravel road. A fridge inside a shed gifted him a single beer, and an untethered canoe took him into the lake, where he opened the beer and drank - living the life of another and waiting for something to end.",
    "bio": "Travis D. Roberson grew up in Central Florida, where he spent most of his youth throwing rocks at snakes and reading comic books. He spent his late teens entrenched in Orlando’s local punk scene before leaving the sunshine state and bouncing around the world as a flight attendant at a major airline. Now settled in Queens, NY, he lives with his wife and his dog, who wakes him up far too early every morning. He spends most of his time yammering about the genius of Jim Jarmusch and The Clash to anyone that will pretend to listen. His work has appeared in a number of places, including <em>Hypnos</em>, <em>The Arcanist</em>, and <em>Coffin Bell</em>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:23 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca56",
    "id": "44576",
    "author": "JULIAN DORES",
    "title": "My father started fights in bars",
    "url": "http://fiftywordstories.com/2020/11/05/julian-dores-my-father-started-fights-in-bars/",
    "storyHTML": "<p>My father started fights in bars. The brutalist architecture of his days was legendary.</p><p>He was proud to be blue-collar, to break things with his hands and rebuild them in his image. Oak. Rosewood. My mom. The bones in my fingers.</p><p>In our house, silence was an act of survival.</p>",
    "storyText": "My father started fights in bars. The brutalist architecture of his days was legendary. He was proud to be blue-collar, to break things with his hands and rebuild them in his image. Oak. Rosewood. My mom. The bones in my fingers. In our house, silence was an act of survival.",
    "bio": "Julian&nbsp;Dores&nbsp;lives in Brussels, Belgium. He enjoys writing fiction and taking candid photographs of everyday life on the street. You can follow him&nbsp;<a href=\"https://twitter.com/JulianDores\" target=\"_blank\" rel=\"noopener noreferrer\">@JulianDores</a>&nbsp;or&nbsp;<a href=\"https://www.juliandores.com/\" target=\"_blank\" rel=\"noopener noreferrer\">on his website</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca55",
    "id": "44570",
    "author": "HANNAH KELLEY",
    "title": "Fruit Boy",
    "url": "http://fiftywordstories.com/2020/11/04/hannah-kelley-fruit-boy/",
    "storyHTML": "<p>Walter gobbled down the watermelon.</p><p>He felt the “plop, plop” as the seeds landed in his stomach.</p><p>When he woke the next morning, Walter had stems growing out his nose and a green tinge to his skin.</p><p>He was no longer a fully human boy.</p><p>He was becoming a Waltermelon.</p>",
    "storyText": "Walter gobbled down the watermelon. He felt the \"plop, plop\" as the seeds landed in his stomach. When he woke the next morning, Walter had stems growing out his nose and a green tinge to his skin. He was no longer a fully human boy. He was becoming a Waltermelon.",
    "bio": "Hannah Kelley lives in Australia and loves writing and reading micro-fiction. Her favourite fruit is watermelon.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca54",
    "id": "44568",
    "author": "BMA ROOK",
    "title": "Fly Free",
    "url": "http://fiftywordstories.com/2020/11/04/bma-rook-fly-free/",
    "storyHTML": "<p>He flies free on bold green wings, the sky above and the earth below. He soars towards warmth on a cooler breeze, chasing freedom with his peach-covered face. He surges forth towards the sun, the world before him, nothing behind him, and then blinks awake in his cold, impenetrable cage.</p>",
    "storyText": "He flies free on bold green wings, the sky above and the earth below. He soars towards warmth on a cooler breeze, chasing freedom with his peach-covered face. He surges forth towards the sun, the world before him, nothing behind him, and then blinks awake in his cold, impenetrable cage.",
    "bio": "B.M.A. Rook just wants this year to end without any more sorrow.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca53",
    "id": "44563",
    "author": "ROBERT MARKOVICH",
    "title": "The Shade Tree",
    "url": "http://fiftywordstories.com/2020/11/03/robert-markovich-the-shade-tree/",
    "storyHTML": "<p>“Tranquil here, isn’t it?” said the voice. She’d met him after her divorce. Such a good listener! She felt a rivulet of sweat trickle down her back beneath her blouse. But the tree was wide, and his touch cool as he coiled himself around her and whispered in her ear.</p>",
    "storyText": "\"Tranquil here, isn't it?\" said the voice. She'd met him after her divorce. Such a good listener! She felt a rivulet of sweat trickle down her back beneath her blouse. But the tree was wide, and his touch cool as he coiled himself around her and whispered in her ear.",
    "bio": "Robert Markovich spent a lifetime in what is charitably referred to as service journalism, writing and editing stories about everything from cars to toilets, most recently at Consumer Reports. He is happily and gratefully retired.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca52",
    "id": "44561",
    "author": "FANNIE CHEN",
    "title": "The Manager",
    "url": "http://fiftywordstories.com/2020/11/03/fannie-chen-the-manager/",
    "storyHTML": "<p>He looks at the wheel with great determination. He turns it slowly, controlling the tepid temperature of spring in high heaven.</p><p>Cleaner silently mops the wet floor.</p><p>Thump! He slips. The wheel spins wildly. His face is pale with panic. Spring turns into summer, autumn, and winter.</p><p>He is fired.</p>",
    "storyText": "He looks at the wheel with great determination. He turns it slowly, controlling the tepid temperature of spring in high heaven. Cleaner silently mops the wet floor. Thump! He slips. The wheel spins wildly. His face is pale with panic. Spring turns into summer, autumn, and winter. He is fired.",
    "bio": "Fannie is a girl living in Sydney, NSW, Australia with a great interest in writing and literature.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca51",
    "id": "44548",
    "author": "MEGAN GIM",
    "title": "One Day at a Time",
    "url": "http://fiftywordstories.com/2020/11/02/megan-gim-one-day-at-a-time/",
    "storyHTML": "<p>The credit card declines again. I tell the cashier I’ve left the other card at home.</p><p>Walk back without the groceries, holding Evie’s hand, wondering whether she’ll be happy with spaghetti again.</p><p>I gently rub the ring on my middle finger. I’ll take it tomorrow. Should buy us some time.</p>",
    "storyText": "The credit card declines again. I tell the cashier I've left the other card at home. Walk back without the groceries, holding Evie's hand, wondering whether she'll be happy with spaghetti again. I gently rub the ring on my middle finger. I'll take it tomorrow. Should buy us some time.",
    "bio": "Megan Gim works as a speech pathologist but is currently on maternity leave with two young boys at home. She recently completed a short course through the Australian Writers’ Centre for writing middle grade fiction, which has reignited a passion for writing, and is writing flash fiction and microfiction to help develop her writing skills.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca50",
    "id": "44546",
    "author": "JOHN YOUNG",
    "title": "As If…",
    "url": "http://fiftywordstories.com/2020/11/02/john-young-as-if/",
    "storyHTML": "<p>“I’m really, truly sorry,” Blake said, gesturing and screwing up his eyes, as if in pain, as if to show the depth of his regret.</p><p>Quite good acting, Ann thought.</p><p>“You do believe me?” he asked earnestly.</p><p>Smiling, she turned and walked away. As if I could be so stupid.</p>",
    "storyText": "\"I'm really, truly sorry,\" Blake said, gesturing and screwing up his eyes, as if in pain, as if to show the depth of his regret. Quite good acting, Ann thought. \"You do believe me?\" he asked earnestly. Smiling, she turned and walked away. As if I could be so stupid.",
    "bio": "John Young is an old chap grappling with themes of limits, longings, and finitude. He likes spooky stuff and lives in St Andrews, Scotland, an ancient town with an ancient university, home of golf, and home also – allegedly – of many ghosts. (He has not met any yet.)",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca4f",
    "id": "44529",
    "author": "GARY THOMSON",
    "title": "Apprentice",
    "url": "http://fiftywordstories.com/2020/10/30/gary-thomson-apprentice/",
    "storyHTML": "<p>Emma works her knife over the jack-o’-lantern’s flesh, tapers the leering, accusatory mouth, widens empty eyes. Her stepmother’s features, just so.</p><p>She draws the gleaming blade between unhearing ears.</p><p>A centred candle bursts into flame.</p><p>“Proof of the destructive power,” Master Carver has forewarned.</p><p>Soon father will be hers alone.</p>",
    "storyText": "Emma works her knife over the jack-o'-lantern's flesh, tapers the leering, accusatory mouth, widens empty eyes. Her stepmother's features, just so. She draws the gleaming blade between unhearing ears. A centred candle bursts into flame. \"Proof of the destructive power,\" Master Carver has forewarned. Soon father will be hers alone.",
    "bio": "Gary Thomson resides in Ontario, where he enjoys country drives through fiery autumn colours and strolling amongst early pioneer cemeteries. None of his published work matches the poignancy of mossy inscriptions on weathered grave markers.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca4e",
    "id": "44527",
    "author": "MARC LITTMAN",
    "title": "Ghost of Halloween",
    "url": "http://fiftywordstories.com/2020/10/30/marc-littman-ghost-of-halloween/",
    "storyHTML": "<p>The flickering jack-o’-lanterns stand sentry on my porch, but I’ve turned off my light lest any young tricksters trespass. Still, I left some treats in a plastic goblin’s palm with a sign saying “Pick one if you dare.” Sadly, I doubt any will dare tempt the viral Ghost of Halloween.</p>",
    "storyText": "The flickering jack-o'-lanterns stand sentry on my porch, but I've turned off my light lest any young tricksters trespass. Still, I left some treats in a plastic goblin's palm with a sign saying \"Pick one if you dare.\" Sadly, I doubt any will dare tempt the viral Ghost of Halloween.",
    "bio": "Marc Littman’s flash fiction has been published in many online magazines and anthologies from 50-Word Stories to The Saturday Evening Post. He also writes plays and novels.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca4d",
    "id": "44533",
    "author": "RODRIGO ORTIZ VINHOLO",
    "title": "Ammunition",
    "url": "http://fiftywordstories.com/2020/10/29/rodrigo-ortiz-vinholo-ammunition/",
    "storyHTML": "<p>We didn’t have enough bullets for everyone, so we had to draw lots. I lost. Typical.</p><p>“You should be glad,” they said. “You’ll get to live longer. In a way, we are the losers, right?”</p><p>Joke’s on them: I’ll eat their faces as soon as I turn into a zombie.</p>",
    "storyText": "We didn't have enough bullets for everyone, so we had to draw lots. I lost. Typical. \"You should be glad,\" they said. \"You'll get to live longer. In a way, we are the losers, right?\" Joke's on them: I'll eat their faces as soon as I turn into a zombie.",
    "bio": "Rodrigo Ortiz Vinholo is a Brazilian fiction writer based in São Paulo. His short fiction work has been featured in over a hundred collections in Brazilian Portuguese, exploring a wide variety of genres. His latest books are ‘Sinônimo de Rancor’ (2018, self-published), ‘Os Dias em que Rubia Viveu no Futuro’ (2019, Lendari), ’33’ (2020, Casa Literária) and ‘Poemas Chatos para Pessoas Ruins’ (2020, Darda Editora). See more at <a href=\"http://www.rodrigoortizvinholo.com.br\" rel=\"noopener noreferrer\" target=\"_blank\">rodrigoortizvinholo.com.br</a> (in Brazilian portuguese)",
    "dateScraped": "Mon, 08 Mar 2021 12:02:31 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca4c",
    "id": "44531",
    "author": "ROBERT MARKOVICH",
    "title": "The Empty Booth",
    "url": "http://fiftywordstories.com/2020/10/29/robert-markovich-the-empty-booth/",
    "storyHTML": "<p>Nearly every old strip-mall parking lot has one, a brick-and-glass memorial to when some kid inside handed you your finished Kodachromes.</p><p>Where did all those Kodachromes go? To dusty drawers and landfills. And the kid? To ‘Nam, where he stayed as his parents grew old wondering why they let him.</p>",
    "storyText": "Nearly every old strip-mall parking lot has one, a brick-and-glass memorial to when some kid inside handed you your finished Kodachromes. Where did all those Kodachromes go? To dusty drawers and landfills. And the kid? To 'Nam, where he stayed as his parents grew old wondering why they let him.",
    "bio": "Robert Markovich spent a lifetime in what is charitably referred to as service journalism, writing and editing stories about everything from cars to toilets, most recently at Consumer Reports. He is happily and gratefully retired.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca4b",
    "id": "44522",
    "author": "JR WALSH",
    "title": "Refer your friends",
    "url": "http://fiftywordstories.com/2020/10/28/jr-walsh-refer-your-friends/",
    "storyHTML": "<p>We weren’t in the evacuation zone, but we drove to the shelter.</p><p>We’re petting mangy dogs and seeing the guns. Breathing in people sprawled on Army blankets.</p><p>Dodging spinning children in line to pee. Signing up everyone for Amazon Prime. Five bucks per referral.</p><p>We’ll upgrade our bathrooms with bidets.</p>",
    "storyText": "We weren't in the evacuation zone, but we drove to the shelter. We're petting mangy dogs and seeing the guns. Breathing in people sprawled on Army blankets. Dodging spinning children in line to pee. Signing up everyone for Amazon Prime. Five bucks per referral. We'll upgrade our bathrooms with bidets.",
    "bio": "JR Walsh writes in landlocked Idaho, but <a href=\"http://itsjrwalsh.com\" rel=\"noopener noreferrer\" target=\"_blank\">itsjrwalsh.com</a> floats everywhere.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca4a",
    "id": "44520",
    "author": "MARIA CARGILLE",
    "title": "Stress Turned My Soul to Copper and Steam",
    "url": "http://fiftywordstories.com/2020/10/28/maria-cargille-stress-turned-my-soul-to-copper-and-steam/",
    "storyHTML": "<p>Anxiety forces another beam of steel through my belly,<br>apprehension caps my lungs,<br>and tangles them in wire.</p><p>Electricity jolts my chest<br>yanking a mechanical heart to life.</p><p>Oil slicks my throat<br>choking me into silence.</p><p>Perhaps terror stole my voicebox<br>too<br>and only the gears in my brain<br>scream.</p>",
    "storyText": "Anxiety forces another beam of steel through my belly, apprehension caps my lungs, and tangles them in wire. Electricity jolts my chest yanking a mechanical heart to life. Oil slicks my throat choking me into silence. Perhaps terror stole my voicebox too and only the gears in my brain scream.",
    "bio": "Maria copes with stress by listening to Steam Powered Giraffe, and writing strange poetry.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca49",
    "id": "44518",
    "author": "JOHN YOUNG",
    "title": "Humans!",
    "url": "http://fiftywordstories.com/2020/10/27/author-humans/",
    "storyHTML": "<p><em>Humans, givers of food</em>, thought the large dog, bounding to the man sitting against a wall. Since the time of the great light, the wind and fires, it had eaten little.</p><p>But the human had no food and was very weak.</p><p><em>Humans are food!</em> thought the dog, trotting contentedly away.</p>",
    "storyText": "Humans, givers of food, thought the large dog, bounding to the man sitting against a wall. Since the time of the great light, the wind and fires, it had eaten little. But the human had no food and was very weak. Humans are food! thought the dog, trotting contentedly away.",
    "bio": "John Young is an old chap grappling with themes of limits, longings, and finitude. He lives in St Andrews, Scotland, an ancient town with an ancient university, home of golf, home also – allegedly – of many ghosts. (He has not met any yet.)",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca48",
    "id": "44516",
    "author": "EDITH HELBERT",
    "title": "Like a Boss",
    "url": "http://fiftywordstories.com/2020/10/27/edith-helbert-like-a-boss/",
    "storyHTML": "<p>Waving good morning at a colleague, Shelly drops her bag on the table. Smiling, she opens her laptop and punches the flashing button on her desk phone, ready to begin. “Who knew one retirement would make such a difference around here?” she thinks. “I should have fired him years ago.”</p>",
    "storyText": "Waving good morning at a colleague, Shelly drops her bag on the table. Smiling, she opens her laptop and punches the flashing button on her desk phone, ready to begin. \"Who knew one retirement would make such a difference around here?\" she thinks. \"I should have fired him years ago.\"",
    "bio": "Edith is an uprooted southerner living in the midwestern US, where people talk too quickly and rivers move too slowly, but otherwise it’s a nice place to live.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca47",
    "id": "44514",
    "author": "BOB McWILLIAMS",
    "title": "The Old Folks at Home",
    "url": "http://fiftywordstories.com/2020/10/26/bob-mcwilliams-the-old-folks-at-home/",
    "storyHTML": "<p>The gate swung easily. The elderly couple on the porch chatting quietly. He glanced around. A perfect lawn. No weeds anywhere. Roses blooming everywhere. The house looked immaculate. <em>Who called social services? Quick check and I’ll be gone.</em></p><p>“Excuse me, can we talk?”</p><p>The couple turned. Glowing crimson eyes glared.</p>",
    "storyText": "The gate swung easily. The elderly couple on the porch chatting quietly. He glanced around. A perfect lawn. No weeds anywhere. Roses blooming everywhere. The house looked immaculate. Who called social services? Quick check and I'll be gone. \"Excuse me, can we talk?\" The couple turned. Glowing crimson eyes glared.",
    "bio": "Bob is retired and busy caring for his 5 dogs. After retiring, he began bartending but has since switched to writing. It may not yet be as financially rewarding but there’s a lot to be said about sitting and writing with a good cocktail! Bob is a big sports fan that lives outside Philly. A website is coming.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca46",
    "id": "44512",
    "author": "ANNALISE SANDRICH",
    "title": "First Attempt",
    "url": "http://fiftywordstories.com/2020/10/26/annalise-sandrich-first-attempt/",
    "storyHTML": "<p>There’s something oddly beautiful about a piece of crumpled up paper. The words lose their meaning and take on texture, melding with other fragments of folded sentences. The words, the one thing you thought still had meaning, are now denatured enzymes—useless. But didn’t you used to love beautiful destruction?</p>",
    "storyText": "There's something oddly beautiful about a piece of crumpled up paper. The words lose their meaning and take on texture, melding with other fragments of folded sentences. The words, the one thing you thought still had meaning, are now denatured enzymes - useless. But didn't you used to love beautiful destruction?",
    "bio": "AnnaLise Sandrich lives in California, where she writes for the Redwood Bark. Her work has been published in Short Fiction Break and will soon appear in 101 Words.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca45",
    "id": "44507",
    "author": "LISA CHAMBERS",
    "title": "A Cover Story",
    "url": "http://fiftywordstories.com/2020/10/23/lisa-chambers-a-cover-story/",
    "storyHTML": "<p>Sam can be so stubborn… most recently, his refusal to wear a mask.</p><p>I begged him. He scoffed, said it was silly, too confining.</p><p>“It’s not all about you!” I snapped. “Think of our friends. It’s expected, after all.”</p><p>Grumbling, he finally relented.</p><p>He’ll make a great Yoda this Halloween.</p>",
    "storyText": "Sam can be so stubborn… most recently, his refusal to wear a mask. I begged him. He scoffed, said it was silly, too confining. \"It's not all about you!\" I snapped. \"Think of our friends. It's expected, after all.\" Grumbling, he finally relented. He'll make a great Yoda this Halloween.",
    "bio": "Lisa Chambers is a Texas girl who loves writing (and reading) short stories.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca44",
    "id": "44505",
    "author": "PIPPA PHILLIPS",
    "title": "Pygmalion",
    "url": "http://fiftywordstories.com/2020/10/23/pippa-phillips-pygmalion/",
    "storyHTML": "<p>He painted her better than real, caught her in magic hour light, at an angle implying dimension.  Mindful of the power of the unknown, he draped her with shadows to keep her secrets in. When he offered her a glass of wine, she reached through the canvas to accept it.</p>",
    "storyText": "He painted her better than real, caught her in magic hour light, at an angle implying dimension. Mindful of the power of the unknown, he draped her with shadows to keep her secrets in. When he offered her a glass of wine, she reached through the canvas to accept it.",
    "bio": "Pippa Phillips is a recovering academic whose words have appeared in Failed Haiku, Paragraph Planet, the Drabble, Pink Plastic Houses, and forthcoming in The Tide Rises, The Tide Falls, Akitsu Quarterly, and the Asahi Shimbun. You can follow her at <a href=\"http://twitter.com/IpsaHerself\" rel=\"noopener noreferrer\" target=\"_blank\">@IpsaHerself</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca43",
    "id": "44503",
    "author": "ROBIN BISSETT",
    "title": "Second Chance",
    "url": "http://fiftywordstories.com/2020/10/22/robin-bissett-second-chance/",
    "storyHTML": "<p>This morning, the winter rain hammers away external stains.</p><p>Yesterday, after the incident, my friends walked me home, and we built a pillow fort. They currently lay beside me, asleep and dreaming. I snuggle under the covers, warm in their company, and wait for the delivery of a new day.</p>",
    "storyText": "This morning, the winter rain hammers away external stains. Yesterday, after the incident, my friends walked me home, and we built a pillow fort. They currently lay beside me, asleep and dreaming. I snuggle under the covers, warm in their company, and wait for the delivery of a new day.",
    "bio": "Robin Bissett is a Teaching Artist and Writer from Central Texas. She enjoys absorbing and sharing stories and strengthening her surrounding literary communities.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:38 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca42",
    "id": "44500",
    "author": "HAMED MANOUCHEHRI",
    "title": "Brief Third-Person Bio",
    "url": "http://fiftywordstories.com/2020/10/22/hamed-manouchehri-brief-third-person-bio/",
    "storyHTML": "<p>Hamed Manouchehri was the middle child for 18 years. He became the last child after his older brother avenged their father’s honor.</p><p>Mathematics.</p><p>“Do the math, sir,” lawyer said. “You can forgive your daughter’s blood, but the boy’s family wants compensation or retribution.”</p><p>Hamed’s mother is lost in this equation.</p>",
    "storyText": "Hamed Manouchehri was the middle child for 18 years. He became the last child after his older brother avenged their father's honor. Mathematics. \"Do the math, sir,\" lawyer said. \"You can forgive your daughter's blood, but the boy's family wants compensation or retribution.\" Hamed's mother is lost in this equation.",
    "bio": "Mohammad Hamed Manouchehri lives in a small town in Iran. He is a veterinarian and an award-winning photographer though his first love is reading and writing. Also, he is a two-time sharia law champion.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca41",
    "id": "44498",
    "author": "MIYA YAMANOUCHI",
    "title": "Behind Closed Smiles",
    "url": "http://fiftywordstories.com/2020/10/21/miya-yamanouchi-behind-closed-smiles/",
    "storyHTML": "<p>Barbecues were hardest.</p><p>“When are you two going to start a family?” they always asked.</p><p>“When the time is right,” she would reply, smiling.</p><p>“Don’t wait forever or it’ll be too late.”</p><p>She would nod politely, before returning home to an empty nursery and calendars red with a thousand crosses.</p>",
    "storyText": "Barbecues were hardest. \"When are you two going to start a family?\" they always asked. \"When the time is right,\" she would reply, smiling. \"Don't wait forever or it'll be too late.\" She would nod politely, before returning home to an empty nursery and calendars red with a thousand crosses.",
    "bio": "Miya Yamanouchi is a journalist in South Eastern Europe. Her poetry has been published in Poets and War and her fiction writing in Friday Flash Fiction.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca40",
    "id": "44496",
    "author": "DON NIGRONI",
    "title": "A Gruesome Problem",
    "url": "http://fiftywordstories.com/2020/10/21/don-nigroni-a-gruesome-problem/",
    "storyHTML": "<p>We were disoriented when some blue objects miraculously turned green and various green items inexplicably turned blue. We weren’t able to differentiate blue from bleen and green from grue before that happened so what else are we misinterpreting? We can only wait in trepidation for the next shoe to drop.</p>",
    "storyText": "We were disoriented when some blue objects miraculously turned green and various green items inexplicably turned blue. We weren't able to differentiate blue from bleen and green from grue before that happened so what else are we misinterpreting? We can only wait in trepidation for the next shoe to drop.",
    "bio": "Don Nigroni has a Bachelor’s Degree in Economics from Saint Joseph’s University and a Master’s Degree in Philosophy from Notre Dame and worked as an economist for the US Bureau of Labor Statistics.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca3f",
    "id": "44494",
    "author": "ANNE CATHERINE VASSALLO",
    "title": "A feather and a boy",
    "url": "http://fiftywordstories.com/2020/10/20/anne-catherine-vassallo-a-feather-and-a-boy/",
    "storyHTML": "<p>The shuddering wind<br>plays strange music,<br><span style=\"color: #ffffff;\">____</span>carrying away the feather<br><span style=\"color: #ffffff;\">________</span>fallen off that seagull.<br><span style=\"color: #ffffff;\">____________</span>Unaware<br>it glides<br><span style=\"color: #ffffff;\">____</span>following the currents<br><span style=\"color: #ffffff;\">________</span>like it drank too much wine.<br>A pale, gracile boy<br>picks up the feather<br>in its dance,<br>looks at it,<br>smiles<br>and puts it away in his box of treasures.</p>",
    "storyText": "The shuddering wind plays strange music, ____ carrying away the feather ________ fallen off that seagull. ____________ Unaware it glides ____ following the currents ________ like it drank too much wine. A pale, gracile boy picks up the feather in its dance, looks at it, smiles and puts it away in his box of treasures.",
    "bio": "Anne Catherine Vassallo was born in Malta but lives in Tuscany, Italy. As a child she dearly wanted to paint but seeing that her efforts were all in vain, decided to “paint with words”. She teaches English in a private language school and writes with a group of poetry-writing friends, all expats.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca3e",
    "id": "44492",
    "author": "BEATRICE RAO",
    "title": "Stories",
    "url": "http://fiftywordstories.com/2020/10/20/beatrice-rao-stories/",
    "storyHTML": "<p>“Can you see the baby elephant in the sky?”</p><p>“Here’s a wild horse galloping.”</p><p>Mum taught me to see stories everywhere.</p><p>In the clouds. In the waves of the sea. Chipped paint on the wall.</p><p>Wreath in hand, I stand outside church, straining to hear her say, Look up, girl.</p>",
    "storyText": "\"Can you see the baby elephant in the sky?\" \"Here's a wild horse galloping.\" Mum taught me to see stories everywhere. In the clouds. In the waves of the sea. Chipped paint on the wall. Wreath in hand, I stand outside church, straining to hear her say, Look up, girl.",
    "bio": "Beatrice Rao has just discovered flash fiction and is working on the art and the craft of it.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca3d",
    "id": "44486",
    "author": "MICHAEL B KEANE",
    "title": "Monsters",
    "url": "http://fiftywordstories.com/2020/10/19/michael-b-keane-monsters/",
    "storyHTML": "<p>Waves lap the shoreline. Palm trees rustle, muffling the snores of the men round the spit-roast, whose spices linger in the salt air. Logs flicker. The last captive looks out from his cage and prays.</p><p>Then clouds part, and the full moon’s light glides over him. He grins, fangs lengthening.</p>",
    "storyText": "Waves lap the shoreline. Palm trees rustle, muffling the snores of the men round the spit-roast, whose spices linger in the salt air. Logs flicker. The last captive looks out from his cage and prays. Then clouds part, and the full moon's light glides over him. He grins, fangs lengthening.",
    "bio": "Michael B. Keane is a London-based writer of dark fiction.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca3c",
    "id": "44481",
    "author": "LAURA BESLEY",
    "title": "Laughing on the Other Side of My Face",
    "url": "http://fiftywordstories.com/2020/10/19/laura-besley-laughing-on-the-other-side-of-my-face/",
    "storyHTML": "<p>“Marry me?”</p><p>“No,” I said, laughing. “It’s only our first date.”</p><p>Since then he’s proposed at home, on holiday, in castles, in parks, but I’ve always said no. It’s become an in-joke.</p><p>His note is propped on the mantelpiece. I don’t read it, finally realizing that the joke got old.</p>",
    "storyText": "\"Marry me?\" \"No,\" I said, laughing. \"It's only our first date.\" Since then he's proposed at home, on holiday, in castles, in parks, but I've always said no. It's become an in-joke. His note is propped on the mantelpiece. I don't read it, finally realizing that the joke got old.",
    "bio": "Laura Besley writes short fiction and squeezes her writing into the bookends of her day. She has lived in Holland, Germany, and Hong Kong, but now lives in land-locked central England and misses the sea. Her flash fiction collection, The Almost Mothers, was published in March 2020. She tweets at&nbsp;<a href=\"http://laurabesley/\" target=\"_blank\" rel=\"noopener noreferrer\">@laurabesley</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca3b",
    "id": "44483",
    "author": "LEONA ALONSO",
    "title": "Coffee Shop",
    "url": "http://fiftywordstories.com/2020/10/16/leona-alonso-coffee-shop/",
    "storyHTML": "<p>Rheigina walks into the familiar coffee shop, sitting across from the boy she’s known for years.</p><p>“I’m so sorry.”</p><p>Her smile dissolves as he wastes no time explaining. His face fractures into unrecognizable pieces. He is sobbing now, and so is she.</p><p>“But… you can’t,” she pleads.</p><p>“I love you.”</p>",
    "storyText": "Rheigina walks into the familiar coffee shop, sitting across from the boy she's known for years. \"I'm so sorry.\" Her smile dissolves as he wastes no time explaining. His face fractures into unrecognizable pieces. He is sobbing now, and so is she. \"But… you can't,\" she pleads. \"I love you.\"",
    "bio": "Leona Alonso is a high school sophomore from Texas who has a passion for STEM. However, in her free time she likes to play the viola, write, be with friends and family, as well as take long naps.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca3a",
    "id": "44471",
    "author": "DETTA ROSE",
    "title": "Metamorphosis",
    "url": "http://fiftywordstories.com/2020/10/15/detta-rose-metamorphosis/",
    "storyHTML": "<p>Slurping. Groaning. Mud in your eyes and mouth. Teeth aching.</p><p>Clambering onto the riverbank, you cough up a whole fish then a beetle.</p><p>Your reptile skin slithers off, glinting iridescent in the sunshine.</p><p>You shove and jostle into your human frame and shuffle on trembling legs towards the silver city.</p>",
    "storyText": "Slurping. Groaning. Mud in your eyes and mouth. Teeth aching. Clambering onto the riverbank, you cough up a whole fish then a beetle. Your reptile skin slithers off, glinting iridescent in the sunshine. You shove and jostle into your human frame and shuffle on trembling legs towards the silver city.",
    "bio": "Dettra Rose writes flash fiction and tiny poems.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca39",
    "id": "44469",
    "author": "JENNIFER L FREED",
    "title": "Clothesline",
    "url": "http://fiftywordstories.com/2020/10/15/jennifer-l-freed-clothesline/",
    "storyHTML": "<p>She knows the length of air<br>will stiffen towels, shirts, jeans,<br>but doesn’t care.</p><p>She likes watching, from the kitchen window,<br>how sunlight pushes shadow<br>along draping cloth.</p><p>Later, folding sheets against her chest,<br>she inhales. How do you name this? The balm<br>of this scent, fresh<br>off the line.</p>",
    "storyText": "She knows the length of air will stiffen towels, shirts, jeans, but doesn't care. She likes watching, from the kitchen window, how sunlight pushes shadow along draping cloth. Later, folding sheets against her chest, she inhales. How do you name this? The balm of this scent, fresh off the line.",
    "bio": "Jennifer L Freed mostly writes poems, which appear or are forthcoming in various journals and anthologies. Her website is <a href=\"http://jfreed.weebly.com\" rel=\"noopener noreferrer\" target=\"_blank\">jfreed.weebly.com</a>",
    "dateScraped": "Mon, 08 Mar 2021 12:02:47 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca38",
    "id": "44465",
    "author": "LISA MILLER",
    "title": "BlackLivesMatter",
    "url": "http://fiftywordstories.com/2020/10/14/lisa-miller-blacklivesmatter/",
    "storyHTML": "<p>Black brother bound, begging, barely breathing, betrayed by badged bullies. Bystanders being blind. Bureaucracy bubble bursts. Battle begins. Be bold, be boisterous, build bridges because BlackLivesMatter. Be better, break bread, bond but be beneficial. Begin by believing blacks’ burdens, brokenness, bitterness, baggage. Breathe, Buddy, breathe. Be blessed beyond belief. BlackLivesMatter.</p>",
    "storyText": "Black brother bound, begging, barely breathing, betrayed by badged bullies. Bystanders being blind. Bureaucracy bubble bursts. Battle begins. Be bold, be boisterous, build bridges because BlackLivesMatter. Be better, break bread, bond but be beneficial. Begin by believing blacks' burdens, brokenness, bitterness, baggage. Breathe, Buddy, breathe. Be blessed beyond belief. BlackLivesMatter.",
    "bio": "Lisa Miller loves living in Oregon, moving from Portland and out to the country recently. She loves her family but has had trouble writing since they moved in. She says it’s worth it, though, and her creativity is slowly creeping back.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca37",
    "id": "44463",
    "author": "MARY HAYNES",
    "title": "She Rises",
    "url": "http://fiftywordstories.com/2020/10/14/mary-haynes-she-rises/",
    "storyHTML": "<p>Lady Huron was in a mood.</p><p>Waves roared ashore, obliterating most of the beach. Ancient trees washed up, now driftwood with the haunted look of past lives.</p><p>Sand blasted Jenny’s skin and stung her eyes. Still, she searched in the frothy debris for sea glass, finding beauty in the chaos.</p>",
    "storyText": "Lady Huron was in a mood. Waves roared ashore, obliterating most of the beach. Ancient trees washed up, now driftwood with the haunted look of past lives. Sand blasted Jenny's skin and stung her eyes. Still, she searched in the frothy debris for sea glass, finding beauty in the chaos.",
    "bio": "Mary Haynes splits her time between a romantic old sailboat in tropical waters and a beach home on Lake Huron in Canada. A wanderer by fate, she embraces wherever she roams! Mary just published her first children’s book, “Who Ate My Peppers?”",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca36",
    "id": "44460",
    "author": "HARRY DEMAREST",
    "title": "Waking Up",
    "url": "http://fiftywordstories.com/2020/10/13/harry-demarest-waking-up/",
    "storyHTML": "<p>I wake up.<br>I don’t know where I am.<br>My house on Grant?<br>No, the retirement home.</p><p>I wake up.<br>I don’t know where I am.<br>Again.<br>I figure it out.<br>Again.</p><p>And then one day,<br>I wake up, and I don’t realize that I don’t know<br>where I am.</p>",
    "storyText": "I wake up. I don't know where I am. My house on Grant? No, the retirement home. I wake up. I don't know where I am. Again. I figure it out. Again. And then one day, I wake up, and I don't realize that I don't know where I am.",
    "bio": "Harry Demarest hopes to live long enough to end up in a  retirement home.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca35",
    "id": "44458",
    "author": "MATTHEW EICHENLAUB",
    "title": "Plangent",
    "url": "http://fiftywordstories.com/2020/10/13/matthew-eichenlaub-plangent/",
    "storyHTML": "<p>To discourage temptations to divide and sell,<br>to encourage harmony and family gatherings, Baba and Papa<br>left the lakehouse property to just one<br>of their many children.</p><p>Granddaughter Mara called from the lake.<br>Our beloved grass-barren badminton court<br>is now a wildflower garden.<br>Squeals and laughter silenced for a generation.</p>",
    "storyText": "To discourage temptations to divide and sell, to encourage harmony and family gatherings, Baba and Papa left the lakehouse property to just one of their many children. Granddaughter Mara called from the lake. Our beloved grass-barren badminton court is now a wildflower garden. Squeals and laughter silenced for a generation.",
    "bio": "When he finally started to listen, Matthew’s heart led him to Maine. Now, he lives and writes next to a lake, and sometimes Googles synonyms for the word “regret.”",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca34",
    "id": "44450",
    "author": "REBECCA RUVINSKY",
    "title": "Second Date",
    "url": "http://fiftywordstories.com/2020/10/12/rebecca-ruvinsky-second-date/",
    "storyHTML": "<p>The smoke alarm goes off seconds before the doorbell, but the oven can wait.</p><p>Smoke billows behind you while she beams before you. “I brought wi—oh, wow.”</p><p>You sigh at the blackened promise of ‘simple and easy’ romantic dinner, but she leans against you, as natural as breathing. “Pizza?”</p>",
    "storyText": "The smoke alarm goes off seconds before the doorbell, but the oven can wait. Smoke billows behind you while she beams before you. \"I brought wi - oh, wow.\" You sigh at the blackened promise of 'simple and easy' romantic dinner, but she leans against you, as natural as breathing. \"Pizza?\"",
    "bio": "Rebecca Ruvinsky is a student and emerging writer in Florida. Found at <a href=\"http://twitter.com/writeruvinsky\" rel=\"noopener noreferrer\" target=\"_blank\">@writeruvinsky</a>, she has work forthcoming in Underland Arcana and Prospectus. In her free time, she writes daily poems and goes to rocket launches.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca33",
    "id": "44448",
    "author": "EDDIE D MOORE",
    "title": "You Have Arrived",
    "url": "http://fiftywordstories.com/2020/10/12/eddie-d-moore-you-have-arrived/",
    "storyHTML": "<p>When the GPS said that I had arrived at my destination, I found myself parked in front of an abandoned country church on a dead end, gravel road. Most of the paint had long peeled away, and the graveyard beside it was full.</p><p>I wondered who buried the last member.</p>",
    "storyText": "When the GPS said that I had arrived at my destination, I found myself parked in front of an abandoned country church on a dead end, gravel road. Most of the paint had long peeled away, and the graveyard beside it was full. I wondered who buried the last member.",
    "bio": "Eddie D. Moore travels hundreds of hours a year, and he fills that time by listening to audiobooks. When he isn’t playing with his grandchildren, he writes his own stories. You can find a list of his publications on his blog, <a href=\"http://eddiedmoore.wordpress.com\" rel=\"noopener noreferrer\" target=\"_blank\">eddiedmoore.wordpress.com</a>, or by visiting his <a href=\"http://amazon.com/author/eddiedmoore\" rel=\"noopener noreferrer\" target=\"_blank\">Amazon Author Page</a>. While you’re there, be sure to pick up a copy of his mini-anthology Misfits &amp; Oddities.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca32",
    "id": "44444",
    "author": "LL WOHLWEND",
    "title": "Two-Note Song",
    "url": "http://fiftywordstories.com/2020/10/09/ll-wohlwend-two-note-song/",
    "storyHTML": "<p>Momma hasn’t come home.</p><p>I ask Grandma, When? She says, Any day now.</p><p>But Momma sent a text I wasn’t supposed to see. <em>Need break. It’s all too much.</em></p><p>The sun cuts the leaves into drops of time. I spin in the driveway, singing:</p><p>Any day any day any day.</p>",
    "storyText": "Momma hasn't come home. I ask Grandma, When? She says, Any day now. But Momma sent a text I wasn't supposed to see. Need break. It's all too much. The sun cuts the leaves into drops of time. I spin in the driveway, singing: Any day any day any day.",
    "bio": "L.L. Wohlwend’s work has appeared in Haibun Today, Contemporary Haibun Online, Modern Haiku, and other places.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca31",
    "id": "44442",
    "author": "MARY HICKEY",
    "title": "As Night Slowly Falls",
    "url": "http://fiftywordstories.com/2020/10/09/mary-hickey-as-night-slowly-falls/",
    "storyHTML": "<p>“Why do you bleat like a goat?” I ask. “Do those sounds comfort you?”</p><p>“Yes, I believe they do,” he responds.</p><p>A month later, once again, “Why?”</p><p>“They help me to focus and think.”</p><p>Three more months, and he barely understands the question.</p><p>“They remind me that I’m still alive.”</p>",
    "storyText": "\"Why do you bleat like a goat?\" I ask. \"Do those sounds comfort you?\" \"Yes, I believe they do,\" he responds. A month later, once again, \"Why?\" \"They help me to focus and think.\" Three more months, and he barely understands the question. \"They remind me that I'm still alive.\"",
    "bio": "Mary Hickey is an internationally known backgammon champion, teacher, coach and author. Her literary fiction has appeared in The Griffin, Happy, Kalliope, and other publications. She takes a break from writing if sushi, mattar paneer, or really good coffee are on offer.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca30",
    "id": "44435",
    "author": "BRIAN MAYCOCK",
    "title": "Staying Put",
    "url": "http://fiftywordstories.com/2020/10/08/brian-maycock-staying-put/",
    "storyHTML": "<p>The roofs appear first, small grey peaks breaking through the water as the drought slowly reveals the village last seen seventy years ago.</p><p>After the forced clearance of the villagers, the valley was flooded, the reservoir built.</p><p>We descend, excited explorers discovering cobbled roads, abandoned cottages. A shotgun. Bleached bones.</p>",
    "storyText": "The roofs appear first, small grey peaks breaking through the water as the drought slowly reveals the village last seen seventy years ago. After the forced clearance of the villagers, the valley was flooded, the reservoir built. We descend, excited explorers discovering cobbled roads, abandoned cottages. A shotgun. Bleached bones.",
    "bio": "Brian Maycock lives in Scotland. His short stories have most recently been published in The Drabble and 365 tomorrows.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca2f",
    "id": "44433",
    "author": "LISA MARIE LOPEZ",
    "title": "Every Tuesday",
    "url": "http://fiftywordstories.com/2020/10/08/lisa-marie-lopez-every-tuesday/",
    "storyHTML": "<p>Tangy salsa over fried eggs. Buttered toast, sliced in half and glazed with apricot jam. She hasn’t opened a menu in over ten years. Everybody at the corner diner on Hamilton Street knows to call her Suz, and never to ask why certain songs from the jukebox make her cry.</p>",
    "storyText": "Tangy salsa over fried eggs. Buttered toast, sliced in half and glazed with apricot jam. She hasn't opened a menu in over ten years. Everybody at the corner diner on Hamilton Street knows to call her Suz, and never to ask why certain songs from the jukebox make her cry.",
    "bio": "Lisa Marie Lopez has had stories recently published in Blink-Ink and The Ocotillo Review. She loves baseball, turtles, and writing in cozy little cafes. Visit her on Facebook at <a href=\"https://www.facebook.com/authorlisamariefiction/\" target=\"_blank\" rel=\"noopener noreferrer\">Author Lisa Marie Lopez</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:02:56 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca2e",
    "id": "44431",
    "author": "JAMES MENGES",
    "title": "The New Dear Leader",
    "url": "http://fiftywordstories.com/2020/10/07/james-menges-the-new-dear-leader/",
    "storyHTML": "<p>A top propagandist and Politburo member in the party, the younger sister now controls the Guidance and Organization Department, aka G.O.D., the body administering ideological indoctrination, party organization and political appointments.</p><p>Through edicts issued by G.O.D., a woman has unprecedented control of the future.</p><p>At last, there’s hope for mankind.</p>",
    "storyText": "A top propagandist and Politburo member in the party, the younger sister now controls the Guidance and Organization Department, aka G.O.D., the body administering ideological indoctrination, party organization and political appointments. Through edicts issued by G.O.D., a woman has unprecedented control of the future. At last, there's hope for mankind.",
    "bio": "James Menges is a writer and photographer. He is a member of the Dramatists Guild of America.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca2d",
    "id": "44429",
    "author": "JOE GIORDANO",
    "title": "Cornelia Quinta",
    "url": "http://fiftywordstories.com/2020/10/07/joe-giordano-cornelia-quinta/",
    "storyHTML": "<p>While I’m stooped and wrinkled, my body savaged by plague and illnesses, reduced to just a brittle twig, know that once I dominated Roman society. Senators were drawn to me like hummingbirds to nectar, my grace and beauty halted conversations, and when I regain strength, my lash will fly again.</p>",
    "storyText": "While I'm stooped and wrinkled, my body savaged by plague and illnesses, reduced to just a brittle twig, know that once I dominated Roman society. Senators were drawn to me like hummingbirds to nectar, my grace and beauty halted conversations, and when I regain strength, my lash will fly again.",
    "bio": "Joe Giordano was born in Brooklyn. He and his wife Jane now live in Texas. Joe’s stories have appeared in more than 100 magazines including The Saturday Evening Post, and Shenandoah. His novels, Birds of Passage, An Italian Immigrant Coming of Age Story (2015), and Appointment with ISIL, an Anthony Provati Thriller (2017) were published by Harvard Square Editions. Rogue Phoenix Press published Drone Strike (2019) and his short story collection, Stories and Places I Remember (2020). Joe was among 100 Italian American authors honored by Barnes &amp; Noble to march in Manhattan’s 2017 Columbus Day Parade. Read the first chapter of Joe’s novels and sign up for his blog at <a href=\"http://joe-giordano.com/\" rel=\"noopener noreferrer\" target=\"_blank\">joe-giordano.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca2c",
    "id": "44424",
    "author": "PAUL LAMAR",
    "title": "Doppelganger: for Joe (1955-1995)",
    "url": "http://fiftywordstories.com/2020/10/06/paul-lamar-doppelganger-for-joe-1955-1995/",
    "storyHTML": "<p>Seen on the running trail: tall, beefy <em>(beloved you, at the end, emaciated)</em>. Black hair under cap <em>(you, at the end, bald)</em>. Muscular legs <em>(you, at the end, wheelchair-bound)</em>. Blue eyes <em>(you, at the end, blind)</em>. Trim beard <em>(you, at the end, blotches</em>). Gentle breathing <em>(you, at the end, gasping)</em>.</p>",
    "storyText": "Seen on the running trail: tall, beefy (beloved you, at the end, emaciated). Black hair under cap (you, at the end, bald). Muscular legs (you, at the end, wheelchair-bound). Blue eyes (you, at the end, blind). Trim beard (you, at the end, blotches). Gentle breathing (you, at the end, gasping).",
    "bio": "Over 45 years, Paul Lamar’s poems and stories have appeared in The Southern Review, Prairie Schooner, Steam Ticket, Bryant Literary Review, etc.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca2b",
    "id": "44422",
    "author": "ESZTER MOLNAR",
    "title": "Cold Turkey in November",
    "url": "http://fiftywordstories.com/2020/10/06/eszter-molnar-cold-turkey-in-november/",
    "storyHTML": "<p>It hasn’t stopped raining for four long days.</p><p>Carl’s eyes are red-rimmed, his face a bloated mess.</p><p>“I can’t do this much longer,” he cries.</p><p>“You’re doing great,” I assure him but right now—and I’m not ashamed to admit this—I hate him. We’ve been here before. Seven times.</p>",
    "storyText": "It hasn't stopped raining for four long days. Carl's eyes are red-rimmed, his face a bloated mess. \"I can't do this much longer,\" he cries. \"You're doing great,\" I assure him but right now - and I'm not ashamed to admit this - I hate him. We've been here before. Seven times.",
    "bio": "Eszter Molnar is a former teacher who lives by the windswept British seaside with her partner and two children. She has been published in one of the UK’s biggest subscription magazines for children. By day she cleans up after preschoolers. By night she writes picture books and middle grade fiction.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca2a",
    "id": "44415",
    "author": "BEN MIMMACK",
    "title": "Love is the Most Important Thing in the World, but Baseball is Pretty Good too",
    "url": "http://fiftywordstories.com/2020/10/05/ben-mimmack-love-is-the-most-important-thing-in-the-world-but-baseball-is-pretty-good-too/",
    "storyHTML": "<p>When I was a boy, my grandpa threw baseballs to me. Later, I threw baseballs to my granddaughter. I can’t throw baseballs anymore, but she still puts one in my hand when she visits. I like the feel of it. It makes me wish I’d done it for my grandpa.</p>",
    "storyText": "When I was a boy, my grandpa threw baseballs to me. Later, I threw baseballs to my granddaughter. I can't throw baseballs anymore, but she still puts one in my hand when she visits. I like the feel of it. It makes me wish I'd done it for my grandpa.",
    "bio": "Ben lives in Dallas where he is viewed with tolerant amusement by his wife and two small boys. He likes writing micro-fiction because people he knows are more likely to read it.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca29",
    "id": "44413",
    "author": "CMF WRIGHT",
    "title": "Fake Bones and Stepping Stones",
    "url": "http://fiftywordstories.com/2020/10/05/cmf-wright-fake-bones-and-stepping-stones/",
    "storyHTML": "<p>She cut herself falling off her bike. Instead of blood, wires spilled out.</p><p>She wondered if her childhood was a lie, fake memories coded into her psyche. If her parents were androids too.</p><p>The last one was easy to test.</p><p>She taped a metal detector to the doorway and waited.</p>",
    "storyText": "She cut herself falling off her bike. Instead of blood, wires spilled out. She wondered if her childhood was a lie, fake memories coded into her psyche. If her parents were androids too. The last one was easy to test. She taped a metal detector to the doorway and waited.",
    "bio": "C.M.F. Wright (<a href=\"http://twitter.com/cmf_wright\" target=\"_blank\" rel=\"noopener noreferrer\">@cmf_wright</a>) is an avid fantasy reader and sentence wrangler. Her short stories have appeared in&nbsp;<i>Fifty&nbsp;</i><i>Word Stories</i>,&nbsp;<i>Syntax &amp; Salt Magazine</i>&nbsp;and the&nbsp;<i>VSS365 Anthology</i>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca28",
    "id": "44400",
    "author": "YASH SEYEDBAGHERI",
    "title": "Mourning Mama",
    "url": "http://fiftywordstories.com/2020/10/02/yash-seyedbagheri-mourning-mama/",
    "storyHTML": "<p>Mom wears a tight smile now.</p><p>But give me Mama and fairy tales about overthrowing rich kings.<br>Mama, an open curtain, waltzing under moonlight after fights with Dad.<br>Mama, drowning fatherly fusillades with dirty jokes.<br>Not Mom who draws curtains, slinks through bills and empty rooms.</p><p>Mama.<br>A cracked word.</p>",
    "storyText": "Mom wears a tight smile now. But give me Mama and fairy tales about overthrowing rich kings. Mama, an open curtain, waltzing under moonlight after fights with Dad. Mama, drowning fatherly fusillades with dirty jokes. Not Mom who draws curtains, slinks through bills and empty rooms. Mama. A cracked word.",
    "bio": "Yash Seyedbagheri is a graduate of Colorado State University’s MFA program in fiction. His story, “Soon,” was nominated for a Pushcart. Yash’s work is forthcoming or has been published in WestWard Quarterly, Café Lit, and Ariel Chart, among others.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca27",
    "id": "44398",
    "author": "ANGELA CARLTON",
    "title": "Quiet Rooms",
    "url": "http://fiftywordstories.com/2020/10/02/angela-carlton-quiet-rooms/",
    "storyHTML": "<p>Sissy’s behind gray walls, the day of competition. Singing occasionally with radios in quiet rooms, I find some courage. As poison takes over her brain, doctors with false hope insert silver needles.</p><p>But I sing, dizzy, from worn out bones, my only sister, broken.</p><p>Behind velvet curtains, I let go.</p>",
    "storyText": "Sissy's behind gray walls, the day of competition. Singing occasionally with radios in quiet rooms, I find some courage. As poison takes over her brain, doctors with false hope insert silver needles. But I sing, dizzy, from worn out bones, my only sister, broken. Behind velvet curtains, I let go.",
    "bio": "Angela Carlton lives outside Atlanta with her husband and two daughters. Her fiction has been published in EWR, Every Day Fiction, Pedestal Magazine, Long Story Short, 6S, High Noon and Friday Flash Fiction among others.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca26",
    "id": "44388",
    "author": "JULIET WILSON",
    "title": "Lockdown Blues",
    "url": "http://fiftywordstories.com/2020/10/01/juliet-wilson-lockdown-blues/",
    "storyHTML": "<p>We’ve got the Lockdown Blues. Every day feels the same. Nothing but coronavirus on the news. No work, no school, no social life. No leaving home except for rushed, masked trips to the supermarket. No church, but endless prayers that don’t wait for Sundays. Vague memories of a different life.</p>",
    "storyText": "We've got the Lockdown Blues. Every day feels the same. Nothing but coronavirus on the news. No work, no school, no social life. No leaving home except for rushed, masked trips to the supermarket. No church, but endless prayers that don't wait for Sundays. Vague memories of a different life.",
    "bio": "Juliet is an adult education tutor, crafter, and conservation volunteer based in Edinburgh, UK. She blogs at <a href=\"http://craftygreenpoet.blogspot.com\" rel=\"noopener noreferrer\" target=\"_blank\">craftygreenpoet.blogspot.com</a> and tweets at <a href=\"http://twitter.com/craftygeenpoet\" rel=\"noopener noreferrer\" target=\"_blank\">@craftygeenpoet</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca25",
    "id": "44386",
    "author": "PIPPA PHILLIPS",
    "title": "The Price",
    "url": "http://fiftywordstories.com/2020/10/01/pippa-phillips-the-price/",
    "storyHTML": "<p>Is it the moon or sun bookended by the trees on either side of the road? The fiddler’s been walking so long he’s lost track of night and day. Dusk or twilight, the orb marks the crossroads, and he promised to play the devil a tune a long time ago.</p>",
    "storyText": "Is it the moon or sun bookended by the trees on either side of the road? The fiddler's been walking so long he's lost track of night and day. Dusk or twilight, the orb marks the crossroads, and he promised to play the devil a tune a long time ago.",
    "bio": "Pippa Phillips wrote this story.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:05 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca24",
    "id": "44382",
    "author": "JANE BROWN",
    "title": "Life on the Land",
    "url": "http://fiftywordstories.com/2020/09/30/jane-brown-life-on-the-land/",
    "storyHTML": "<p>“Daddy, can you hear the ocean?”</p><p>I put the conch to my ear.</p><p>A gift sent from her new home, miles from this dusty dirt pit her mother couldn’t wait to escape.</p><p>The video cuts out. Again. Bad connection.</p><p>I keep the shell pressed to my ear until night falls.</p>",
    "storyText": "\"Daddy, can you hear the ocean?\" I put the conch to my ear. A gift sent from her new home, miles from this dusty dirt pit her mother couldn't wait to escape. The video cuts out. Again. Bad connection. I keep the shell pressed to my ear until night falls.",
    "bio": "Jane Brown is a web programmer and short fiction writer who lives by the beach in Australia.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca23",
    "id": "44379",
    "author": "MARIA CARGILLE",
    "title": "Constants",
    "url": "http://fiftywordstories.com/2020/09/30/maria-cargille-constants/",
    "storyHTML": "<p>He sits before the door expectantly, tail swishing. The door doesn’t open, will never open. Inside is off limits.</p><p>I sigh, empathy swirling through me. “Come on, bud,” I mutter, lifting my protesting cat up and away.</p><p>He’s not the only one to obsess over what he can’t have.</p>",
    "storyText": "He sits before the door expectantly, tail swishing. The door doesn't open, will never open. Inside is off limits. I sigh, empathy swirling through me. \"Come on, bud,\" I mutter, lifting my protesting cat up and away. He's not the only one to obsess over what he can't have.",
    "bio": "Maria is fascinated by the similarities of emotion across species, time, and place. She misses her cats a lot.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca22",
    "id": "44377",
    "author": "REB ELKIN",
    "title": "Piano",
    "url": "http://fiftywordstories.com/2020/09/29/reb-elkin-piano/",
    "storyHTML": "<p>The sound of the piano playing always keeps her awake at night, especially now that she is alone in the house. She steps quickly down the stairs, but by the time she gets there the music has stopped. Gently, she brushes her fingers over the keys and closes the lid.</p>",
    "storyText": "The sound of the piano playing always keeps her awake at night, especially now that she is alone in the house. She steps quickly down the stairs, but by the time she gets there the music has stopped. Gently, she brushes her fingers over the keys and closes the lid.",
    "bio": "Reb Elkin writes science fiction and fantasy. She has no plans to buy a piano.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca21",
    "id": "44375",
    "author": "LAURA BESLEY",
    "title": "Today is Your Best Day",
    "url": "http://fiftywordstories.com/2020/09/29/laura-besley-today-is-your-best-day/",
    "storyHTML": "<p>Three days after my mother died, I started clearing out her bedroom. I needed to sleep in there; the sofa was making my sciatica flare up.</p><p>Under the bed I found various expensive candles I’d bought her, in a box marked: FOR BEST.</p><p>I burned them all at her funeral.</p>",
    "storyText": "Three days after my mother died, I started clearing out her bedroom. I needed to sleep in there; the sofa was making my sciatica flare up. Under the bed I found various expensive candles I'd bought her, in a box marked: FOR BEST. I burned them all at her funeral.",
    "bio": "Laura Besley writes short fiction and squeezes her writing into the bookends of her day. She has lived in Holland, Germany, and Hong Kong, but now lives in land-locked central England and misses the sea. Her flash fiction collection, The Almost Mothers, was published in March 2020. She tweets at <a href=\"http://laurabesley\" rel=\"noopener noreferrer\" target=\"_blank\">@laurabesley</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca20",
    "id": "44369",
    "author": "KIT WERTZ",
    "title": "Bass Lines",
    "url": "http://fiftywordstories.com/2020/09/28/kit-wertz-bass-lines/",
    "storyHTML": "<p>Her sweet gaze froze me, yet thawed my soul<br>Like a microwave-refrigerator, if that we’re such a thing<br>But we both play bass</p><p>Monotonous bliss<br>Repetitive rhythm<br>We both play bass</p><p>Two strings, tethered in parallel<br>Destined never to cross<br>Because we both play bass<br>We could never band together</p>",
    "storyText": "Her sweet gaze froze me, yet thawed my soul Like a microwave-refrigerator, if that we're such a thing But we both play bass Monotonous bliss Repetitive rhythm We both play bass Two strings, tethered in parallel Destined never to cross Because we both play bass We could never band together",
    "bio": "Kit is an ad student from Florida, and he loves a good story. He’s just a zany kid who has a lot of inspiration and is looking for something to do with it.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca1f",
    "id": "44367",
    "author": "WARREN CLYDE",
    "title": "Tombstone",
    "url": "http://fiftywordstories.com/2020/09/28/warren-clyde-tombstone/",
    "storyHTML": "<p>I can notch no more on my Colt, yet one still eludes me.</p><p>Through rain and snow and rugged terrain, I’ve finally hunted him down.</p><p>Outside a bar, in Tombstone, I called him out to end it.</p><p>The last notch was etched on my wife’s and two daughters’ headstones.</p>",
    "storyText": "I can notch no more on my Colt, yet one still eludes me. Through rain and snow and rugged terrain, I've finally hunted him down. Outside a bar, in Tombstone, I called him out to end it. The last notch was etched on my wife's and two daughters' headstones.",
    "bio": "Warren Clyde wrote this story.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca1e",
    "id": "44363",
    "author": "LE ANNE WELDER",
    "title": "Swept Away in a Sea of Gray",
    "url": "http://fiftywordstories.com/2020/09/25/le-anne-welder-swept-away-in-a-sea-of-gray/",
    "storyHTML": "<p>Year: 1935. Two young brothers play games on the sunny, manicured expanse that runs along the edge of the bluff. Beyond, the sea sparkles. A soft summer breeze floats by, lifting their downy hair. Only this moment, this slice of time, separates them from the impending horror of Hitler’s world.</p>",
    "storyText": "Year: 1935. Two young brothers play games on the sunny, manicured expanse that runs along the edge of the bluff. Beyond, the sea sparkles. A soft summer breeze floats by, lifting their downy hair. Only this moment, this slice of time, separates them from the impending horror of Hitler's world.",
    "bio": "Le Anne uprooted from her native state of Texas to enjoy the cooler weather of the east coast where she enjoys book and writing groups.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca1d",
    "id": "44361",
    "author": "SHAWN D BRINK",
    "title": "Sugar Rush",
    "url": "http://fiftywordstories.com/2020/09/25/shawn-d-brink-sugar-rush/",
    "storyHTML": "<p>They stopped legally selling candy cigarettes because it encouraged smoking in minors. The problem was, I was already going through two packs a day. Now I meet shady kids on the playground who sell them at a premium from inside their overcoats.</p><p>I wish I’d never chewed that first stick.</p>",
    "storyText": "They stopped legally selling candy cigarettes because it encouraged smoking in minors. The problem was, I was already going through two packs a day. Now I meet shady kids on the playground who sell them at a premium from inside their overcoats. I wish I'd never chewed that first stick.",
    "bio": "Shawn D. Brink has four novels and many shorter works to his name. For more, please visit <a href=\"https://shawnbrinkauthor.wordpress.com/\" rel=\"noopener noreferrer\" target=\"_blank\">shawnbrinkauthor.wordpress.com</a>. Shawn is represented by Liverman Literary Agency and lives in Nebraska, USA.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca1c",
    "id": "44359",
    "author": "SARAH HAUSMAN",
    "title": "Complacency",
    "url": "http://fiftywordstories.com/2020/09/24/sarah-hausman-complacency/",
    "storyHTML": "<p>Grandma says I’m underreacting.</p><p>She says back in her day things weren’t so bad. She says I really don’t know just how bad I have it. She says kids today are too lazy—they don’t fight for change like they used to.</p><p>I open the curtains and close them again.</p>",
    "storyText": "Grandma says I'm underreacting. She says back in her day things weren't so bad. She says I really don't know just how bad I have it. She says kids today are too lazy - they don't fight for change like they used to. I open the curtains and close them again.",
    "bio": "Sarah Hausman just decided it was time to write again.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca1b",
    "id": "44357",
    "author": "SARINA NORTHWAY",
    "title": "Weighing the Cost",
    "url": "http://fiftywordstories.com/2020/09/24/sarina-northway-weighing-the-cost/",
    "storyHTML": "<p>Nothing says desperation like an American college student digging through their wallet. I know that’s what the cashier is thinking while watching me frantically search for my card.</p><p>She’s not wrong; though I just paid my $25k tuition, the $10 price of bacon seems a little too steep for me.</p>",
    "storyText": "Nothing says desperation like an American college student digging through their wallet. I know that's what the cashier is thinking while watching me frantically search for my card. She's not wrong; though I just paid my $25k tuition, the $10 price of bacon seems a little too steep for me.",
    "bio": "Sarina Northway is an English and psychology double major at the University of South Carolina. Though not very experienced, she is working on her first traditionally published novel, Dead Girl Walking.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:13 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca1a",
    "id": "44355",
    "author": "NORBERT KOVACS",
    "title": "Mountain",
    "url": "http://fiftywordstories.com/2020/09/23/norbert-kovacs-mountain/",
    "storyHTML": "<p>We hike to a great height and camp. At daybreak, we find the summit overhead has risen steeply since we started.</p><p><em>Will this continue if we go on?</em> we wonder.</p><p>However, the summit shines beside a sky deep and blue. <em>Let it grow,</em> we think, and set out towards it.</p>",
    "storyText": "We hike to a great height and camp. At daybreak, we find the summit overhead has risen steeply since we started. Will this continue if we go on? we wonder. However, the summit shines beside a sky deep and blue. Let it grow, we think, and set out towards it.",
    "bio": "Norbert Kovacs lives and writes in Hartford, Connecticut. He has published stories in <em>Westview</em>, <em>Thin Air</em>, <em>Headway</em>, <em>Corvus Review</em>, and <em>The Write Launch</em>. See more at <a href=\"http://norbertkovacs.net\" rel=\"noopener noreferrer\" target=\"_blank\">norbertkovacs.net</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca19",
    "id": "44353",
    "author": "SARAH SAMSON",
    "title": "Clostridium tetani",
    "url": "http://fiftywordstories.com/2020/09/23/sarah-samson-clostridium-tetani/",
    "storyHTML": "<p>I know the future. You imagine yourself on your motorcycle with your scarf fluttering behind, a middle finger to the naysayers who believe the doctors.</p><p>But I know the future. You decided to repair that wooden chest with the rusty nails. You weren’t careful. One scratch and I was in.</p>",
    "storyText": "I know the future. You imagine yourself on your motorcycle with your scarf fluttering behind, a middle finger to the naysayers who believe the doctors. But I know the future. You decided to repair that wooden chest with the rusty nails. You weren't careful. One scratch and I was in.",
    "bio": "Sarah Samson is a consultant, writer and corporate responsibility professional living in Portland, Oregon.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca18",
    "id": "44351",
    "author": "LYDIA CHAPMAN",
    "title": "Autumn’s Arrival",
    "url": "http://fiftywordstories.com/2020/09/22/lydia-chapman-autumns-arrival/",
    "storyHTML": "<p>Upon nearing Autumn’s arrival,<br>I see Nature’s last hoorah of vivacious manifestation,<br>A proclamation of her time in youthful fervor<br>the bassoon’s bellowing croak<br>amidst a once booming symphony<br>now all coming to a diminuendo in variance<br>Like the savory peck of a spry elder<br>Even still, muffled by prospect.</p>",
    "storyText": "Upon nearing Autumn's arrival, I see Nature's last hoorah of vivacious manifestation, A proclamation of her time in youthful fervor the bassoon's bellowing croak amidst a once booming symphony now all coming to a diminuendo in variance Like the savory peck of a spry elder Even still, muffled by prospect.",
    "bio": "Lydia is an emerging writer from the Midwest who enjoys long nature walks",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca17",
    "id": "44349",
    "author": "SUSAN GALE WICKES",
    "title": "Fore and Aft",
    "url": "http://fiftywordstories.com/2020/09/22/susan-gale-wickes-fore-and-aft/",
    "storyHTML": "<p>Every morning, he sets out in his tiny fishing boat.</p><p>No particular destination… Just water, sun, freedom, and an occasional breeze.</p><p>One by one, the big, luxury boats leave him tossing in their wake.</p><p>He used to dream of owning a yacht. Now, he just prays for one more sunrise.</p>",
    "storyText": "Every morning, he sets out in his tiny fishing boat. No particular destination… Just water, sun, freedom, and an occasional breeze. One by one, the big, luxury boats leave him tossing in their wake. He used to dream of owning a yacht. Now, he just prays for one more sunrise.",
    "bio": "Susan Gale Wickes is from Indiana. She enjoys writing short stories and watching the sun rise.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca16",
    "id": "44346",
    "author": "LISA CHAMBERS",
    "title": "Game On",
    "url": "http://fiftywordstories.com/2020/09/21/lisa-chambers-game-on/",
    "storyHTML": "<p>When the game comes on, my friends know not to call.</p><p>I love cheering on the players and yelling at the TV. All part of the fan experience; a true American institution.</p><p>Throw in some snacks and I’m set.</p><p>It all kicks off with three simple words.</p><p><em>This… is… Jeopardy!</em></p>",
    "storyText": "When the game comes on, my friends know not to call. I love cheering on the players and yelling at the TV. All part of the fan experience; a true American institution. Throw in some snacks and I'm set. It all kicks off with three simple words. This… is… Jeopardy!",
    "bio": "Lisa Chambers is a Texas girl who enjoys writing (and watching Jeopardy).",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca15",
    "id": "44343",
    "author": "BS ROBERTS",
    "title": "Morning Air",
    "url": "http://fiftywordstories.com/2020/09/21/bs-roberts-morning-air/",
    "storyHTML": "<p>I can’t tell where land falls into water, nor where the lake bleeds into the sky. Between gentle laps of waves, a black blemish appears – a boat drifting in still water. A lone man stares.</p><p>Hesitant, I call, “Hello?”</p><p>No response.</p><p>The fog shrouds him as though he’d never been.</p>",
    "storyText": "I can't tell where land falls into water, nor where the lake bleeds into the sky. Between gentle laps of waves, a black blemish appears – a boat drifting in still water. A lone man stares. Hesitant, I call, \"Hello?\" No response. The fog shrouds him as though he'd never been.",
    "bio": "When not indulging himself by reading or writing poetry and prose, B.S. Roberts makes a living as a museum curator and an administrative assistant at the University of Maine at Augusta. He lives in Maine with his fiancée, daughter, silver pheasants, turtle, and four cats.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca14",
    "id": "44336",
    "author": "THAD DeVASSIE",
    "title": "Things Left Unsaid",
    "url": "http://fiftywordstories.com/2020/09/18/thad-devassie-things-left-unsaid/",
    "storyHTML": "<p>They have been painstakingly cataloged, each with date stamps remembered vividly, ready to roll up on your shores like muscle memory, like grudge-holding tides that never forget. When you’re willing to let it go—all of it—to make amends, to say your goodbyes, let it not be too late.</p>",
    "storyText": "They have been painstakingly cataloged, each with date stamps remembered vividly, ready to roll up on your shores like muscle memory, like grudge-holding tides that never forget. When you're willing to let it go - all of it - to make amends, to say your goodbyes, let it not be too late.",
    "bio": "Thad DeVassie is a lifelong Ohioan who writes and paints from the outskirts of Columbus. His recent work has appeared in Unbroken, Spelk, Lunate, and Ghost City Review, among others. He is a winner of the 2020&nbsp;James Tate International Poetry Prize for his manuscript SPLENDID IRRATIONALITIES.&nbsp;His chapbook, THIS SIDE OF UTOPIA, will arrive in 2021 from Cervena Barva Press.&nbsp;Find more of his work <a href=\"http://twitter.com/thaddevassie\" target=\"_blank\" rel=\"noopener noreferrer\">@thaddevassie</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca13",
    "id": "44334",
    "author": "CAROLYN R RUSSELL",
    "title": "Released",
    "url": "http://fiftywordstories.com/2020/09/18/carolyn-r-russell-released/",
    "storyHTML": "<p>The bullet misses her face; it deflects off the bullhorn she holds to her lips. Despite the hole in her lungs, she continues to chant as many hands lift her up and over the crowd. Then she is free, released now, at last, to be the eye, not the storm.</p>",
    "storyText": "The bullet misses her face; it deflects off the bullhorn she holds to her lips. Despite the hole in her lungs, she continues to chant as many hands lift her up and over the crowd. Then she is free, released now, at last, to be the eye, not the storm.",
    "bio": "Carolyn R. Russell is the author of “The Films of Joel and Ethan Coen,” published by McFarland &amp; Company in 2001. Her humorous YA mystery, “Same As It Never Was,” was released in 2018 by Big Table. Carolyn’s new YA dystopian thriller, “In the Fullness of Time,” was published by Vine Leaves Press in March of 2020. Her essays and stories include pieces for The Boston Globe, Dime Show Review, Bridge Eight, Wanderlust Journal, and Flash Fiction Magazine. She holds an M.A. in Film Studies from Chapman University, and has taught on the college, high school, and middle school levels. Carolyn lives north of Boston with her husband and two children.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca12",
    "id": "44331",
    "author": "ROBERT MARKOVICH",
    "title": "The Boy In The Box",
    "url": "http://fiftywordstories.com/2020/09/17/robert-markovich-the-boy-in-the-box/",
    "storyHTML": "<p>Can boogeymen and fluffernutters, scraped knees and coloring books, times tables and video games, homework assignments and roller coasters, algebra problems and iPhones, fumbled kisses and glimmers of the man to be matter if they all lead to a momentary miscalculation of speed and distance on a bicycle at night?</p>",
    "storyText": "Can boogeymen and fluffernutters, scraped knees and coloring books, times tables and video games, homework assignments and roller coasters, algebra problems and iPhones, fumbled kisses and glimmers of the man to be matter if they all lead to a momentary miscalculation of speed and distance on a bicycle at night?",
    "bio": "Robert Markovich spent a lifetime in what is charitably referred to as service journalism, writing and editing stories about everything from cars to toilets, most recently at Consumer Reports. He is happily and gratefully retired.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca11",
    "id": "44329",
    "author": "JOSHUA ADDISON",
    "title": "Triumph",
    "url": "http://fiftywordstories.com/2020/09/17/joshua-addison-triumph/",
    "storyHTML": "<p>The throngs of people erupt as the parade enters the city, my chariot at the head outshining Helios himself. The crowd cheers hysterically as I smile and turn my laureled head in recognition.</p><p>My euphoria is interrupted by a soft whisper,</p><p><em>Caesar, you are but a man…</em></p><p>Hmph, not today.</p>",
    "storyText": "The throngs of people erupt as the parade enters the city, my chariot at the head outshining Helios himself. The crowd cheers hysterically as I smile and turn my laureled head in recognition. My euphoria is interrupted by a soft whisper, Caesar, you are but a man… Hmph, not today.",
    "bio": "Joshua loves historical fiction and thought it might be interesting in a microfiction format, perfect for those tiny, nuanced moments in history that are never conveyed in a textbook.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:20 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca10",
    "id": "44326",
    "author": "MARJAN SIERHUIS",
    "title": "Patience",
    "url": "http://fiftywordstories.com/2020/09/16/marjan-sierhuis-patience/",
    "storyHTML": "<p>I watch father through a panel of glass.</p><p>I long to remove my mask and give him a hug, but the nursing home will not allow it.</p><p>Perhaps tomorrow, I tell myself.</p><p>Be patient.</p><p>For him, you have all the time in the world.</p>",
    "storyText": "I watch father through a panel of glass. I long to remove my mask and give him a hug, but the nursing home will not allow it. Perhaps tomorrow, I tell myself. Be patient. For him, you have all the time in the world.",
    "bio": "Marjan Sierhuis loves reading 50-word stories.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca0f",
    "id": "44324",
    "author": "JL MATTHEWS",
    "title": "The Truth and the Lie",
    "url": "http://fiftywordstories.com/2020/09/16/jl-matthews-the-truth-and-the-lie/",
    "storyHTML": "<p>He ripped loose the foil, poured, and stirred.</p><p>“And you don’t see it as a problem?” she asked.</p><p>He turned and sipped his coffee. “I do it all the time, too.”</p><p>“What? Lie?”</p><p>He nodded. “He is an artist, Kathy. It is through the lie that he reveals the truth.”</p>",
    "storyText": "He ripped loose the foil, poured, and stirred. \"And you don't see it as a problem?\" she asked. He turned and sipped his coffee. \"I do it all the time, too.\" \"What? Lie?\" He nodded. \"He is an artist, Kathy. It is through the lie that he reveals the truth.\"",
    "bio": "JL Matthews is a Medium.com top writer of fiction, history, and humor. His writing can be found at <a href=\"https://medium.com/@JLMatthews\" rel=\"noopener noreferrer\" target=\"_blank\">medium.com/@JLMatthews</a>",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca0e",
    "id": "44313",
    "author": "MEGHA NAYAR",
    "title": "Ms. Robin Hood",
    "url": "http://fiftywordstories.com/2020/09/15/megha-nayar-ms-robin-hood/",
    "storyHTML": "<p>She’s an entrepreneur, though not of life-altering stuff. No vaccines or edu-tech.</p><p>She makes beauty potions for the uber-rich. Sells the promise of lifelong allure, at 500% profit. They buy happily.</p><p>Then she gives their money away. Feeds, shelters, medicates the destitute. Anonymously.</p><p>She’s the legal kind of Robin Hood.</p>",
    "storyText": "She's an entrepreneur, though not of life-altering stuff. No vaccines or edu-tech. She makes beauty potions for the uber-rich. Sells the promise of lifelong allure, at 500% profit. They buy happily. Then she gives their money away. Feeds, shelters, medicates the destitute. Anonymously. She's the legal kind of Robin Hood.",
    "bio": "Megha Nayar writes to remain sane. It is her escape from drudgery, dealing with people, and the drudgery of dealing with people.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca0d",
    "id": "44311",
    "author": "DEIRDRE SMITH",
    "title": "Birthday Boy",
    "url": "http://fiftywordstories.com/2020/09/15/deirdre-smith-birthday-boy/",
    "storyHTML": "<p>He lies in the bubbly bath water, face protruding enough to comfortably breathe.</p><p>I gently pour water over the soapy hair on his forehead, the bit that didn’t quite make the dive.</p><p>He doesn’t flinch.</p><p>He smiles at me and I at him.</p><p>Today, my baby is a six-year-old fish.</p>",
    "storyText": "He lies in the bubbly bath water, face protruding enough to comfortably breathe. I gently pour water over the soapy hair on his forehead, the bit that didn't quite make the dive. He doesn't flinch. He smiles at me and I at him. Today, my baby is a six-year-old fish.",
    "bio": "Deirdre is a stay-at-home mom to three young children. She has a degree in English and a Masters in Counselling Psychology.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca0c",
    "id": "44302",
    "author": "JAMES MENGES",
    "title": "Who Should Know?",
    "url": "http://fiftywordstories.com/2020/09/14/james-menges-who-should-know/",
    "storyHTML": "<p>My terminal patient’s only hope is a kidney transplant.</p><p>His estranged adult daughter returns after her mother’s death and agrees to be tested as a potential donor.</p><p>The test results cry, “Incompatible match.”</p><p>There is no proper way to tell either of them that she is not his biological daughter.</p>",
    "storyText": "My terminal patient's only hope is a kidney transplant. His estranged adult daughter returns after her mother's death and agrees to be tested as a potential donor. The test results cry, \"Incompatible match.\" There is no proper way to tell either of them that she is not his biological daughter.",
    "bio": "James Menges is a writer and photographer. He is a member of the Dramatists Guild of America.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca0b",
    "id": "44300",
    "author": "PAUL LAMAR",
    "title": "Trail Terpsichore",
    "url": "http://fiftywordstories.com/2020/09/14/paul-lamar-trail-terpsichore/",
    "storyHTML": "<p>At the running trail’s straightaway, I knew I could make my legs pistons, sprint like I was 25, but suddenly Goose-Poop Alley loomed, 100 yards of goopy green and brown sidewalk smudges. I leaped, twisted, quick-minced, and lunged, the ballet dancer I’d never been but was now—magnificently!–at 74.</p>",
    "storyText": "At the running trail's straightaway, I knew I could make my legs pistons, sprint like I was 25, but suddenly Goose-Poop Alley loomed, 100 yards of goopy green and brown sidewalk smudges. I leaped, twisted, quick-minced, and lunged, the ballet dancer I'd never been but was now - magnificently!–at 74.",
    "bio": "Paul Lamar lives with his husband, Mark, in Albany, NY, not far from three grown children and two swell grandkids.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca0a",
    "id": "44293",
    "author": "RAN WALKER",
    "title": "Drowning",
    "url": "http://fiftywordstories.com/2020/09/11/ran-walker-drowning/",
    "storyHTML": "<p>I warn her not to over-water the plant in the window, but she insists that more water is needed to reach the roots. This is just like her: to do a little too much, to love a little too hard. Just like that plant, one day I, too, will drown.</p>",
    "storyText": "I warn her not to over-water the plant in the window, but she insists that more water is needed to reach the roots. This is just like her: to do a little too much, to love a little too hard. Just like that plant, one day I, too, will drown.",
    "bio": "Ran Walker is the author of 22 books, including the 50-word story collection THE STRANGE MUSEUM. He teaches creative writing at Hampton University in Virginia.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca09",
    "id": "44291",
    "author": "MICHELLE WILSON",
    "title": "Cozy",
    "url": "http://fiftywordstories.com/2020/09/11/michelle-wilson-cozy/",
    "storyHTML": "<p>I’m all cozy in bed when the closet door creaks open.</p><p><em>You’ve got to be kidding me.</em></p><p>Outside, the wind whips and howls. I recall the earlier news report: Escaped convict, armed and dangerous.</p><p>The door’s sliver of darkness stares at me.</p><p>Should’ve buried them before calling it a night.</p>",
    "storyText": "I'm all cozy in bed when the closet door creaks open. You've got to be kidding me. Outside, the wind whips and howls. I recall the earlier news report: Escaped convict, armed and dangerous. The door's sliver of darkness stares at me. Should've buried them before calling it a night.",
    "bio": "Michelle Wilson graduated from Bennington College with a degree in literature and creative writing. Her words have appeared or are forthcoming in <em>101 Words, Literally Stories, Flash Fiction Magazine, Lost Magazine, Papierdoll, Mr. Beller’s Neighborhood, Healthcare in America</em>, and <em>The Miami Herald</em>. She lives in Miami Beach, Florida.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca08",
    "id": "44277",
    "author": "REBECCA RUVINSKY",
    "title": "Missed Connection",
    "url": "http://fiftywordstories.com/2020/09/10/rebecca-ruvinsky-missed-connection/",
    "storyHTML": "<p>When her heel snapped, she literally fell into his arms.</p><p>Embarrassed laughter, quick smiles, then hasty apologies – she was late. Now hobbled, she’d be even later. Impulse seized him; he called her a taxi, paid for it as she zipped away.</p><p>He picked up the broken heel, thinking of Cinderella.</p>",
    "storyText": "When her heel snapped, she literally fell into his arms. Embarrassed laughter, quick smiles, then hasty apologies – she was late. Now hobbled, she'd be even later. Impulse seized him; he called her a taxi, paid for it as she zipped away. He picked up the broken heel, thinking of Cinderella.",
    "bio": "Rebecca Ruvinsky is a student, poet, and emerging writer in Orlando, Florida. She has kept a streak of writing a poem every day since 2016, with her poetry being featured on Poetry on the Move. She loves baking cookies, watching rocket launches, and listening to music too loud. She can be found at <a href=\"http://twitter.com/writeruvinsky\" target=\"_blank\" rel=\"noopener noreferrer\">@writeruvinsky</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca07",
    "id": "44275",
    "author": "CMF WRIGHT",
    "title": "Smile",
    "url": "http://fiftywordstories.com/2020/09/10/cmf-wright-smile/",
    "storyHTML": "<p>She didn’t need her smile after her husband died, so she gave it to her daughter, who was pregnant. Years later, she looked up to see someone walk through her door. It was her old friend the smile, now with short legs and rosy cheeks.</p><p>“Have some cookies,” she said.</p>",
    "storyText": "She didn't need her smile after her husband died, so she gave it to her daughter, who was pregnant. Years later, she looked up to see someone walk through her door. It was her old friend the smile, now with short legs and rosy cheeks. \"Have some cookies,\" she said.",
    "bio": "<a href=\"http://twitter.com/cmf_wright\" rel=\"noopener noreferrer\" target=\"_blank\">C.M.F. Wright</a> writes sentences that occasionally turn into stories. Her short stories have appeared in 50-Word Stories, Syntax &amp; Salt Magazine and the VSS365 Anthology.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:30 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca06",
    "id": "44273",
    "author": "LUCINDA GUNNIN",
    "title": "Finding Hope",
    "url": "http://fiftywordstories.com/2020/09/09/lucinda-gunnin-finding-hope/",
    "storyHTML": "<p>The autumn leaves fell in the soft breeze and swirled around Penny’s feet as she trudged down the lane. The world was dying around her, perhaps more so than in years past.</p><p>Heart heavy, she chose the biggest acorn, dug a deep hole in the yard, and planted fresh hope.</p>",
    "storyText": "The autumn leaves fell in the soft breeze and swirled around Penny's feet as she trudged down the lane. The world was dying around her, perhaps more so than in years past. Heart heavy, she chose the biggest acorn, dug a deep hole in the yard, and planted fresh hope.",
    "bio": "Lucinda Gunnin is a commercial property manager and author in the western Philadelphia suburbs, looking for hope that 2020 will eventually end.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca05",
    "id": "44271",
    "author": "ALYSSA MINAKER",
    "title": "bislexik",
    "url": "http://fiftywordstories.com/2020/09/09/alyssa-minaker-bislexik/",
    "storyHTML": "<p>I’ve seen this word. I’ve traced its letters, spelled it, tapped it, sang it, formed it with clay, formed it in sand, and closed my eyes real tight and pictured it hundreds of times, times, times, but my brain is like a giant bulb, full of hot air, blinking red.</p>",
    "storyText": "I've seen this word. I've traced its letters, spelled it, tapped it, sang it, formed it with clay, formed it in sand, and closed my eyes real tight and pictured it hundreds of times, times, times, but my brain is like a giant bulb, full of hot air, blinking red.",
    "bio": "Alyssa Minaker is a reading support teacher who helps students with dyslexia.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca04",
    "id": "44267",
    "author": "JAYNE MARTIN",
    "title": "H",
    "url": "http://fiftywordstories.com/2020/09/08/jayne-martin-h/",
    "storyHTML": "<p>The needle pierces my worn-out vein. A schism opens between mind and body, thoughts and deeds; widens as I tumble into chaos, search for your eyes in those that turn away. Waves of light bear down on me. Blasts of sound. My head meets the pavement. And there you are.</p>",
    "storyText": "The needle pierces my worn-out vein. A schism opens between mind and body, thoughts and deeds; widens as I tumble into chaos, search for your eyes in those that turn away. Waves of light bear down on me. Blasts of sound. My head meets the pavement. And there you are.",
    "bio": "Jayne Martin lives in Santa Barbara, California. She is a Pushcart, Best Small Fictions, and Best Microfictions nominee, and a recipient of Vestal Review’s VERA award. Her collection of microfiction, “Tender Cuts,” from Vine Leaves Press, is available now through all online book sellers. See more at <a href=\"http://jaynemartin-writer.com\" rel=\"noopener noreferrer\" target=\"_blank\">jaynemartin-writer.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca03",
    "id": "44269",
    "author": "LEA JOY P FRIAS",
    "title": "Memories and Flowers",
    "url": "http://fiftywordstories.com/2020/09/08/lea-joy-p-frias-memories-and-flowers/",
    "storyHTML": "<p>The widower, Mr. Rochester, didn’t pick up his rose bouquet today. He says roses remind him of his beautiful wife.</p><p>His neighbor, Mr. John, walked in the next day. He asked, “Do you have Yellow Pansy?”</p><p>I answered, “No. Why?”</p><p>“Pansy would remind me of my good friend, Mr. Rochester.”</p>",
    "storyText": "The widower, Mr. Rochester, didn't pick up his rose bouquet today. He says roses remind him of his beautiful wife. His neighbor, Mr. John, walked in the next day. He asked, \"Do you have Yellow Pansy?\" I answered, \"No. Why?\" \"Pansy would remind me of my good friend, Mr. Rochester.\"",
    "bio": "Lea is a ghost writer who hides in another person’s shadow. She came out today to write stories again.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca02",
    "id": "44257",
    "author": "THOMAS MALLOCH",
    "title": "Me and Neil and Buzz",
    "url": "http://fiftywordstories.com/2020/09/07/thomas-malloch-me-and-neil-and-buzz/",
    "storyHTML": "<p>I remember it well. Me and Neil and Buzz, loping along, kicking up moon dust like cowboys home, home on the range. Only we had no horses and we wore space helmets, not stetsons.<br>So many times I’ve watched that footage. Yet it’s always a surprise: I’m never in shot.</p>",
    "storyText": "I remember it well. Me and Neil and Buzz, loping along, kicking up moon dust like cowboys home, home on the range. Only we had no horses and we wore space helmets, not stetsons. So many times I've watched that footage. Yet it's always a surprise: I'm never in shot.",
    "bio": "Thomas Malloch is a retired doctor from Scotland. Always a reader, he thought he might try his hand at writing. He completed a Masters in Creative Writing (Distinction) at theOpen University in 2018. His work has appeared in <em>the barcelona review</em>, <em>Bath Flash Fiction</em>, <em>Reflex Fiction</em>, and <em>Gutter</em>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca01",
    "id": "44255",
    "author": "PATRICK YU",
    "title": "Time for the daily walk",
    "url": "http://fiftywordstories.com/2020/09/07/patrick-yu-time-for-the-daily-walk/",
    "storyHTML": "<p>My dog waits at the door<br>Outside he’s in his element</p><p>His charismatic smile<br>A beacon<br>For everyone to greet him<br>He thrives on affection</p><p>Times have changed</p><p>His disappointed eyes look back<br>For an explanation<br>There is no affection from six feet?</p><p>How surreal<br>The virus<br>And its implications</p>",
    "storyText": "My dog waits at the door Outside he's in his element His charismatic smile A beacon For everyone to greet him He thrives on affection Times have changed His disappointed eyes look back For an explanation There is no affection from six feet? How surreal The virus And its implications",
    "bio": "After 42 years of working with industrial computers, robots, and automation, Patrick Yu has retired. While not ideal times, he looks forward to his many hobbies, one of which is writing.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836ca00",
    "id": "44248",
    "author": "JOHN H. DROMEY",
    "title": "Mechanical Response",
    "url": "http://fiftywordstories.com/2020/09/04/john-h-dromey-mechanical-response/",
    "storyHTML": "<p>Following a grandson’s visit, Dot got a phone call.</p><p>“Did you get frustrated and yell at Dad?” her daughter asked.</p><p>“Regarding his hearing aid, I may have raised my voice to ask whether he wanted me to change his batteries.”</p><p>“That explains it! Sammy thinks his grandpa is a robot.”</p>",
    "storyText": "Following a grandson's visit, Dot got a phone call. \"Did you get frustrated and yell at Dad?\" her daughter asked. \"Regarding his hearing aid, I may have raised my voice to ask whether he wanted me to change his batteries.\" \"That explains it! Sammy thinks his grandpa is a robot.\"",
    "bio": "John H. Dromey’s short fiction’s been published in Mystery Weekly Magazine and over one-hundred-fifty other venues.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9ff",
    "id": "44246",
    "author": "LORNA YE",
    "title": "Dear Grandma",
    "url": "http://fiftywordstories.com/2020/09/04/lorna-ye-dear-grandma/",
    "storyHTML": "<p>Thinking of you is like sipping my second cup of coffee of the day: not a yearning rush, just savoring the dreamy warmth and bittersweetness. My eyes will still moisten suddenly, fogged in the aroma of the past, when my fingers run across your old ring laced with green patina.</p>",
    "storyText": "Thinking of you is like sipping my second cup of coffee of the day: not a yearning rush, just savoring the dreamy warmth and bittersweetness. My eyes will still moisten suddenly, fogged in the aroma of the past, when my fingers run across your old ring laced with green patina.",
    "bio": "Lorna Ye writes flash fiction and poetry. She enjoys listening to soft jazz and trying new recipes.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9fe",
    "id": "44240",
    "author": "YASH SEYEDBAGHERI",
    "title": "Inbox Emptiness",
    "url": "http://fiftywordstories.com/2020/09/03/yash-seyedbagheri-inbox-emptiness/",
    "storyHTML": "<p>Nancy vanquishes electronic rejections from lit mags, slays alumni newsletters, and eliminates campaign letters.</p><p>They call her, “Dear Nancy.”</p><p>She prefers Nance, Nanny, old nicknames conveying light footsteps, laughter, whispered secrets. She wishes they’d ask about her worst day. Her favorite movie.</p><p>Empty spaces taunt.</p><p>Full inboxes hide so much.</p>",
    "storyText": "Nancy vanquishes electronic rejections from lit mags, slays alumni newsletters, and eliminates campaign letters. They call her, \"Dear Nancy.\" She prefers Nance, Nanny, old nicknames conveying light footsteps, laughter, whispered secrets. She wishes they'd ask about her worst day. Her favorite movie. Empty spaces taunt. Full inboxes hide so much.",
    "bio": "Yash Seyedbagheri is a graduate of Colorado State University’s MFA program in fiction. His work is forthcoming or has been published in WestWard Quarterly, Café Lit, and Ariel Chart, among others.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9fd",
    "id": "44238",
    "author": "TAWNIA COURAGE",
    "title": "Getting Old",
    "url": "http://fiftywordstories.com/2020/09/03/tawnia-courage-getting-old/",
    "storyHTML": "<p>Mom shuffles to the car, back stooped, frustrating tremors slowing her progress.</p><p>Walker, bed rail, shower seat, suitcase, and a box rattling with pills are packed for her visit.</p><p>She struggles to fasten her seatbelt, so I help.</p><p>“Thanks… Getting old isn’t for wimps, you know.”</p><p>I smile, feeling blessed.</p>",
    "storyText": "Mom shuffles to the car, back stooped, frustrating tremors slowing her progress. Walker, bed rail, shower seat, suitcase, and a box rattling with pills are packed for her visit. She struggles to fasten her seatbelt, so I help. \"Thanks… Getting old isn't for wimps, you know.\" I smile, feeling blessed.",
    "bio": "Tawnia is an elementary teacher in Ontario who started writing a few years ago. You can find her on Twitter <a href=\"http://twitter.com/TawniaCourage\" rel=\"noopener noreferrer\" target=\"_blank\">@TawniaCourage</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:37 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9fc",
    "id": "44227",
    "author": "CAMPBELL HINSHELWOOD",
    "title": "The Drone",
    "url": "http://fiftywordstories.com/2020/09/02/campbell-hinshelwood-the-drone/",
    "storyHTML": "<p>He came again this afternoon, floated right down into the garden. I waited by the back door with my net but he was too quick, escaping under a hum of rotator blades and flashing lights.</p><p>The boy’s quite the pilot.</p><p>Next time we’ll see how he fares against my rifle.</p>",
    "storyText": "He came again this afternoon, floated right down into the garden. I waited by the back door with my net but he was too quick, escaping under a hum of rotator blades and flashing lights. The boy's quite the pilot. Next time we'll see how he fares against my rifle.",
    "bio": "Campbell is a photographer and aspiring writer from Sydney’s Eastern Suburbs. <a href=\"http://campbellhinshelwood.com\" rel=\"noopener noreferrer\" target=\"_blank\">campbellhinshelwood.com</a>",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9fb",
    "id": "44225",
    "author": "ROBERT MARKOVICH",
    "title": "Scratched",
    "url": "http://fiftywordstories.com/2020/09/02/robert-markovich-scratched/",
    "storyHTML": "<p>Scanning the discarded Scratch-Off tickets on the ground, I wonder what their transitory owners had coveted. A hulking new SUV with the Limited Leather Package? A garish new McMansion with ten bedrooms and a 110-inch TV? A new life?</p><p>Then I carefully check that all the scratch-offs were, indeed, scratched-off.</p>",
    "storyText": "Scanning the discarded Scratch-Off tickets on the ground, I wonder what their transitory owners had coveted. A hulking new SUV with the Limited Leather Package? A garish new McMansion with ten bedrooms and a 110-inch TV? A new life? Then I carefully check that all the scratch-offs were, indeed, scratched-off.",
    "bio": "Robert Markovich spent a lifetime in what is charitably referred to as service journalism, writing and editing stories about everything from cars to toilets, most recently at Consumer Reports. He is happily and gratefully retired.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9fa",
    "id": "44216",
    "author": "LAURIE-ANNE JEAN-BAPTISTE",
    "title": "Blue Light",
    "url": "http://fiftywordstories.com/2020/09/01/laurie-ann-jean-baptiste-blue-light/",
    "storyHTML": "<p>He drew on his cigarette and wondered how incessant electronic noise could coexist with silence. Loneliness consumed his soul. A room filled with only his body and too much smoke. Perpetual late mornings and nights, made of blue light and introspection too heavy to bear. Undoubtedly, his days were numbered.</p>",
    "storyText": "He drew on his cigarette and wondered how incessant electronic noise could coexist with silence. Loneliness consumed his soul. A room filled with only his body and too much smoke. Perpetual late mornings and nights, made of blue light and introspection too heavy to bear. Undoubtedly, his days were numbered.",
    "bio": "Laurie-Anne has been writing for as long as she can remember and is only now ready to share her stories and ideas with the world… or at least part of the internet. A Cinema and Communications graduate, she has also studied Creative Writing. When she isn’t pursuing artistic endeavours, Laurie-Anne works as a Marketing professional.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f9",
    "id": "44214",
    "author": "MARILYN McFARLANE",
    "title": "The Choice",
    "url": "http://fiftywordstories.com/2020/09/01/marilyn-mcfarlane-the-choice/",
    "storyHTML": "<p>She was torn between two lovers.</p><p>One gave her a pink silk negligee and said if she wore it every night, he’d know she was his.</p><p>The other gave her his softest old shirt and said if she wore it she’d know he was hers.</p><p>She chose the right one.</p>",
    "storyText": "She was torn between two lovers. One gave her a pink silk negligee and said if she wore it every night, he'd know she was his. The other gave her his softest old shirt and said if she wore it she'd know he was hers. She chose the right one.",
    "bio": "Marilyn McFarlane is a travel writer and the author of Sacred Stories: Wisdom From World Religions. She also writes poetry, memoir and fiction. She lives in Oregon, where there is a lot of scope for the imagination.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f8",
    "id": "44208",
    "author": "CLARISSE DE JESUS",
    "title": "Clueless",
    "url": "http://fiftywordstories.com/2020/08/31/clarisse-de-jesus-clueless/",
    "storyHTML": "<p>Everyone says people should keep away from that solitary house at the dead end of Wolfsbane Street. A witch lives there.</p><p>But I’ve been there once, alone, and no harm has befallen me.</p><p>Truth be told, she’s an extremely sweet and alluring woman. I’m asking her to marry me tonight.</p>",
    "storyText": "Everyone says people should keep away from that solitary house at the dead end of Wolfsbane Street. A witch lives there. But I've been there once, alone, and no harm has befallen me. Truth be told, she's an extremely sweet and alluring woman. I'm asking her to marry me tonight.",
    "bio": "Clarisse de Jesus believes in love at first sight, depending on her mood. Follow the twists and turns of her turbulent thoughts at <a href=\"http://autumnleavesnowfalls.wordpress.com\" rel=\"noopener noreferrer\" target=\"_blank\">autumnleavesnowfalls.wordpress.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f7",
    "id": "44206",
    "author": "ANGIE ROBERTS",
    "title": "Babysitting",
    "url": "http://fiftywordstories.com/2020/08/31/angie-roberts-babysitting/",
    "storyHTML": "<p>Granny, babysitting two-year-old triplets, took a bathroom break. She heard the toy box being pushed down the hall, stopping by the bathroom door. Giggling; then the click of the dead bolt installed to keep the boys from playing in the commode, and three pairs of feet running away.</p>",
    "storyText": "Granny, babysitting two-year-old triplets, took a bathroom break. She heard the toy box being pushed down the hall, stopping by the bathroom door. Giggling; then the click of the dead bolt installed to keep the boys from playing in the commode, and three pairs of feet running away.",
    "bio": "Angie has been writing short stories since 2010 and has had one piece published.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f6",
    "id": "44204",
    "author": "CHARY",
    "title": "Play to Lose",
    "url": "http://fiftywordstories.com/2020/08/28/chary-play-to-lose/",
    "storyHTML": "<p>Wrinkles on her nose and graphic tee bestill his heart. <em>Their first album’s good</em>, he reassures, <em>but nowadays they’re trash</em>.</p><p>Eyebrows quirk.</p><p>Seizing his chance, he suggests they experience real music this weekend, but she declines.</p><p>He says she’s playing hard to get. She says he’s playing hard to want.</p>",
    "storyText": "Wrinkles on her nose and graphic tee bestill his heart. Their first album's good, he reassures, but nowadays they're trash. Eyebrows quirk. Seizing his chance, he suggests they experience real music this weekend, but she declines. He says she's playing hard to get. She says he's playing hard to want.",
    "bio": "Chary writes at a snail’s pace.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f5",
    "id": "44202",
    "author": "REB ELKIN",
    "title": "Try Again",
    "url": "http://fiftywordstories.com/2020/08/28/reb-elkin-try-again/",
    "storyHTML": "<p>She has been here at least eight times before, judging by the number of past selves in the crowd. She carefully keeps herself out of their sight. They must not know that they will fail. They will find out soon enough.</p><p>She lifts her blaster and locks onto her target.</p>",
    "storyText": "She has been here at least eight times before, judging by the number of past selves in the crowd. She carefully keeps herself out of their sight. They must not know that they will fail. They will find out soon enough. She lifts her blaster and locks onto her target.",
    "bio": "Reb Elkin writes science fiction &amp; fantasy, and is slightly obsessed with time travel.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f4",
    "id": "44199",
    "author": "JOHN H DROMEY",
    "title": "Overkill",
    "url": "http://fiftywordstories.com/2020/08/27/john-h-dromey-overkill/",
    "storyHTML": "<p>“If he hopes to hold on to his title, our newly-appointed chief of police really needs to get his priorities straight.”</p><p>“Why? What did he do?”</p><p>“His first day on the job, he found a housefly in his office. Rather than handle it himself, he called for a S.W.A.T. team.”</p>",
    "storyText": "\"If he hopes to hold on to his title, our newly-appointed chief of police really needs to get his priorities straight.\" \"Why? What did he do?\" \"His first day on the job, he found a housefly in his office. Rather than handle it himself, he called for a S.W.A.T. team.\"",
    "bio": "John H. Dromey’s short fiction’s been published in <em>Mystery Weekly Magazine</em> and over 150 other venues.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f3",
    "id": "44197",
    "author": "LISA LILLIBRIDGE",
    "title": "Live Generously",
    "url": "http://fiftywordstories.com/2020/08/27/lisa-lillibridge-live-generously/",
    "storyHTML": "<p>Today I encountered two women on my walk. Wearing a pink, <em>Live Generously</em> t-shirt, an older woman didn’t look up as I said hello for the 6th day. The second woman, younger, walking two labs—one brown, one yellow—turned away when I said good morning.</p><p>I will keep trying.</p>",
    "storyText": "Today I encountered two women on my walk. Wearing a pink, Live Generously t-shirt, an older woman didn't look up as I said hello for the 6th day. The second woman, younger, walking two labs - one brown, one yellow - turned away when I said good morning. I will keep trying.",
    "bio": "Lisa Lillibridge is an artist/photographer/writer raised in South Dakota. She spends her time in Burlington, Vermont and Sandwich, Massachusetts.  Her work is mostly about identity and the tricky business of finding home within oneself. See more at <a href=\"https://lisalillibridge.com/\" rel=\"noopener noreferrer\" target=\"_blank\">lisalillibridge.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:48 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f2",
    "id": "44195",
    "author": "NATALIE PARSONS",
    "title": "Breath",
    "url": "http://fiftywordstories.com/2020/08/26/natalie-parsons-breath/",
    "storyHTML": "<p>They touched our faces, stroked our clothes, fingered our chain-laden necks, loaded us into the coffins. They set the coordinates.</p><p>“Why?” I said. “The world is big enough!”</p><p>“Hush; there is no air left for you. You took it away when you started breathing.”</p><p>“Besides,” another added, “space is bigger.”</p>",
    "storyText": "They touched our faces, stroked our clothes, fingered our chain-laden necks, loaded us into the coffins. They set the coordinates. \"Why?\" I said. \"The world is big enough!\" \"Hush; there is no air left for you. You took it away when you started breathing.\" \"Besides,\" another added, \"space is bigger.\"",
    "bio": "Natalie Parsons is a writer and blogger, and she’s trying hard this year to get really good at it. Find more of her writing at <a href=\"https://itspastmybedtimebut.wordpress.com/\" rel=\"noopener noreferrer\" target=\"_blank\">itspastmybedtimebut.wordpress.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f1",
    "id": "44193",
    "author": "PATRICK YU",
    "title": "A Lost Moment",
    "url": "http://fiftywordstories.com/2020/08/26/patrick-yu-a-lost-moment/",
    "storyHTML": "<p>A bright morning<br>The blue skies and waves<br>Toes in the sand<br>I sip coffee<br>As two children<br>Search the shore<br>“Hey dad look”<br>They call out all the marvels they explore<br>Dad oblivious with cellphone to ear<br>Smiles and nods<br>A moment<br>Absorbed<br>With warmth<br>From a casual stranger</p>",
    "storyText": "A bright morning The blue skies and waves Toes in the sand I sip coffee As two children Search the shore \"Hey dad look\" They call out all the marvels they explore Dad oblivious with cellphone to ear Smiles and nods A moment Absorbed With warmth From a casual stranger",
    "bio": "Sometimes life’s moments get lost.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9f0",
    "id": "44189",
    "author": "JENNIFER L FREED",
    "title": "Hannah’s Walk",
    "url": "http://fiftywordstories.com/2020/08/25/jennifer-l-freed-hannahs-walk/",
    "storyHTML": "<p>Scent of mown grass. Faint jingle of Brody’s tags, and the pull of his leash in her palm.</p><p>Down the street, Milo and Sasha splashing in the pool, and little Ben crying, “Wait for me!”</p><p>Then the honeysuckle sweetness hedging the Jones’ yard. She’d hardly noticed before her vision dimmed.</p>",
    "storyText": "Scent of mown grass. Faint jingle of Brody's tags, and the pull of his leash in her palm. Down the street, Milo and Sasha splashing in the pool, and little Ben crying, \"Wait for me!\" Then the honeysuckle sweetness hedging the Jones' yard. She'd hardly noticed before her vision dimmed.",
    "bio": "Jennifer L Freed mostly writes poems, but likes 50-word stories.  Her website is <a href=\"http://jfreed.weebly.com\" rel=\"noopener noreferrer\" target=\"_blank\">jfreed.weebly.com</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9ef",
    "id": "44191",
    "author": "TOM HARRIS",
    "title": "New Atlantis",
    "url": "http://fiftywordstories.com/2020/08/25/tom-harris-new-atlantis/",
    "storyHTML": "<p>Alex was a deaf, mute tour guide. Today he was under with a group of twenty or so, signing to explain how, just fifty years ago, people worked in these vertical buildings stretching into the sky. In the tallest of them, the upper windows, not far underwater, were still intact.</p>",
    "storyText": "Alex was a deaf, mute tour guide. Today he was under with a group of twenty or so, signing to explain how, just fifty years ago, people worked in these vertical buildings stretching into the sky. In the tallest of them, the upper windows, not far underwater, were still intact.",
    "bio": "Tom Harris is an engineer and teacher inspired by daily life. When words fill up his head, he shakes them out on virtual paper.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9ee",
    "id": "44184",
    "author": "PAUL LAMAR",
    "title": "Madame Kosinski",
    "url": "http://fiftywordstories.com/2020/08/24/paul-lamar-madame-kosinski/",
    "storyHTML": "<p>Despite the disasters, both personal and professional, that characterized Madame Isabel Kosinski’s days, she found renewal in the half hour when she was alone, standing by her Chevy Caprice in Rosemont Park, having two cigarettes and a cup of coffee, every day, rain or shine, surveying the netless tennis courts.</p>",
    "storyText": "Despite the disasters, both personal and professional, that characterized Madame Isabel Kosinski's days, she found renewal in the half hour when she was alone, standing by her Chevy Caprice in Rosemont Park, having two cigarettes and a cup of coffee, every day, rain or shine, surveying the netless tennis courts.",
    "bio": "Paul Lamar lives with his husband, Mark, in Albany, NY, where–in better times–he teaches, reviews theater for a local paper, and conducts a chorus. Alas!",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9ed",
    "id": "44182",
    "author": "BOB THURBER",
    "title": "Wanted: Lazy Readers",
    "url": "http://fiftywordstories.com/2020/08/24/bob-thurber-wanted-lazy-readers/",
    "storyHTML": "<p>Website featuring miniature stories currently seeking apathetic readers. No skills required. No pay, no benefits, no rewards. Lack of enjoyment contingent on how distracted and unmindful you might be. Readers who take their time and pay considerable attention need not apply. Same with those who may wish to contemplate allegory.</p>",
    "storyText": "Website featuring miniature stories currently seeking apathetic readers. No skills required. No pay, no benefits, no rewards. Lack of enjoyment contingent on how distracted and unmindful you might be. Readers who take their time and pay considerable attention need not apply. Same with those who may wish to contemplate allegory.",
    "bio": "Bob Thurber is the author of six books. Regarded as a master of Flash and Micro Fiction, his work has appeared in Esquire and other magazines, been anthologized 60 times, received a long list of awards, and been utilized in schools and colleges throughout the world. He resides in Massachusetts. Visit his website at&nbsp;<a href=\"http://bobthurber.net/\" target=\"_blank\" rel=\"noopener noreferrer\">BobThurber.net</a>.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9ec",
    "id": "44180",
    "author": "ELIZA MIMSKI",
    "title": "Ava Goes back to School",
    "url": "http://fiftywordstories.com/2020/08/21/eliza-mimski-ava-goes-back-to-school/",
    "storyHTML": "<p>The school reopened. Ava approached her first grade classroom in her iron suit, double pair of blue hospital gloves, face shield that extended to her waist and multi-layered mask that curved around her small face.</p><p>Her mother said Ava was lucky. In many states, students were required to stay home.</p>",
    "storyText": "The school reopened. Ava approached her first grade classroom in her iron suit, double pair of blue hospital gloves, face shield that extended to her waist and multi-layered mask that curved around her small face. Her mother said Ava was lucky. In many states, students were required to stay home.",
    "bio": "Eliza Mimski wrote this story.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9eb",
    "id": "44178",
    "author": "C ATTLEYA",
    "title": "Hiding",
    "url": "http://fiftywordstories.com/2020/08/20/c-attleya-hiding/",
    "storyHTML": "<p>This is what she hated most. Breaks.<br>Tea breaks, lunch breaks, unfamiliar faces, groups of chatting strangers, noise everywhere.<br>While she tried to hide in plain sight, she wondered how they did it. The others.<br>Was it too soon to go to the loo, again?<br>She wished she was invisible.</p>",
    "storyText": "This is what she hated most. Breaks. Tea breaks, lunch breaks, unfamiliar faces, groups of chatting strangers, noise everywhere. While she tried to hide in plain sight, she wondered how they did it. The others. Was it too soon to go to the loo, again? She wished she was invisible.",
    "bio": "C. Attleya lives in the beautiful garden of England. Her love for reading and writing is eclipsed only by her aversion of gatherings of noisy strangers.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9ea",
    "id": "44176",
    "author": "ROSALEEN LYNCH",
    "title": "Paper Cranes",
    "url": "http://fiftywordstories.com/2020/08/20/rosaleen-lynch-paper-cranes/",
    "storyHTML": "<p>The paper cranes are folded from receipts for doctors, buses and climate magazines, from my five year old’s drawings of our family, prescriptions for her meds, sweet wrappers and cigarette packets, and hang now to be counted, over her hospital bed, one more for every day since she didn’t die.</p>",
    "storyText": "The paper cranes are folded from receipts for doctors, buses and climate magazines, from my five year old's drawings of our family, prescriptions for her meds, sweet wrappers and cigarette packets, and hang now to be counted, over her hospital bed, one more for every day since she didn't die.",
    "bio": "Rosaleen Lynch, an Irish community worker and writer in the East End of London, pursues stories whether conversational, literary or performed and believes in the power of words to make the world a better place.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e9",
    "id": "44173",
    "author": "BEN MIMMACK",
    "title": "Look to the Future, Not the Past",
    "url": "http://fiftywordstories.com/2020/08/19/ben-mimmack-look-to-the-future-not-the-past/",
    "storyHTML": "<p>Everyone else is a newcomer. He lived here before they built the road. Before the road gave rise to the houses. Before the houses necessitated the church and the pub. But now they need a school and an old tree can’t be allowed to stand in the way of progress.</p>",
    "storyText": "Everyone else is a newcomer. He lived here before they built the road. Before the road gave rise to the houses. Before the houses necessitated the church and the pub. But now they need a school and an old tree can't be allowed to stand in the way of progress.",
    "bio": "Ben lives in Dallas where he is viewed with tolerant amusement by his wife and two small boys. He has just started writing micro fiction and hopes to get better at it.",
    "dateScraped": "Mon, 08 Mar 2021 12:03:58 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e8",
    "id": "44171",
    "author": "STEPHEN PISANI",
    "title": "Kid Hits a Homer",
    "url": "http://fiftywordstories.com/2020/08/19/stephen-pisani-kid-hits-a-homer/",
    "storyHTML": "<p>The crack of bat on ball rings in Danny’s ears. He sprints toward first base but doesn’t watch the ball soar over the fence. His teammates yell; evidence enough for him.</p><p>As he rounds third base, he glances at the space in the bleachers where his father used to sit.</p>",
    "storyText": "The crack of bat on ball rings in Danny's ears. He sprints toward first base but doesn't watch the ball soar over the fence. His teammates yell; evidence enough for him. As he rounds third base, he glances at the space in the bleachers where his father used to sit.",
    "bio": "Stephen Pisani is an MFA candidate in fiction at Adelphi University. He spends his spare time working at a golf course, where he watches people chase a little ball around a big patch of grass.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e7",
    "id": "44169",
    "author": "MANTZ YORKE",
    "title": "South Pole, 25 December",
    "url": "http://fiftywordstories.com/2020/08/18/mantz-yorke-south-pole-25-december/",
    "storyHTML": "<p>Icequake from the asteroid hit on Japan. The sky blotted out by dust; snow blackened; crevasses impassable. Communications dead for the past six months.</p><p>We celebrate Christmas: dinner is protein biscuits crumbled in water and our remaining brandy. The brandy warms us; later, the cold will numb us to sleep.</p>",
    "storyText": "Icequake from the asteroid hit on Japan. The sky blotted out by dust; snow blackened; crevasses impassable. Communications dead for the past six months. We celebrate Christmas: dinner is protein biscuits crumbled in water and our remaining brandy. The brandy warms us; later, the cold will numb us to sleep.",
    "bio": "Mantz Yorke is a former science teacher and researcher living in Manchester, England. His poems and prose have appeared in print magazines, anthologies, and e-magazines in the UK, Ireland, The Netherlands, Israel, Canada, the US, Australia, and Hong Kong. His poetry collection <em>Voyager</em> is published by Dempsey &amp; Windle.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e6",
    "id": "44167",
    "author": "EILEEN MARDRES",
    "title": "No",
    "url": "http://fiftywordstories.com/2020/08/18/eileen-mardres-no/",
    "storyHTML": "<p>Stopping was easy. Stay at home, clean the closets, read a book. But the weeks and months run on, and staying home has become the new normal.  It is more difficult to restart. When? How? Where?  And when everyone stopped calling to say, “Are you ok?”, that’s when I wasn’t.</p>",
    "storyText": "Stopping was easy. Stay at home, clean the closets, read a book. But the weeks and months run on, and staying home has become the new normal. It is more difficult to restart. When? How? Where? And when everyone stopped calling to say, \"Are you ok?\", that's when I wasn't.",
    "bio": "Eileen was intending to write her way through retirement; that has been supplanted by the need to write her way through the pandemic to once again reach retirement.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e5",
    "id": "44165",
    "author": "DAN BROOK",
    "title": "Anti-Racism Haiku",
    "url": "http://fiftywordstories.com/2020/08/17/dan-brook-anti-racism-haiku/",
    "storyHTML": "<p>there’s no art in hate<br>and no joy in ignorance<br>no racist haiku</p><p>we have to uproot<br>racism, sexism, &amp;<br>homophobia</p><p>stand up to fascists<br>resisting all racisms<br>whenever they rear</p><p>sweet, gentle being<br>cops killed him nevertheless<br>Elijah McClain</p><p>racism is wrong<br>we must have racial justice<br>to thrive together</p>",
    "storyText": "there's no art in hate and no joy in ignorance no racist haiku we have to uproot racism, sexism, &amp; homophobia stand up to fascists resisting all racisms whenever they rear sweet, gentle being cops killed him nevertheless Elijah McClain racism is wrong we must have racial justice to thrive together",
    "bio": "Dan Brook teaches in the Department of Sociology and Interdisciplinary Social Sciences at San Jose State University.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e4",
    "id": "44160",
    "author": "MONICA PEREZ NEVAREZ",
    "title": "Minimalism, Unwillingly",
    "url": "http://fiftywordstories.com/2020/08/17/monica-perez-nevarez-minimalism-unwillingly/",
    "storyHTML": "<p>You are my past, and Oh, how I cherish you.<br>The artwork, the books; the fine furniture saturated with memories.<br>You showcase five decades of my successes.</p><p>But once I could not pay, none of that mattered.</p><p>The storage company will auction you off, breaking my retirement heart,<br>without regard.</p>",
    "storyText": "You are my past, and Oh, how I cherish you. The artwork, the books; the fine furniture saturated with memories. You showcase five decades of my successes. But once I could not pay, none of that mattered. The storage company will auction you off, breaking my retirement heart, without regard.",
    "bio": "Monica Perez Nevarez is a sustainability consultant during the day and a writer by night, bearing witness to Covid’s ever-expanding collateral damage.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e3",
    "id": "44150",
    "author": "MICHELLE WILSON",
    "title": "Active Imagination",
    "url": "http://fiftywordstories.com/2020/08/14/michelle-wilson-active-imagination/",
    "storyHTML": "<p>I think my neighbor’s a psychopath with his vacant, roving eyes. Amazon keeps leaving his packages at my door: wood planks, duct tape, a chainsaw. And then: doghouse instructions.</p><p>I call him over, laughing. (I’ve always had an active imagination.)</p><p>As he steps inside, I see the leash.</p><p>“All alone?”</p>",
    "storyText": "I think my neighbor's a psychopath with his vacant, roving eyes. Amazon keeps leaving his packages at my door: wood planks, duct tape, a chainsaw. And then: doghouse instructions. I call him over, laughing. (I've always had an active imagination.) As he steps inside, I see the leash. \"All alone?\"",
    "bio": "Michelle Wilson graduated from Bennington College with a degree in literature and creative writing. Her words have appeared or are forthcoming in 101 Words, Literally Stories, Flash Fiction Magazine, Lost Magazine, Mr. Beller’s Neighborhood, Healthcare in America, and The Miami Herald. She lives in Miami Beach, Florida.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e2",
    "id": "44148",
    "author": "ERHARD FIRN",
    "title": "Loyalty",
    "url": "http://fiftywordstories.com/2020/08/14/erhard-firn-loyalty/",
    "storyHTML": "<p>The first betrayal crawled into my chest, compressed my heart and lungs. It quickly grew its branchlike arms up to my throat, aiming for strangulation. A bottle of whiskey, an old record, and twenty-one days diluted its power. The second betrayal is unable to pierce the shell of misery.</p>",
    "storyText": "The first betrayal crawled into my chest, compressed my heart and lungs. It quickly grew its branchlike arms up to my throat, aiming for strangulation. A bottle of whiskey, an old record, and twenty-one days diluted its power. The second betrayal is unable to pierce the shell of misery.",
    "bio": "Erhard Firn appreciates loyalty.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e1",
    "id": "44144",
    "author": "VIVIAN LEUNG",
    "title": "When Night Falls",
    "url": "http://fiftywordstories.com/2020/08/13/vivian-leung-when-night-falls/",
    "storyHTML": "<p>Sitting on the grassy hill,<br>the day goes by slow.<br>Then night falls.</p><p>I reached for stars in the sky,<br>wanting troubles to<br>end and die.</p><p>Only at night can the soul<br>and body and mind<br>take a rest.</p><p>So, I pray that in its splendor,<br>the night is long.</p>",
    "storyText": "Sitting on the grassy hill, the day goes by slow. Then night falls. I reached for stars in the sky, wanting troubles to end and die. Only at night can the soul and body and mind take a rest. So, I pray that in its splendor, the night is long.",
    "bio": "Vivian Leung lives in Scottsdale, Arizona and has always held a love for music and writing. One of her goals in life is to land a career in healthcare. There are few things that are more rewarding to her than helping others.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9e0",
    "id": "44142",
    "author": "JACKIE HEWITT",
    "title": "Matzo Balls Over Miami Beach",
    "url": "http://fiftywordstories.com/2020/08/13/jackie-hewitt-matzo-balls-over-miami-beach/",
    "storyHTML": "<p>When they first changed my diapers<br>I was cutting my baby teeth on Sinatra’s Miami Beach;<br>Mafia protection was part of the local landscape.</p><p>Fast forward; Miami Beach has risen from its own ashes four times,<br>I am into my second bout of diaper changes,<br>The Beach, its fifth resurrection.</p>",
    "storyText": "When they first changed my diapers I was cutting my baby teeth on Sinatra's Miami Beach; Mafia protection was part of the local landscape. Fast forward; Miami Beach has risen from its own ashes four times, I am into my second bout of diaper changes, The Beach, its fifth resurrection.",
    "bio": "Jackie’s sense of irony remains her survival tool in today’s colorful, but confounding world.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9df",
    "id": "44139",
    "author": "JAMES MENGES",
    "title": "Sunday Scrum",
    "url": "http://fiftywordstories.com/2020/08/12/james-menges-sunday-scrum/",
    "storyHTML": "<p>It was a weekly family competition. My siblings interlocked and huddled over the table like a championship rugby scrum. Instead of a ball, a plate of Mom’s fried chicken was slipped onto the table beneath the players.</p><p>Dad blew a whistle. Game on.</p><p>Whoever ate the fastest got the most.</p>",
    "storyText": "It was a weekly family competition. My siblings interlocked and huddled over the table like a championship rugby scrum. Instead of a ball, a plate of Mom's fried chicken was slipped onto the table beneath the players. Dad blew a whistle. Game on. Whoever ate the fastest got the most.",
    "bio": "James Menges is a writer and photographer. He is a member of the Dramatists Guild of America.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:08 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9de",
    "id": "44137",
    "author": "ALYSSA MINAKER",
    "title": "Clicks",
    "url": "http://fiftywordstories.com/2020/08/12/alyssa-minaker-clicks/",
    "storyHTML": "<p>Click, I post a picture of my dog.</p><p>Click, click, people like her fluffy fur.</p><p>How many did I get? Click, 23 likes.</p><p>I post another photo of her, but now with sad, droopy eyes.</p><p>Clickclickclickclickclickclickclickclickclickclickclick</p><p>104 likes.</p><p>Be more sad, I tell her.</p><p>They like you more that way.</p>",
    "storyText": "Click, I post a picture of my dog. Click, click, people like her fluffy fur. How many did I get? Click, 23 likes. I post another photo of her, but now with sad, droopy eyes. Clickclickclickclickclickclickclickclickclickclickclick 104 likes. Be more sad, I tell her. They like you more that way.",
    "bio": "Follow Alyssa Minaker <a href=\"https://www.instagram.com/alyssa.minaker/\" rel=\"noopener noreferrer\" target=\"_blank\">on Instagram</a> to give her more clicks.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9dd",
    "id": "44132",
    "author": "ESZTER MOLNAR",
    "title": "Again",
    "url": "http://fiftywordstories.com/2020/08/11/eszter-molnar-again/",
    "storyHTML": "<p>I hurried to the restaurant, my heart full of hope.</p><p>Will she smile at me today? I wondered. Ask me how my day was? Comment on my haircut?</p><p>She was sitting in the corner, reading. She didn’t look at me.</p><p>“You’re late,” she said as she turned a page. “Again.”</p>",
    "storyText": "I hurried to the restaurant, my heart full of hope. Will she smile at me today? I wondered. Ask me how my day was? Comment on my haircut? She was sitting in the corner, reading. She didn't look at me. \"You're late,\" she said as she turned a page. \"Again.\"",
    "bio": "Eszter Molnar is a former teacher who lives by the windswept British seaside with her partner and two children. She has been published in one of the UK’s biggest subscription magazines for children. By day, she cleans up after preschoolers, by night she writes picture books and Middle Grade fiction.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9dc",
    "id": "44130",
    "author": "PETER GASKELL",
    "title": "Stitched Up",
    "url": "http://fiftywordstories.com/2020/08/11/peter-gaskell-stitched-up/",
    "storyHTML": "<p>For her skilful embroidery work, the refugee camp charity gave her money to support her sisters still in Syria.</p><p>Her most beautiful dress yet, this one Yara imagined wearing after she reached Europe.</p><p>The man promising her safe sea passage smiled as he folded her battered banknote into his pocket.</p>",
    "storyText": "For her skilful embroidery work, the refugee camp charity gave her money to support her sisters still in Syria. Her most beautiful dress yet, this one Yara imagined wearing after she reached Europe. The man promising her safe sea passage smiled as he folded her battered banknote into his pocket.",
    "bio": "Since he was published in the Atlanta Review and his short screenplay ‘Pigs in Muck’ featured in the Lockdown Monologue Film Festival recently, Peter Gaskell is currently aiming to show how he values economy of language and so has taken to writing haiku and flash fiction where every word must be used to maximum effect",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9db",
    "id": "44124",
    "author": "RJ KINNARNEY",
    "title": "Empty Vessels",
    "url": "http://fiftywordstories.com/2020/08/10/rj-kinnarney-empty-vessels/",
    "storyHTML": "<p>Sarah lowers the wine bottle into the recycling bin and places it onto the stack below. It doesn’t make a sound. She’s practised at this. At silence.</p><p>In the living room, the laptop sits open at the grocery page. It suggests Pampers. She adds wine and tampons to her order.</p>",
    "storyText": "Sarah lowers the wine bottle into the recycling bin and places it onto the stack below. It doesn't make a sound. She's practised at this. At silence. In the living room, the laptop sits open at the grocery page. It suggests Pampers. She adds wine and tampons to her order.",
    "bio": "R. J. Kinnarney’s short story, The Blue Bowl, was runner-up in the Daunt Books short story competition. They have been longlisted in Retreat West flash fiction competitions. Their work has been published in The Write In and 100 Words of Solitude. They are currently working on a novel, which looks at attitudes to war, together with changing methods and speed of communication.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9da",
    "id": "44122",
    "author": "LINDA VIGEN PHILLIPS",
    "title": "The Lion and the Lamb",
    "url": "http://fiftywordstories.com/2020/08/10/linda-vigen-phillips-the-lion-and-the-lamb/",
    "storyHTML": "<p>When the lion emerged from the quarantine, he sidled up next to the lamb.</p><p>They had lunch together.</p><p>This happened before its time, contrary to Messianic prognostications.</p><p>Some say it was a hoax.<br>Some say it was a miracle.<br>Some say the vaccine.</p><p>Hard to know the truth these days.</p>",
    "storyText": "When the lion emerged from the quarantine, he sidled up next to the lamb. They had lunch together. This happened before its time, contrary to Messianic prognostications. Some say it was a hoax. Some say it was a miracle. Some say the vaccine. Hard to know the truth these days.",
    "bio": "Linda Vigen Phillips’ poems have appeared in <em>The Texas Review</em>, <em>California Quarterl</em>y, <em>NC Poetry Society Award Winning Poems 2001</em>, <em>Wellspring</em>, <em>Main Street Rag</em>, <em>Independence Boulevard</em>, and <em>The Whole Idea</em>. She has published two young adult novels in verse: <em>Crazy</em> and <em>Behind These Hands</em>. She lives in Charlotte, NC.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9d9",
    "id": "44112",
    "author": "BOJANA STOJCIC",
    "title": "A Moon Child",
    "url": "http://fiftywordstories.com/2020/08/07/bojana-stojcic-a-moon-child/",
    "storyHTML": "<p>Mom, why am I not like other kids? / Because you are special. / Are <em>you</em> special? / I am if you think I am. / Mom, what are you made of?<br>I felt for a pulse — but couldn’t find one. Wanted to say dead volcanoes and lava flows, bit my tongue, said cheese.</p>",
    "storyText": "Mom, why am I not like other kids? / Because you are special. / Are you special? / I am if you think I am. / Mom, what are you made of? I felt for a pulse  -  but couldn't find one. Wanted to say dead volcanoes and lava flows, bit my tongue, said cheese.",
    "bio": "Bojana Stojcic writes prose and poetry, and has her words published here and there. If she could fly right now, or ever, she’d most likely head for the moon.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9d8",
    "id": "44107",
    "author": "RAN WALKER",
    "title": "Beaufort",
    "url": "http://fiftywordstories.com/2020/08/06/ran-walker-beaufort/",
    "storyHTML": "<p>They had the kind of love<br>that camped out in cotton shirts<br>Damp with perspiration from<br>Morning gardening<br>Afternoon lovemaking<br>Evenings with her back pressed against his chest<br>As they looked into an endless sky<br>And pondered how the love they shared<br>Felt bigger than the entire universe before them</p>",
    "storyText": "They had the kind of love that camped out in cotton shirts Damp with perspiration from Morning gardening Afternoon lovemaking Evenings with her back pressed against his chest As they looked into an endless sky And pondered how the love they shared Felt bigger than the entire universe before them",
    "bio": "Ran Walker is the author of 21 books, including the 50-Word story collection THE STRANGE MUSEUM. He teaches creative writing at Hampton University in Virginia.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9d7",
    "id": "44105",
    "author": "GRAHAM ROBERT SCOTT",
    "title": "I Point at the Shadows in Lieu of What I Dread",
    "url": "http://fiftywordstories.com/2020/08/06/graham-robert-scott-i-point-at-the-shadows-in-lieu-of-what-i-dread/",
    "storyHTML": "<p>First night back, I ditch duffel and boots and fall asleep on the floor by his bed.</p><p>A click in the dark wakes me. Beside me he sits, Nerf gun in hand.</p><p>“What’s up?” I ask.</p><p>“Keeping you safe,” he says. Tilts his head at the darkness under the bed.</p>",
    "storyText": "First night back, I ditch duffel and boots and fall asleep on the floor by his bed. A click in the dark wakes me. Beside me he sits, Nerf gun in hand. \"What's up?\" I ask. \"Keeping you safe,\" he says. Tilts his head at the darkness under the bed.",
    "bio": "Graham Robert Scott’s stories have appeared in Pulp Literature, Nature, Barrelhouse, and others.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9d6",
    "id": "44099",
    "author": "CATHRINE GOLDSTEIN",
    "title": "Starting Over",
    "url": "http://fiftywordstories.com/2020/08/05/cathrine-goldstein-starting-over/",
    "storyHTML": "<p>“I will make this bad week good,”<br>she says with the tenacity of a teenager<br>clinging to the lie of a broken curfew—<br>the tire flat; the phone dead.</p><p>Hunting and pecking key after key,<br>certain each stroke will not just create<br>a new world,<br>but wash away the old.</p>",
    "storyText": "\"I will make this bad week good,\" she says with the tenacity of a teenager clinging to the lie of a broken curfew -  the tire flat; the phone dead. Hunting and pecking key after key, certain each stroke will not just create a new world, but wash away the old.",
    "bio": "Cathrine Goldstein writes a whole lot of gritty, real-feeling “stuff.” Most of it takes place in NYC. She also eats boat loads of chocolate pretty much every day. To find out more about her bestselling novels, award-winning plays, and other writings including articles, short stories, and poetry, please visit <a href=\"http://CathrineGoldstein.com\" rel=\"noopener noreferrer\" target=\"_blank\">CathrineGoldstein.com</a>",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  },
  {
    "_id": "604622d2617d9c0fb836c9d5",
    "id": "44097",
    "author": "MARIA CARGILLE",
    "title": "I moved out last year; leave again next month",
    "url": "http://fiftywordstories.com/2020/08/05/maria-cargille-i-moved-out-last-year-leave-again-next-month/",
    "storyHTML": "<p>Familiar kitchen sounds,<br>the blender’s roar and faucet’s trickle,<br>ground me here.</p><p>Illusory clouds of coffee<br>sting my nose,<br>an inescapable reminder<br>that summer is going fast<br>that vacation is nearly over.</p><p>I swallow hard,<br>and try to remember<br>how to not feel like a visitor<br>in my childhood home.</p>",
    "storyText": "Familiar kitchen sounds, the blender's roar and faucet's trickle, ground me here. Illusory clouds of coffee sting my nose, an inescapable reminder that summer is going fast that vacation is nearly over. I swallow hard, and try to remember how to not feel like a visitor in my childhood home.",
    "bio": "Maria is about to go back to college. She loves being home, but every once in a while, she’s overwhelmed by the understanding that things are changing.",
    "dateScraped": "Mon, 08 Mar 2021 12:04:15 GMT"
  }
]
