[
  {
    "id": 1,
    "author": "Brian Burmeister",
    "title": "People Are Always Ruining Things",
    "storyText": "In John's bedroom were dozens of photos of a girl I knew, but he didn't. She and I played together often as children. I had a good idea of what he did with those pictures. Back home, I destroyed every photo of her I'd ever cut out of the newspaper.",
    "storyHTML": "<p>In John's bedroom were dozens of photos of a girl I knew, but he didn't. She and I played together often as children.</p><p>I had a good idea of what he did with those pictures.</p><p>Back home, I destroyed every photo of her I'd ever cut out of the newspaper.</p>",
    "bio": "Brian Burmeister is Program Chair of English and Communication at Ashford University. He co-wrote the non-fiction play <strong>Farmscape: The Changing Rural Environment</strong>, published by Ice Cube Press.",
    "url": "http://fiftywordstories.com/2015/06/03/brian-burmeister-people-are-always-ruining-things/"
  },
  {
    "id": 2,
    "author": "Katya Duft",
    "title": "The Missing Wallet",
    "storyText": "Their first date went swimmingly. She hugged him often. Suddenly he couldn't find his money. He blushed and let her know. She rolled her eyes, tossed some bills on the counter, and left. Outside she took a wallet out of her purse, removed cash and cards, then threw it away.",
    "storyHTML": "<p>Their first date went swimmingly. She hugged him often.</p><p>Suddenly he couldn't find his money. He blushed and let her know. She rolled her eyes, tossed some bills on the counter, and left.</p><p>Outside she took a wallet out of her purse, removed cash and cards, then threw it away.</p>",
    "bio": "Katya Duft is a translator, interpreter, and language teacher, and enjoys writing short stories, poetry, and her blog, <a href=\"https://www.facebook.com/groups/483407231790494/\" target=\"_blank\" class=\"out-link\"><strong>Tales from the Bus</strong></a>.",
    "url": "http://fiftywordstories.com/2015/09/14/katya-duft-the-missing-wallet/"
  },
  {
    "id": 3,
    "author": "Pontius Paiva",
    "title": "Palindrome",
    "storyText": "Stories written backwards really are nonsense. Unpublishable as discarded tales collecting dust. Misunderstood. Why are words tricky? How one shows irony of knowing without knowledge. Knowledge, without knowing of irony, shows one how tricky words are. Why? Misunderstood, dust collecting tales discarded as unpublishable nonsense, are really backwards written stories.",
    "storyHTML": "<p>Stories written backwards really are nonsense. Unpublishable as discarded tales collecting dust. Misunderstood. Why are words tricky? How one shows irony of knowing without knowledge.</p><p>Knowledge, without knowing of irony, shows one how tricky words are. Why? Misunderstood, dust collecting tales discarded as unpublishable nonsense, are really backwards written stories.</p>",
    "bio": "Pontius Paiva is a lover of palindromes who refuses to kayak. Read more at <a href=\"http://pontiuspaiva.com/\" target=\"_blank\" class=\"out-link\">pontiuspaiva.com</a>.",
    "url": "http://fiftywordstories.com/2016/11/22/pontius-paiva-palindrome/"
  },
  {
    "id": 4,
    "author": "Ellen Hansen",
    "title": "Surrender",
    "storyText": "The wasp finds itself trapped inside a water glass held up against a window. It repeatedly slams itself against the window, rebounding off the water glass. Spent, it finally surrenders. I slide paper between window and water glass, and free the wasp outside. Surrender is not always what it seems.",
    "storyHTML": "<p>The wasp finds itself trapped inside a water glass held up against a window. It repeatedly slams itself against the window, rebounding off the water glass. Spent, it finally surrenders.</p><p>I slide paper between window and water glass, and free the wasp outside.</p><p>Surrender is not always what it seems.</p>",
    "bio": "Ellen Hansen is a writer and fiddle player living in Helvetia, Oregon. She recently retired from leading international tours. Her story <strong>Surrender</strong> received first place in the 2019 Oregon Writers Colony 50 word story contest.",
    "url": "http://fiftywordstories.com/2019/11/15/ellen-hansen-surrender/"
  },
  {
    "id": 5,
    "author": "Tawnia Courage",
    "title": "Screams of the Heart",
    "storyText": "My son has a plot - his own little piece of real estate. The grass is sparse, so I tend it: raking topsoil, spreading seed, pouring water. New sprouts emerge, filling the aching gaps. I remove the weeds, pretending he's on vacation. But my heart screams his name and I cry.",
    "storyHTML": "<p>My son has a plot—his own little piece of real estate. The grass is sparse, so I tend it: raking topsoil, spreading seed, pouring water. New sprouts emerge, filling the aching gaps.</p><p>I remove the weeds, pretending he's on vacation.</p><p>But my heart screams his name and I cry.</p>",
    "bio": "Tawnia is an elementary teacher in Ontario who recently started writing. She is revising her first novel, a YA sci-fi, and hopes to start querying agents soon. She recently told a Red Chair story via Zoom for the Graham Norton Show. You can find her on Twitter <a href=\"https://twitter.com/TawniaCourage\" target=\"_blank\" class=\"out-link\">@TawniaCourage</a>.",
    "url": "http://fiftywordstories.com/2020/07/28/tawnia-courage-screams-of-the-heart/"
  }
]
